{
  "sessions": [
    {
      "id": "445152",
      "title": "A Deep Dive into Caching with Service Workers",
      "description": "Service workers solve a huge problem with web applications – allowing users to continue using your application even when they are offline. Many packages bill themselves as a drop-in solution for offline functionality. It just works! Until it doesn’t. 🥲\r\n\r\nWhat to do when things go sideways? We have to dive deep! By understanding the Service Worker lifecycle, caching strategies, and pitfalls, we can equip ourselves with the necessary knowledge to get out of thorny situations. We’ll also look at ways to debug and test your service workers so you can deploy with confidence.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "9bd888db-205e-4384-9243-8cf087e47f5d"
      ],
      "categoryItems": [
        159281
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "442176",
      "title": "Build-a-Bot Workshop: Make an SMS Chatbot Therapist",
      "description": "With artificial intelligence gaining both interest and popularity over time, Diana shares how humans have integrated this technology into their respective industries. The effects of chatbots generating more human-like conversations have led to the revolution of psychotherapy, and now you have the opportunity to replicate it.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "dea947af-9049-44fb-b853-42e45300dadf"
      ],
      "categoryItems": [
        159278
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "449946",
      "title": "Building a Design system",
      "description": "Design systems have been generating a lot of hype lately and rightfully so! They can provide better user experiences, promote best practices, and help you develop products faster. But, before you open your favorite design tool or code editor to start throwing things together, there are some things you need to identify and document to prevent issues.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b642eabd-7250-4ac5-b3b0-ce01951b88aa"
      ],
      "categoryItems": [
        159276
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "448383",
      "title": "Building Ingress - From Concept to Connection",
      "description": "At first glance, ingress is an easy concept: you route traffic from the wider world into your cluster. As you layer on SSL and load balancing, the principles stay the same and everything works with minimal thought and effort. But as your infrastructure grows, your clusters grow, the interactions get more complex, and your security requirements explode. In this session, I’ll walk you through how we designed and built an Ingress Controller and have converted our clusters to use it in production to support millions of requests. It wasn’t easy but running it as an open source effort from the start encouraged our team and customers to review, explore, and consider situations outside our original plans.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f0f1fa39-eb24-4ab6-866c-b8645975bd75"
      ],
      "categoryItems": [
        159283
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "429998",
      "title": "Coding and the Mozart Effect",
      "description": "Most developers code to music...some are even musicians themselves.  Is it possible to streamline workflow by adjusting how we listen to music and what music we listen to?\r\n\r\nStudies have shown that exposure to certain kinds of music can help to develop cognitive strength and improve performance of tasks.  This talk will explore those studies and show what sort of things can be done to improve the listeners environment and help people to create better code.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "63f88157-8b36-4e54-8ccc-affa12510ffc"
      ],
      "categoryItems": [
        159279
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "430037",
      "title": "Dark UX Patterns",
      "description": "Congratulations! You are the 1,000,000th visitor to our website. Click here to redeem your prize! Just provide your date of birth and phone number to get started.\r\n\r\nLearn about Dark UX Patterns, how they work, how they trick you and what companies are the worst offenders. Roach Motel, Privacy Zuckering? Let’s visit Dark Patterns Hall of Shame and see who joined the dark side!\r\n\r\nThis talk will break down the most popular dark patterns using real life examples from websites and apps you use every day. If you are a designer, a developer or a product manager, you will learn what to avoid when building your product and how to integrate digital well-being and safety features into your service. If you are an end user, we will teach you how to respond to dark patterns in order to stay safe online, protect your privacy, save your money and keep your sanity.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "11fbf1c5-b0fc-42eb-a027-4fea2e54bb12"
      ],
      "categoryItems": [
        159276
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "445279",
      "title": "Database DevOps: Options for database change management",
      "description": "Whether you are the DBA for an Agile, Sprint-based team, or a developer with DBA responsibilities, you may feel like the development bottleneck at every turn. Managing migrations with your ORM of choice is easy but often error-prone and hard to manage as the project grows. Or worse yet, maybe your schema and change management is a folder full of poorly commented SQL scripts saved to a shared folder or local drive.\r\n\r\nSurely there's a better, SQL-centric way to manage databases as code, validate changes, and deploy updates - right? Yes, there is!\r\n\r\nThis talk will explore what database DevOps is and how open-source and paid tools like Flyway can help you manage database schema and code changes while incorporating agile CI/CD practices.\r\n\r\nBy the end of the session, you'll be ready to tame your rogue application databases, managing changes and migrations with ease, and become the envy of the development team.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0785f402-af78-4d26-a024-a1fb32fefe04"
      ],
      "categoryItems": [
        159283
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "442240",
      "title": "Debugging Burnout",
      "description": "Working in a product space requires knowing how to take a very complex problem and break it down into iterative chunks.  Far too often, we’re so wrapped up in the problems we’re solving professionally, that we completely forget to introspectively look at ourselves and ask what problems in our own lives need solving.  Burnout is real and worth addressing.  But much like the dev process, understanding the “why” behind behavior leads to a more sustainable outcome.\r\n\r\nThis talk is a part of an ongoing conversation in life.  We want to develop a framework and language to properly identify burnout and how we can work through it.  Let’s take some time in this iteration of the conversation and talk about what it is, why it’s a problem, and how we can leverage tools at our disposal to help identify, address, and debug burnout.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "df992bbb-7d7a-4898-b2bf-252076fd9457"
      ],
      "categoryItems": [
        159279
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "450221",
      "title": "Definition of Done: FUN.  (Coding software you can PLAY!!!!)",
      "description": "Most of our day to day professional lives are spent solving technical problems.  We feel a little personal victory every time we move that little story card to the \"DONE\" column.  But does software development have to be so goal oriented? So business driven? How about writing software which specifically has no specific business goal? Who's Definition of Done is simply this: IS IT FUN? \r\nGrown over decades of tinkering, the open source PureData real-time patcher environment and its shiny commercial cousin, MAX, have existed solely for the purpose of being played.  In this session we will look at how PD and MAX have been used for creative works for generations and how we can build our own - be it a music instrument of Dr Suessian complexity or a video art installation controlled by the movement of its observers - we will look at how to build software to be experienced and enjoyed.  ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5faa6420-5ed1-4138-ad81-7e3c890502f3"
      ],
      "categoryItems": [
        159277
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "449820",
      "title": "Developing APIs on the Edge and Reducing Operational Costs",
      "description": "Our API services billions of requests during an election season so we're always on the hunt to make things more resilient and to find places where we can reduce cost. In this talk we about some of the choices we made to accomplish and the pros and cons. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "aae8e930-83f8-45be-b1a9-d47075235565"
      ],
      "categoryItems": [
        159282
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "450242",
      "title": "Ditch heavy JS and KISS your frontend again with HTML over-the-wire",
      "description": "In the 2010’s it was all the rage to decouple your website rendering it with a JS frontend connected to a JSON API backend. In the 2020’s it’s now all the rage to move state back to the server sending only HTML back to the browser. Less code, faster page loads, and a happier developer experience. What’s not to like? Let’s party like it’s 1999 again! \r\n\r\nIn this talk we will go over:\r\n- The reasons why most people moved away from server-rendered apps\r\n- The reasons why most people are moving back to server-rendered apps\r\n- How the hypermedia approach compares to frontend framework + JSON API\r\n- Examples in Hotwire, htmx, and Unpoly\r\n- The types of projects that can benefit from these tools\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d5383829-0901-4bb9-918b-1118c196c314"
      ],
      "categoryItems": [
        159281
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "436867",
      "title": "Ditch the Media Queries: Modern CSS Replacements for Better Responsive Code",
      "description": "In Ye Olden Days of Webbe Development, device-based breakpoints were the standard…then, best practices shifted to content-based breakpoints. Now, breakpoints are sooo 2010; the era of fluid design is here! Dive into the new CSS that empowers us to write responsive code – without the media queries.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "44406a2e-5504-47d4-8fef-6d5c110704a0"
      ],
      "categoryItems": [
        159281
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "430133",
      "title": "Don't put your messages in a bottle; Implement messaging patterns",
      "description": "When building enterprise solutions, messages are the heart of our communication. They convey commands and data between various systems and ensure that we can work in a decoupled, scalable, and distributed manner. Our messages represent value, so we can't just slip them in a bottle, toss them into the ocean, and hope they arrive at their destination. Instead, we need a messaging backbone that can provide resilience and stability. Therefore, we implement proven messaging patterns, to ensure they are handled with the care they deserve.\r\n\r\nIn this session we will have a look at Azure Service Bus, and what role it takes in such designs. Through various demos, we will showcase its implementation with a wide variety of messaging patterns. As a result we come to understand how secure and reliable communication help us solve complex messaging challenges. \r\n\r\nCome and learn about handling transactions involving different systems, implementing data consistency across them, and controlling intermittent and critical failures.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "11a684d4-ace1-49e8-be4b-c4e5ff215a7c"
      ],
      "categoryItems": [
        159282
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "447976",
      "title": "Foster a Culture of Learning Through Observability",
      "description": "Observability helps engineers understand the systems they have built, but it can also help engineers new to a team and even engineers new to tech in general understand the systems they will be working on. \r\n\r\nThis session provides an introduction to observability terms and concepts and tells the story of one platform engineering team’s observability adoption to illustrate those concepts. We will explore how observability creates a learning culture, how every engineer on a team can benefit from observability, and how observability builds a foundation to enable onboarding new engineers more effectively, leveling up engineers, and taking on apprentice engineers.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8ae0a45e-573c-4ab1-8ca0-bc1e31bcec0e"
      ],
      "categoryItems": [
        159280
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "434401",
      "title": "Getting Good at Code Reviews",
      "description": "If you write code, you should review code. \r\nThat's it. \r\nThat's the talk. \r\n\r\nThere are quite a few \"reasons\" why developers at various levels find themselves code-review averse: impostor syndrome, time constraints, and area of expertise are a few I've heard. For code owners and project leads, it's a constant battle.\r\n\r\nBut it shouldn't be! It doesn't have to be! \r\n\r\nLet's discuss the benefits of reviewing code, what it is, what it ain't, and how to make it more than the blind rubber stamp approvals we've grown used to. I'll show you my process and things that have helped me cultivate totally awesome code reviewers!",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b1655789-7394-4979-9c93-ada3ee56dd45"
      ],
      "categoryItems": [
        159280
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "435644",
      "title": "Growing the Next Generation of Developers Through Volunteering",
      "description": "There is an increasing demand for computer science courses yet a shortage of teachers with the subject matter expertise required to teach these classes. The Microsoft Philanthropies TEALS Program provides a short-term solution to the teacher shortage and helps schools build a long-term and sustainable computer science program by partnering teachers new to computer science with industry volunteers who have computer science content expertise. Teachers in these partnerships learn computer science while team-teaching with volunteers until they are comfortable teaching independently. In this session, participants will hear about the Microsoft TEALS approach and discuss how industry volunteers can make an impact in a computer science classroom.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "09f1a897-fb01-4ed0-9178-5d383517928e"
      ],
      "categoryItems": [
        159279
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "449862",
      "title": "Hostile JavaScript: Attacking and Defending the Browser",
      "description": "How much JavaScript is on your website? Do you know what it does? No really, have you looked at the code and seen what it does? Probably not.\r\n\r\nJavaScript controls the client side environment, and we can use it to compromise users, consume resources, and steal data. Yet many websites continue to add scripts without review, audit, or thought.\r\n\r\nLet’s explore what JavaScript can do to a browser, the vectors that JavaScript can get added to websites, and how we can defend against JavaScript attacks. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5f017dbb-6821-480b-a750-82a0f15fa1b2"
      ],
      "categoryItems": [
        159285
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "450213",
      "title": "Improving Data Access with Abstractions",
      "description": "Most apps need data - but how you access data can have huge implications on your code's maintainability. Most approaches cause some degree of pain, but you can follow Pain Driven Development to refactor to different approaches.\r\n\r\nIn this code-heavy approach, you'll see how an app starts with a low-level tightly-coupled data access approach and iteratively evolves to address the pain points encountered.\r\n\r\nBy the end of the session, the app's data access will be encapsulated and modular and the app will be testable and maintainable. And you'll have learned a variety of design patterns and refactoring techniques that you can apply to your own applications.\r\n\r\nDemos and samples will use C#/.NET, but principles and patterns are applicable to other platforms and languages.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a5d50f4e-f021-4983-97a9-73f9415b3d5b"
      ],
      "categoryItems": [
        159282
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "445363",
      "title": "Interactive Notebooks for the Polyglot with Python, .NET, SQL, JS, and more!",
      "description": "Have you ever wanted to run a small experiment or create an example to share with your team but didn't want to go through the boilerplate of setting up a new project? Did you ever wish you could embed interactive code examples alongside your documentation? Project Jupyter and Polyglot Notebooks might be up your alley.\r\n\r\nIn this talk you'll see how Jupyter Notebooks, Jupyter Labs, and Polyglot Notebooks (formerly .NET Interactive) offer interactive ways of running code in a minimal environment alongside rich markup documentation. We'll cover what notebooks are, what they're used for, setting up your notebook in Jupyter and Polyglot Notebooks, and how the various code blocks can be used.\r\n\r\nAlong the way we'll feature examples using Python, JavaScript, C#, F#, SQL, HTML, Mermaid diagrams, and more.\r\n\r\nFinally, we'll close with a discussion of sharing your notebooks with others and how notebooks can serve as rich interactive documentation, proofs of concept, and might even be considered an entire class of application in their own right.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "17c299ee-d9fd-4020-b499-2837b2b3a2bf"
      ],
      "categoryItems": [
        159284
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "431084",
      "title": "Maintaining Accessibility in Complicated Components",
      "description": "Vue provides many wonderful tools for composing fragments of UI code in various different ways. As Vue developers, we spend a great deal of time working with abstractions created by ourselves or others, and as such it can be easy to lose touch with the actual HTML output of our applications. \r\n\r\nThis is especially true when complicated interactivity is involved. In this talk we'll reflect on how we can use automated testing to focus on the accessible \"identity\" of our interactive features. By understanding the underlying patterns and testing them, we can make sure the application is behaving correctly and that our tests see through our architecture so that core accessible behaviors that matter to users don't get lost in the shuffle.\r\n\r\nWe will use Cypress as our test runner to show examples, but will focus on general ideas about what is being tested, and why, not the tool itself.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "1d48e051-b2ac-4aa5-9e5b-78b376819a72"
      ],
      "categoryItems": [
        159281
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "433539",
      "title": "Messaging, Queueing, and Eventing with Azure De-Mystified",
      "description": "With Event Hub, IoT Hub, Service Bus, and Azure Storage Queue, Azure has a number of PaaS offerings available when it comes to Queueing, Eventing, and Messaging.  The number of services and mystery about their purposes can lead to a bit of analysis paralysis when it comes to which service to use, and, more importantly, when to use each service.  \r\n\r\nIn this session we will explore the services available at Azure for queueing, handling events, and messaging, and we'll look at appropriate examples of when and how to use each of them.   By the end of the talk you'll be  ready to go make a recommendation to your team about which service to use for various scenarios, and you'll have seen how to easily integrate these services into your .Net applications. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0c4f74c9-6be8-40d0-b588-674d3b783472"
      ],
      "categoryItems": [
        159283
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "430112",
      "title": "Microservice Trench Warfare - Taming the Beast you Created",
      "description": "Incoming Grenade! Hope your architecture can handle that blow. No? Come on in and learn how a self healing microservices architecture can make you bullet proof. No more 2:00 AM calls that production is down. I'll walk you through a large scale Microservices system we built and how we weathered the blows. Patterns that work, war stories from the trenches. We'll laugh and we'll cry as I describe the tactics, tips and tricks you need to run a successful Microservice based system. Circuit breakers, Partitioning/bulk heads, CQRS are just a few topics we cover with real world examples you can take back with you.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "973867cc-56ac-4920-8819-7fef548d6585"
      ],
      "categoryItems": [
        159282
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "432453",
      "title": "Migrate Your Legacy ASP.NET Projects to ASP.NET Core Incrementally with YARP",
      "description": "YARP (Yet Another Reverse Proxy) might have a funny name, but it a very serious tool when it comes to helping you upgrade your legacy ASP.NET projects to ASP.NET Core. The best part is, it helps you do the upgrade gradually, and with minimal impact to your users.\r\n\r\nCome learn how to add YARP to your ASP.NET project, and how it uses the \"Strangle Fig Pattern\" to allow you to incrementally migrate your application to ASP.NET Core.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d108027a-7e26-46f5-b92d-9f6cb59eb283"
      ],
      "categoryItems": [
        159281
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "450233",
      "title": "No, ChatGPT isn't going to take your job, but it might just help you get things done.",
      "description": "As artificial intelligence continues to advance at a rapid pace, many people are worried about the impact it will have on the job market. However, in the case of ChatGPT, those fears are largely unfounded. While it's true that ChatGPT is capable of performing many tasks that were once the exclusive domain of humans, it's important to remember that ChatGPT is a tool, not a replacement for human workers. In fact, ChatGPT has the potential to help people get more done than ever before.\r\n\r\nIn this talk, we'll explore the capabilities of ChatGPT and discuss how it can be used to streamline workflows, improve productivity, and make our lives easier. We'll look at real-world examples of how ChatGPT is being used today, from automating customer service to generating creative content. We'll also discuss the ethical considerations of using AI in the workplace and explore how we can ensure that we're using these tools responsibly.\r\n\r\nUltimately, the goal of this talk is to dispel the fear and uncertainty that surrounds AI and to show how ChatGPT can be a powerful ally in the workplace. Whether you're a business owner looking to improve efficiency or an employee looking to streamline your workload, ChatGPT has the potential to help you get things done like never before. So join us as we explore the exciting world of AI and discover how ChatGPT can help you achieve your goals.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bb52359f-7de5-4ab4-be0c-e0fdf39b7134"
      ],
      "categoryItems": [
        159284
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "431063",
      "title": "Not Your Mother's or Father's C#",
      "description": "Gone are the days of verbose C# code and having only one way to solve a problem. In recent updates, C# has been adapting ideas from other programming paradigms, including functional programming. Some of the most recent ones have significantly changed the appearance of C# code. We'll see what you think after this session!\r\n\r\nWhether you're using C# every day, or you haven't looked at the language in a while, this fast-paced session will show you what has been changing in the C# world. \r\n\r\nUnlike the classic \"coming soon\" session where you can't take what you learn home and apply it, you can take what you learn here back home to remove redundant code, streamline your classes, and add flexible type constraints. This is a fun, fast-paced session that will provide you with the insight you need to make the changes you want in your code.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "1dbfb6bc-c1f2-44af-9294-3614597b165e"
      ],
      "categoryItems": [
        159275
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "443439",
      "title": "Optimizing Application Performance",
      "description": "When it comes to user experience a snappy application beat a glamorous one. Nothing frustrates an end user more than a slow application. Did you know that any wait time greater than one second will break a user's concentration and cause them to feel frustration? How can we create applications to meet user expectations? This class will cover all things performance from design to delivery. We will go over application design, user interface guidelines, caching guidelines, code optimizations, and query optimizations.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b7e99b0d-fe29-4715-ad58-566126f49c1b"
      ],
      "categoryItems": [
        159275
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "431413",
      "title": "Practical Auth(entication|orization) for Developers",
      "description": "It's never been easier to launch a website or expose services over HTTP. It's also never been easier to make rookie mistakes in the authentication of those services.\r\n\r\nThis session is designed for the average developer/architect that's struggling to make sense of modern authentication options. You'll learn the differences between OAuth, API Keys, HMAC, JSON Web Tokens (JWT), SAML, and more. \r\n\r\nDon't worry if those things sound foreign; they'll be explained in a clear, practical way so that you can choose the appropriate tool for your needs without making rookie mistakes.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b7235790-4c4a-491c-a8a1-1ed82a5d70b3"
      ],
      "categoryItems": [
        159285
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "441532",
      "title": "React Native and Expo CLI: Developing and Testing Your First App",
      "description": "React Native is a powerful cross platform framework for building mobile apps using JavaScript & React. We'll talk about the basics of React Native and what Expo and Expo CLI are. Next we'll set up the development environment, create, and test our first app! This talk will be more hands on than a traditional slide deck so be prepared to follow along on your laptop to get the most out of this talk!\r\n\r\nNote: Some experience with React will help but isn't necessary to get the most out of this talk.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "12a83353-24d5-4400-bb8e-8ceaf4b8102d"
      ],
      "categoryItems": [
        159278
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "436852",
      "title": "Real-time Event Processing with Python",
      "description": "As real-time event streaming has become a necessity in many organizations, a plethora of libraries, frameworks, and applications have arisen to help meet that need. These different tools each have their own strengths and weaknesses, and you may end up deciding to use one or more of them, but when starting out, it’s often best to start simple. \r\n\r\nIn this session, we will look at several techniques that we can use to build real-time applications with just Apache Kafka and the confluent-kafka Python package. You may be surprised at how far we can go with these simple tools, but we will also discuss the challenges you might face and the signs that you may need to pull a more powerful tool out of your toolbox. \r\n\r\nTo avoid being too abstract, we’ll put some of our new knowledge to work by building an application that processes real-time social media data to see who is doing the most talking about #StirTrek. Attendees will be able to join in the conversation and maybe see their names on the leaderboard!\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "2b6c01c1-02ec-4b51-8eb1-a7d86d50687b"
      ],
      "categoryItems": [
        159284
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "449170",
      "title": "Rethinking Architecture: A Look at Macroservices",
      "description": "In the beginning, all software was a single, monolithic executable. However, large scale executables quickly became unwieldy, cumbersome, and a nightmare to update and maintain. We took a step back and addressed the problems. As such, Service Oriented Architecture was born, and we all rejoiced. However, these large scale services quickly became unwieldy, cumbersome, and a nightmare to update and maintain. We took a step back and addressed the problems. As such, Microservices were born, and we all rejoiced.\r\n\r\nUnfortunately, the honeymoon with Microservices is now over, as we start to see problems with this style. In this talk, we'll take a step back, and look at the pros and cons of both SOA and Microservices. From there, we can weigh these concerns and try to find a happy middle ground, which I affectionately refer to as Macroservices. By the end, we'll have an appreciation for the concerns we must weigh as we decide how to build or refactor our next application.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "94732aa0-c688-45c1-b92b-7ebad08ea8e0"
      ],
      "categoryItems": [
        159282
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "438201",
      "title": "Snapchat Lens Developers for the Win!",
      "description": "Snapchat is one of the most popular social media platforms today. In large part, due to their filters that bring AR technologies into our daily lives. Lens development is quickly becoming a new career for all levels and genres in computer science. A lens developer uses skills such as JavaScript, 3D art, and analytics to build engaging filters. \r\n\r\nMy presentation will show how to get started as a Lens developer for free using Snapchat's own Lens Studio platform. We will cover templates, custom scripts, and importing 3D objects to publish your own custom lens to the world. \r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "895833fa-4bbd-4d2a-bc58-195064458f4e"
      ],
      "categoryItems": [
        159277
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "446618",
      "title": "Strategizing Products and Customer Experiences",
      "description": "In an era of faster, faster, faster, our workplaces are sacrificing quality, collaboration, and the customer experience to “just ship it.” Business goals don’t seem to overlap with customers’ needs. Customers don’t want Minimally Viable anything, but we keep delivering that.\r\n\r\nCustomers notice when we get it wrong. Our competitors, investors, shareholders, the press, bloggers, and social media notice. Morale suffers, and we might have trouble retaining or hiring the best staff. \r\n\r\nGreat customer experiences require the right team and strategies in place to predict and mitigate the risk of delivering wrong or flawed products, services, and experiences (PSE). Marketing and sales initiatives have uphill battles when we are offering PSE that are difficult to learn, frustrating to use, or not meeting customers’ real needs.\r\n\r\nThis session has actionable advice and models for how you can start shifting process, teams, and our companies towards true customer-centricity.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "6e3f3714-82bb-4fee-873b-975239263814"
      ],
      "categoryItems": [
        159276
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "448009",
      "title": "Strongly-typed CSS with Vanilla-extract",
      "description": "Sick of memorizing awkward naming conventions? Are you losing sleep thinking about how to author maintainable CSS at scale? CSS-in-JS frameworks not performant enough? Tired of banging your head against a wall, trying to figure out why your CSS isn’t working, only to realize you spelled the class wrong? Look no further than Vanilla-extract + Sprinkles.\r\nIn this session, you’ll learn how to write type-safe, locally scoped classes, variables, and themes to generate static CSS files at build time.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "f38f42d8-7623-457c-8871-dbb44bc458da"
      ],
      "categoryItems": [
        159275
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "431085",
      "title": "The Four Principles of Accessibility",
      "description": "While many in the design community are aware of inclusivity and accessible design practices, the reasons are still not understood. My talk walks the listener through the WCAG 2.1 and explains how the four principles, collectively referred to as POUR, apply to product design and development. These four principles specifically target areas where users have trouble accessing digital content. The goal is to help product teams understand how to think about and approach accessibility so they can build products that enable independence.  ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "79e36469-a9f5-4e58-9294-5215db739aef"
      ],
      "categoryItems": [
        159276
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "444997",
      "title": "The Hazards of Sitting: An Osteopath’s Approach to Preventing Work-Related Injury.",
      "description": "As an Osteopathic physician, I received many hours of training and education on injury and disease prevention. But I did not realize the impact of spending a majority of my time sitting at a desk would have on my overall movement and flexibility.  \r\nBecause of this, I will provide background education on the most common injuries software engineers are at risk to develop and how I try to prevent these by implementing a few simple measures daily at work. \r\nSome of the measures include proper chair/desk/monitor adjustment, workspace setup, stretching routine that can be easily implemented at your desk and much more.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b4b9d0ac-4135-4e89-804c-3b3ce22082c7"
      ],
      "categoryItems": [
        159279
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "442371",
      "title": "The Mystery of the Ever Increasing AWS Bill",
      "description": "Do you love a good mystery? Join our engineer on a quest to uncover the mystery of the ever increasing AWS Bill. Laugh at the multiple false starts. Witness the discovery of the true cause. Enjoy the victory of cost control. Maybe learn something along the way.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3ec45bcc-5de8-4495-a341-f2f94256189d"
      ],
      "categoryItems": [
        159283
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "433947",
      "title": "Tracking Aircraft with Redis & Software-Defined Radio",
      "description": "Aircraft are everywhere. Knowing exactly where is paramount as it’s considered bad form for two aircraft to be in the same place at the same time. To avoid this, aircraft worldwide constantly and publicly broadcast their location, heading, and all sorts of other data using a system called ADS-B or Automatic Dependent Surveillance Broadcast.\r\n\r\nThis data is a natural fit for a streaming architecture. After all, it’s a constant stream of data that is literally being broadcast in real-time. But how can we capture these broadcasts and the data within? Surely it must require expensive hardware and special tools!\r\n\r\nNot so much. It turns out that we can capture ADS-B data easily using a combination of a cheap radio dongle and free software—a combination called software-defined radio. From there we can store it in a streaming data structure and consume, transform, and publish it using microservices. Cool, right?\r\n\r\nIn this session, you’ll learn how software-defined radio works (and not just for ADB-S), how to receive and store ADS-B data in streams, and how to use those streams with microservices. And, I’ll do it all by example—building a dashboard showing real-time flight data using Node.js, Redis Streams, and whatever front-end JavaScript framework happens to be popular that day!",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "520bf4ca-b2d3-47c3-8475-c25bb2b257f7"
      ],
      "categoryItems": [
        159277
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "434806",
      "title": "Watch this! Building a Health app for WatchOS",
      "description": "One of the most popular answers for a favorite smart watch feature is to monitor your health. From steps to heart rate to exercise to sleep, smart watches do it all and with Jetpack Compose and Health Services, we can build our own app for WatchOS! \r\n\r\nDuring this talk, we’ll explore building for this tiny screen using Compose for WearOS, a declarative framework for creating watch interfaces quickly and easily optimized for the screen shape and size, and the Health Services APIs, an intermediary to the various sensors and algorithms on the the watch that provide data related to activity, exercise, and health. With these tools, we’ll be able to create a beautiful and efficient wear app that can help you track your health goals! ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8500ffde-a07d-40ad-8c9f-e35b97359bee"
      ],
      "categoryItems": [
        159278
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    },
    {
      "id": "430072",
      "title": "Word Smatter: Exploring Semantics, Testers, and Problems",
      "description": "“Testers [do|don’t] (help) [prevent|detect] problems.”\r\n\r\nThroughout my career, I’ve encountered numerous variations of this phrase and discussed the underlying ideas often. The phrase uses just a few, small words to express many, big ideas. And so, it is valuable and critical to understand what each word means individually in order to better understand the ideas they convey collectively.\r\n\r\nSemantics is the study of meaning in words. The session begins with a brief and broad overview of semantics and related ideas. This sets the stage for deep analysis of each individual word in the phrase above and its potential meaning. We collaboratively consider:\r\n\r\nTesters – What might this word mean to different people and in different contexts?\r\nDo/Don’t – What do normative and descriptive statements have to do with it?\r\nHelp – How does the inclusion/exclusion of this word affect the meaning of the phrase?\r\nPrevent/Detect – What does causality and relativism have to do with which word we choose?\r\nProblems – What exactly is the thing that is being prevented or detected?\r\n\r\nThis session demystifies and promotes semantics, and goes beyond wordplay to introduce critical concepts that have practical impacts on testers, their roles, and their responsibilities.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "70c37ef4-ef7f-48be-b2a6-790c716b6d29"
      ],
      "categoryItems": [
        159279
      ],
      "questionAnswers": [],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null
    }
  ],
  "speakers": [
    {
      "id": "d5383829-0901-4bb9-918b-1118c196c314",
      "firstName": "Alex",
      "lastName": "Finnarn",
      "bio": "Alex has always been a pragmatic contrarian experiencing his first case of JS fatigue debugging the build of a simple static site. Ever since he's been searching for simple solutions to common problems across many languages and stacks. In his spare time, you can find Alex picking up spares while bowling, mindfully mindlessly playing instruments, or catching Criterion Channel classics.",
      "tagLine": "Engineer at CivicActions",
      "profilePicture": "https://sessionize.com/image/a616-400o400o2-DUrjhYGGdPud8VHwkdzcS5.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/alexfinnarn",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/alexfinnarn/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@alexfinnarn",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        450242
      ],
      "fullName": "Alex Finnarn",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "09f1a897-fb01-4ed0-9178-5d383517928e",
      "firstName": "Amanda",
      "lastName": "O'Mara",
      "bio": "Amanda O'Mara is the Ohio Regional Manager for the Microsoft TEALS Philanthropic Program, which places industry volunteers in high school classrooms to support classroom teachers as they learn how to teach computer science. She is a former middle school technology and engineering teacher at Bio Med Science Academy, a STEM designated independent public school in Rootstown, OH. ",
      "tagLine": "Ohio Regional Manager - Microsoft TEALS Philanthropic Program",
      "profilePicture": "https://sessionize.com/image/41e3-400o400o2-TqHWPrnGRFT2VBUHCK7UtZ.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/amandajomara/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        435644
      ],
      "fullName": "Amanda O'Mara",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "1dbfb6bc-c1f2-44af-9294-3614597b165e",
      "firstName": "Brendan",
      "lastName": "Enrick",
      "bio": "I've been speaking about coding for over a decade. Everything changes, but everything is the same. \r\n\r\nI write code to solve problems, and I try to leave things nicer than I found them. I have fun while doing it. Let's write code and talk about code together!",
      "tagLine": "Mentoring, Training, and Coaching Developers",
      "profilePicture": "https://sessionize.com/image/a64f-400o400o2-Nhbh9sAeXRqYKpaBuHA3Tq.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/brendoneus",
          "linkType": "Twitter"
        },
        {
          "title": "Blog",
          "url": "http://brendan.enrick.com/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        431063
      ],
      "fullName": "Brendan Enrick",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0c4f74c9-6be8-40d0-b588-674d3b783472",
      "firstName": "Brian",
      "lastName": "Gorman",
      "bio": "Brian is a Microsoft Azure MVP and is an experienced speaker, author, trainer, and .Net developer with MCSA: Web App Certification, MCSD: App Builder, and eleven Azure certifications including Azure Developer, Administrator, DevOps, Architect, Data Administrator, Security, IoT, CosmosDB, and a number of fundamentals, and has been an MCT since 2018. Brian has a masters of science degree in computer information systems, and a bachelor of science degree in computer science. Additionally, Brian has over ten years of experience instructing college courses online in SQL databases, C#/VB.Net/and Java object-oriented programming, and Microsoft Office. Brian has created many online technical training courses that can be found online on various platforms.  Brian has also published a book with APress entitled \"Practical Entity Framework\"  The second edition of the book targeting .Net Core 6 was released in late November of 2021.  Brian has a new book slated to be released in 2023 on the AZ-204 Exam.",
      "tagLine": "Microsoft Azure MVP, Speaker, Author, Trainer, and .Net Developer",
      "profilePicture": "https://sessionize.com/image/f7f1-400o400o2-78Guf1D4AufM9RDKeHfdeo.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/blgorman",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        433539
      ],
      "fullName": "Brian Gorman",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "12a83353-24d5-4400-bb8e-8ceaf4b8102d",
      "firstName": "Brian",
      "lastName": "Riazzi",
      "bio": "Brian is a software engineer out of Columbus OH. He has 10 years experience with a focus on JavaScript and other frontend techologies. As a consultant at Insight Brian enjoys giving presentations to coworkers and clients about exciting new technologies in order to keep everyone's skills sharp! When not at work Brian is trying to find new restaurants to try, wrangling his kids, or finding time to snuggle up with his dogs on the couch and play a good video game.",
      "tagLine": "Insight Senior Software Developer",
      "profilePicture": "https://sessionize.com/image/8f74-400o400o2-3PCaYvnDLMFvN3k4ADZcv9.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/brian-riazzi-a7592222/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        441532
      ],
      "fullName": "Brian Riazzi",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8ae0a45e-573c-4ab1-8ca0-bc1e31bcec0e",
      "firstName": "Brooke",
      "lastName": "Sargent",
      "bio": "Brooke is currently a software engineer working on observability at Honeycomb. Previously, she worked on e-commerce and IoT at Procter & Gamble as an engineering manager. In her spare time, she can be found in the kitchen on a quest to master baking the perfect pie.",
      "tagLine": "Software Engineer @ honeycomb.io",
      "profilePicture": "https://sessionize.com/image/b7f2-400o400o2-sBgXNAk9CbKpgsiBymvheZ.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/codegirlbrooke",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/brooke-sargent/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        447976
      ],
      "fullName": "Brooke Sargent",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b642eabd-7250-4ac5-b3b0-ce01951b88aa",
      "firstName": "Burton",
      "lastName": "Smith",
      "bio": "I am a technical lead at Microsoft working with design systems and web components.\r\n\r\nI am also the creator of various open-source projects like Kickstand UI (a design system built with web components - kickstand-ui.com) and Clarion (a style framework for managing design systems - projectclarion.com).\r\n\r\nIn my free time, I love spending time with my wife and three daughters, practicing martial arts, jamming on my ukulele, and learning new things (usually about software engineering)",
      "tagLine": "Senior Software Engineer, Bunzl North America",
      "profilePicture": "https://sessionize.com/image/6696-400o400o2-SPrJ8vsu59wWXGQtZ24iCT.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/stuffbreaker",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/burton-smith-48132a34/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        449946
      ],
      "fullName": "Burton Smith",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "94732aa0-c688-45c1-b92b-7ebad08ea8e0",
      "firstName": "Chris",
      "lastName": "Gardner",
      "bio": "Chris Gardner is a Senior Products and Platform Engineering Manager for Accenture, the Chairman of the DevSpace Technical Conference and a regular coder. Tortured by years of contracts that valued buzzwords over results, Chris has developed a true passion for finding solutions that fit the problem, not the technology of the week. Chris received his M.S in Computer Science, B.S. in Mathematics, and B.A. in Philosophy from the University of Alabama in Huntsville and is currently a Microsoft Certified Solutions Developer, Professional Developer, Information Technology Professional and Trainer.",
      "tagLine": "Coder",
      "profilePicture": "https://sessionize.com/image/b676-400o400o2-PhCn2cpwki4RAmGVe6G7XR.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/freestylecoder",
          "linkType": "Twitter"
        },
        {
          "title": "Blog",
          "url": "https://twitch.tv/freestylecoder",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        449170
      ],
      "fullName": "Chris Gardner",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "70c37ef4-ef7f-48be-b2a6-790c716b6d29",
      "firstName": "Damian",
      "lastName": "Synadinos",
      "bio": "For more than 25 years, Damian Synadinos helped “build better software and build software better”. Now, through his company Ineffable Solutions (Ineffable-Solutions.com), he helps “build better people”. Damian is an international speaker and trainer, delivering keynotes, talks, and workshops that are fun and focused on fundamental topics and people-skills, based on real-world experience, and supplemented with deep research. His diverse experience spans many roles, companies, and industries, including airline, retail, insurance, finance, e-commerce, and commercial realty. Damian also helped organize the \"QA or the Highway\" testing conference (QAortheHighway.com) from 2014-2020, has over 10 years of theatrical improv experience, authored and illustrated a children’s book, “Hank and Stella in Something from Nothing” (HankAndStellaBooks.com), substitute teaches at primary schools, and draws strangers for fun (IDrawStrangers.com).",
      "tagLine": "building better software, and building software better",
      "profilePicture": "https://sessionize.com/image/9526-400o400o2-3CyjyrZNf1Lhgf9qfeWK4q.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/dsynadinos",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/damiansynadinos/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.ineffable-solutions.com/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.ineffable-solutions.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        430072
      ],
      "fullName": "Damian Synadinos",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "2b6c01c1-02ec-4b51-8eb1-a7d86d50687b",
      "firstName": "Dave",
      "lastName": "Klein",
      "bio": "After 28 years as a developer, architect, project manager (recovered), author, trainer, conference organizer, and homeschooling dad, Dave landed his dream job as a Developer Advocate with Confluent. Dave is marveling in and eager to help others explore the amazing world of event streaming with Apache Kafka!",
      "tagLine": "Developer Advocate with Confluent",
      "profilePicture": "https://sessionize.com/image/eb76-400o400o2-PQAFmEVut5hpjf3tFhiHHX.JPEG",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/daveklein",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "http://www.linkedin.com/in/daveklein19",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dave-klein.blogspot.com",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        436852
      ],
      "fullName": "Dave Klein",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "6e3f3714-82bb-4fee-873b-975239263814",
      "firstName": "Debbie",
      "lastName": "Levitt",
      "bio": "\r\nDebbie Levitt, MBA, is the CXO of Delta CX, and since the mid-1990s has been a CX and UX consultant focused on strategy, research, training, and Human-Centered Design/User-Centered Design. She’s a change agent and business design consultant focused on helping companies of all sizes transform towards customer-centricity while using principles of Agile and Lean.\r\n\r\nShe has worked in various CX and UX leadership and individual contributor roles at companies including Wells Fargo, Macy’s, StepStone, Sony Mobile, and Constant Contact. In the 2010s, San Francisco UX and marketing agencies had Debbie on speed dial. She completed projects for Traction, Fjord, LIFT, Rauxa, ROI·DNA, and Fiddlehead.\r\n\r\nClients have given her the nickname, “Mary Poppins,” because she flies in, improves everything she can, sings a few songs, and flies away to her next adventure.\r\n\r\nHer new book, “Customers Know You Suck,” (2022) is the customer-centricity how-to manual. Start investigating what’s holding you back from improving customer-centricity. Learn how to be value-led: how much value we can frequently create for potential and current customers. In 2016, she became an O’Reilly author, but has since chosen to self-publish, and now has her own publishing imprint, Delta CX Media.\r\n\r\nOutside of CX work, and sometimes during CX work, Debbie enjoys singing symphonic prog goth metal, opera, and New Wave. You can also catch her on the Delta CX YouTube channel.\r\n",
      "tagLine": "CXO of Delta CX",
      "profilePicture": "https://sessionize.com/image/7065-400o400o2-4ZnDT5fSesQfFe3Yun2PH7.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/debbielevitt",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://customercentricity.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://customercentricity.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        446618
      ],
      "fullName": "Debbie Levitt",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "dea947af-9049-44fb-b853-42e45300dadf",
      "firstName": "Diana",
      "lastName": "Pham",
      "bio": "Diana joined Vonage’s DevRel team shortly after completing her master's in computer science at Northeastern University. Prior to grad school, she had never truly coded in her life. After interning with multiple companies and creating a YouTube series for one of them, Diana found her calling in advocacy. Now she works on the Outreach team as a developer advocate based in New York. She also loves petting farm animals, trying new foods, and pole dancing.",
      "tagLine": "Developer Advocate at Vonage",
      "profilePicture": "https://sessionize.com/image/9938-400o400o2-4kTaxiXUCZYFnHVZRMst5G.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/dianasoyster",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/dianasoyster/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dev.to/dianasoyster",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://developer.vonage.com/en/home",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        442176
      ],
      "fullName": "Diana Pham",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "11a684d4-ace1-49e8-be4b-c4e5ff215a7c",
      "firstName": "Eldert",
      "lastName": "Grootenboer",
      "bio": "Eldert is always enthusiastic about embarking on new journeys with the Cloud, and Azure in particular. He is very passionate about growing his dreams and teams, and goes above and beyond to help those with the same spark. Eldert comes from a background as a cloud solution architect and Technology Lead, was an Azure MVP for 5 consecutive years, and is now working as a Senior Program Manager at Microsoft for Azure Service Bus. In these roles he has demonstrated experience in building and maintaining relationships at all levels.\r\n\r\nAlways having a smile on his face, Eldert can be found delivering noteworthy sessions at in-person conferences, meetups, and online platforms. He values sharing and spreading knowledge while building genuine connections regardless of background and expertise. His goal is to bring people closer and work together to influence the outcome and optimize the future of Cloud technologies.\r\n\r\nApart from public speaking, Eldert shows his passion for being involved with the community in other ways as well. As such, he can often be found doing mentoring, organizing conferences and meetups, blogging, writing, and more. He loves telling about his journey and hearing other people’s stories. When meeting people he always looks forward to getting to know about their passions and how he can help them.",
      "tagLine": "Senior Program Manager @Microsoft | #Azure Service Bus | Former #Azure MVP | Community Enthousiast",
      "profilePicture": "https://sessionize.com/image/a215-400o400o2-PkYjFEGLvknBFThfFXDUS1.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/egrootenboer",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        430133
      ],
      "fullName": "Eldert Grootenboer",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f38f42d8-7623-457c-8871-dbb44bc458da",
      "firstName": "Georgia",
      "lastName": "Loper",
      "bio": "Georgia Loper loves the web. She champions frontend excellence at Upstart by empowering teams to engineer quality user experiences with Patina Design System.",
      "tagLine": "Senior Software Engineer, Design Systems",
      "profilePicture": "https://sessionize.com/image/55b9-400o400o2-JoaEJce8KjNtsH8BiNW8LK.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/developerLoper",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/georgialoper/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://developerloper.dev",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        448009
      ],
      "fullName": "Georgia Loper",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "aae8e930-83f8-45be-b1a9-d47075235565",
      "firstName": "Glenn",
      "lastName": "Harmon Jr.",
      "bio": "I'm a Father, Husband, Cyclist, Software Engineer, and Champion of Tough Conversations.",
      "tagLine": "Senior Software Consultant Test Double VP Engineering Decision Desk HQ",
      "profilePicture": "https://sessionize.com/image/e1ba-400o400o2-ffc4TRC4X7nUNbbsc3BPxp.jpeg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/GlennHarmonJr",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/glenn-harmon-jr-2b1a691a/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        449820
      ],
      "fullName": "Glenn Harmon Jr.",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "520bf4ca-b2d3-47c3-8475-c25bb2b257f7",
      "firstName": "Guy",
      "lastName": "Royse",
      "bio": "Guy works for Redis as a Developer Advocate. Combining his decades of experience in writing software with a passion for learning—and for sharing what he has learned—Guy explores interesting topics and spreads the knowledge he has gained around developer communities worldwide.\r\n\r\nTeaching and community have long been a focus for Guy. He runs his local JavaScript meetup in Ohio and has served on the selection committees of numerous conferences. He'll happily speak anywhere that will have him and has even has helped teach programming at a prison in central Ohio.\r\n\r\nIn his personal life, Guy is a hard-boiled geek interested in role-playing games, science fiction, and technology. He also has a slightly less geeky interest in history and linguistics. In his spare time he likes to camp and studies history and linguistics.\r\n\r\nGuy lives in Ohio with his wife, his sons, and an entire wall of board and role-playing games.",
      "tagLine": "Developer Advocate at Redis",
      "profilePicture": "https://sessionize.com/image/4ff6-400o400o2-ca-b2d3-47c3-8475-c25bb2b257f7.46c617ba-de75-407a-82ad-9cafa721d559.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/guyroyse",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/feed/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://guyroyse.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://redis.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        433947
      ],
      "fullName": "Guy Royse",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "973867cc-56ac-4920-8819-7fef548d6585",
      "firstName": "Heath",
      "lastName": "Murphy",
      "bio": "Architect, Developer, PM and Pumpkin Ale expert but not necessarily in that order. Heath has been a leader in the IT industry for over 20 years and has presented at multiple conferences around the great lakes region. He’s from Columbus, Ohio and therefore bleeds scarlet and grey, Go Buckeyes! These days, he works as a director and people leader for CGI, one of the largest IT and business consulting services firms in the world. Racing fast cars, building stupid expensive gaming computers, and manicuring a perfect home lawn round out his hobbies.",
      "tagLine": "Director, Consulting Services for CGI",
      "profilePicture": "https://sessionize.com/image/0a8d-400o400o2-4xmkNBqfs2c5BsiDggccUd.jpg",
      "isTopSpeaker": false,
      "links": [],
      "sessions": [
        430112
      ],
      "fullName": "Heath Murphy",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "79e36469-a9f5-4e58-9294-5215db739aef",
      "firstName": "Homer",
      "lastName": "Gaines, CPACC",
      "bio": "Front-end Dev by day, maker of music by night with over 27 years in the field, I'm a Staff UI Engineer, certified accessibility professional, and an international speaker. With an educational background in Behavioral Psychology focusing on Neurology and Graphic Design, I focus on accessible front-end development and clean, intuitive designs that enable independence.",
      "tagLine": "Staff UI Engineer and Certified Accessibility Professional",
      "profilePicture": "https://sessionize.com/image/ce3d-400o400o2-VUfTw8pPsAHLqTwsVEwPkq.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/xirclebox",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/homergaines",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        431085
      ],
      "fullName": "Homer Gaines, CPACC",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b7e99b0d-fe29-4715-ad58-566126f49c1b",
      "firstName": "Jason",
      "lastName": "Turan",
      "bio": "Senior software engineer working in the field since 2009. I've been working with Daugherty Business Solutions since 2015 designing and delivering custom software solutions. I've been working with AWS and Python/node.js recently but have worked with .NET and Java in the past. When I am not coding I will either be taking care of my two young boys or mountain biking whenever the weather is nice.",
      "tagLine": "Senior Software Engineer - Daugherty Business Solutions",
      "profilePicture": "https://sessionize.com/image/ebd3-400o400o2-P3YqR5p22NaE9WNWG9U4AH.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/turanj/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        443439
      ],
      "fullName": "Jason Turan",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "d108027a-7e26-46f5-b92d-9f6cb59eb283",
      "firstName": "Jonathan \"J.\"",
      "lastName": "Tower",
      "bio": "Jonathan, or J as he's known to friends, is a husband, a father, and the owner of Trailhead Technology Partners, a custom software consulting company with employees all around the world. He is also a Microsoft MVP in .NET and frequently speaks at software meetups and conferences. He doesn't mind too much because he loves sharing what he’s learned, and it also gives him an excuse to visit any nearby National Parks, a passion of his, proven by the fact that he's currently made it to 52 of the 63 parks.\r\n\r\nJ also has a passion for building community and has served on several non-profit boards over the years as a result. Currently, J sits on the SoftwareGR board, a non-profit trade organization dedicated to building the software industry in West Michigan. He also runs Beer City Code, a software conference, and has served as president on that board for over a decade. J loves hiking, reading, photography, and trying to see all the best picture nominees before the Oscars ceremony.",
      "tagLine": "Partner & Principal Consultant, Trailhead Technology Partners",
      "profilePicture": "https://sessionize.com/image/2513-400o400o2-ncTxzbvtMMe8gNw3GKDtVn.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/jtowermi",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jtower/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://trailheadtechnology.com/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://trailheadtechnology.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        432453
      ],
      "fullName": "Jonathan \"J.\" Tower",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "9bd888db-205e-4384-9243-8cf087e47f5d",
      "firstName": "Kat",
      "lastName": "Fairbanks",
      "bio": "Kat Fairbanks is a software engineer who loves to experiment and tinker with a wide range of technologies. She focuses on applying web technologies to help startups rapidly iterate on products. After hours, Kat can be found working on generative art, 3D printing projects, or spending time with her cat, Git. She also organizes the Momentum Developer Conference and the Cincinnati Software Craftsmanship meetup group.",
      "tagLine": "Staff Engineer",
      "profilePicture": "https://sessionize.com/image/04a1-400o400o2-EnhaH3MEdRdZUtftdLZhMr.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/DerKatzenbar",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/katzenbar",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://github.com/katzenbar",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        445152
      ],
      "fullName": "Kat Fairbanks",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "44406a2e-5504-47d4-8fef-6d5c110704a0",
      "firstName": "Kathryn",
      "lastName": "Grayson Nanz",
      "bio": "In 2013, I graduated with a BFA and took my first job as a Junior Graphic Designer at a small, boutique ad agency. While there, my Creative Director warned me to never let anyone find out I could code, because if I did I'd be stuck doing it forever. I ignored his warning; it turns out he was completely right, but I've never been happier. \r\n\r\nI currently work as a developer advocate on a wonderful team where I help people build web applications in React, design and maintain their UI component libraries, and desperately attempt to stop back-end devs from writing any more CSS.",
      "tagLine": "UI Designer & Front-end Developer",
      "profilePicture": "https://sessionize.com/image/e2dc-400o400o2-McJQkJxyfF54Kt3p6Je5vn.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/kathryngrayson",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kathryngrayson/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://kgrayson.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.telerik.com/kendo-ui",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        436867
      ],
      "fullName": "Kathryn Grayson Nanz",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "5faa6420-5ed1-4138-ad81-7e3c890502f3",
      "firstName": "Krista",
      "lastName": "Campbell",
      "bio": "Hi! I’m Krista Campbell. Thank you for taking the time to learn a little bit about me!\r\n\r\nI’m a Software Architect, Advocate, Engineer, and Leader who has been working in the field for more years than I like to count (including over twenty-five years of experience in the software industry). I’m experienced in both the technical and non-technical aspects of software development, I’ve led numerous successful software projects, focusing primarily in state and county agencies, human services, supporting health, education, and disabled communities.\r\n\r\nOver the years, I have discovered that I am as much a people person as I am a technical person. I’m adept at bridging the gap between technology and business leadership, building consensus through communication and shared understanding. I have strong leadership skills with experience in planning and guiding teams through the development cycle, mentoring and training junior developers, interviewing and placing developers, writing and presenting proposals and maintaining vendor partnerships. I’m also a seasoned public speaker having presented at several conferences such as CodeMash, StirTrek, Columbus Women in Tek, and Dogfood conferences.\r\n\r\nI started working with Microsoft technologies in the 90’s and have continuously changed and evolved with the times extending also into open source technologies as well. As such, I’m well-skilled in both Microsoft and open source technologies including cloud technologies in both Amazon Web Services as well as Microsoft Azure. With a strong focus on process and Agile methodologies, I have proven experience in helping teams successfully transform their development practices to leverage modern ALM and DevOps tools and techniques. Currently, I'm sharing this experience in the form of technical agile coaching - loving the opportunity to help technical teams do what they do best, only better.\r\n\r\nIn the rare event of free time you can usually find me with my amazing non-binary kid, making music, or spending time with friends and family. I'm a proud and open member of the transgender community and a supporter for social justice for all. ",
      "tagLine": "Principal Software Engineer and Technical Coach at Insight",
      "profilePicture": "https://sessionize.com/image/eb9b-400o400o2-20-5ed1-4138-ad81-7e3c890502f3.c3c78142-65eb-43c2-8ad0-7cb5c22c46cb.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/kristab3000",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "http://www.linkedin.com/in/KristaCampbell33",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        450221
      ],
      "fullName": "Krista Campbell",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "1d48e051-b2ac-4aa5-9e5b-78b376819a72",
      "firstName": "Mark",
      "lastName": "Noonan",
      "bio": "Mark is a senior engineer on the Component Testing team at Cypress.io. His background before Cypress is in front-end development in agency and enterprise contexts, and before that he spent many years in developmental disability support at the Atlanta nonprofit, People Making Progress.",
      "tagLine": "Cypress",
      "profilePicture": "https://sessionize.com/image/0b9f-400o400o2-PWiSfdATbiAcCZh8M9sGkj.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/marktnoonan",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/markthomasnoonan/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        431084
      ],
      "fullName": "Mark Noonan",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "17c299ee-d9fd-4020-b499-2837b2b3a2bf",
      "firstName": "Matt",
      "lastName": "Eland",
      "bio": "After several decades as a software engineer and engineering manager, Matt now serves as a software engineering instructor at Tech Elevator where he gets to raise up future developers and unleash them upon the world to build awesome things.\r\n\r\nMatt is a Microsoft MVP in Artificial Intelligence and a Microsoft Certified Azure Data Scientist and AI Engineer associate. Matt runs several blogs and a YouTube channel on data science and software engineering topics, is currently pursuing a master's degree in data analytics, and helps organize the Central Ohio .NET Developer Group while contributing to local and regional conferences.\r\n\r\nIn his copious amounts of spare time, Matt continues to build nerdy things and looks for ways to share them with the larger community.",
      "tagLine": "Instructor at Tech Elevator, Microsoft MVP in AI",
      "profilePicture": "https://sessionize.com/image/f65c-400o400o2-NpMGdfMWbxZoyRYt5ioKXE.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/IntegerMan",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/matteland/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://AccessibleAI.dev",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://TechElevator.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        445363
      ],
      "fullName": "Matt Eland",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "bb52359f-7de5-4ab4-be0c-e0fdf39b7134",
      "firstName": "Matt",
      "lastName": "Williams",
      "bio": "Matt Williams always wanted to be a Renaissance Person. Maybe one day he will be. In the meantime, he does photography, designs tabletop games, reads, cooks, weaves, hacks, and spends time with his wife and daughter in Columbus, OH.",
      "tagLine": "Renaissance Person in Training",
      "profilePicture": "https://sessionize.com/image/c1e5-400o400o2-WJ9SgktJqoE3kwVoZBtd8a.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/matt_k_williams",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/mattkwilliams/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://matthewkwilliams.com",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        450233
      ],
      "fullName": "Matt Williams",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b4b9d0ac-4135-4e89-804c-3b3ce22082c7",
      "firstName": "Michele",
      "lastName": "Lanning",
      "bio": "After completing both a Java Full Stack Web Development and Data Analytics Bootcamp through Tech Talent South in 2019, I accepted a full-time position at CAS (Chemical Abstracts Service) in Content Engine (data engineering department). \r\n\r\nPrior to working with CAS, I was working as an Internal Medicine physician when I deciding to make a change career to technology. I hold a degree in Osteopathic Medicine (DO)  from Ohio University Heritage College of Osteopathic Medicine and a BA Biology with Biomedical Science Concentration with a Chemistry Minor and AS Applied Sciences Radiologic Technology from Shawnee State University.\r\n\r\nIn my spare time, I enjoy spending time with my husband, Wes and our two parrots: Willie and Bob as well as bird watching, hiking, baking, learning to play the violin and Columbus Blue Jackets.\r\n",
      "tagLine": "CAS, Data Engineer, Content Engine",
      "profilePicture": "https://sessionize.com/image/f4ec-400o400o2-3tTxQqUTEkJdsHS73fEhLz.PNG",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/michele-parsley-lanning-d-o-6ab030a5/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        444997
      ],
      "fullName": "Michele Lanning",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "63f88157-8b36-4e54-8ccc-affa12510ffc",
      "firstName": "PJ",
      "lastName": "Hagerty",
      "bio": "PJ is the founder of DevRelate.io and a board member of Open Sourcing Mental Illness (OSMIhelp.org). He is an organizer of DevOps Days Buffalo, CodeDaze, and ElixirDaze. PJ is a developer, writer, speaker, musician, and Community Advocate. He is known to travel the world speaking about programming and the way people think and interact. He is also known for wearing hats.",
      "tagLine": "Founder of DevRelate.io and Chief Community Officer",
      "profilePicture": "https://sessionize.com/image/8f32-400o400o2-57-8b36-4e54-8ccc-affa12510ffc.ffb47dcf-5c1c-46fc-9334-3fa038755582.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/aspleenic",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        429998
      ],
      "fullName": "PJ Hagerty",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b1655789-7394-4979-9c93-ada3ee56dd45",
      "firstName": "Rhia",
      "lastName": "Dixon",
      "bio": "Kansas City native, Rhia Dixon is a lead software engineer at VMLY&R, a global agency focused on creating connected brand experiences. Primarily a backend dev, she creates software applications using Java, Python, Adobe Experience Manager, and a variety of other tech. While she has always been a STEM girl and holds a B.S. in Physics, her journey to the world of tech kicked off in the summer of 2017 during a full-stack web development bootcamp at the University of Kansas-Edwards Campus. Rhia has immersed herself in the KC tech community by volunteering -- both as a mentor, and as Diversity & Inclusion Director -- for Kansas City Women in Technology, a non-profit organization dedicated to bringing women in technology together and encouraging more women and girls to pursue careers in technology.\r\nWhen she’s not writing code or volunteering, Rhia is chasing her toddler, solving puzzles with her 1st grader, binge-watching Marvel movies, scheming on her next purple bag of skittles, or spending time making memories with family and friends.",
      "tagLine": "Lead Software Engineer - Full Stack Dev - Tech Connector - DEI Advocate",
      "profilePicture": "https://sessionize.com/image/3c5b-400o400o2-N5ytZYx2ukFqXUZnkTV4tq.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/TheFakeRiRi",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/rhiadixon/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        434401
      ],
      "fullName": "Rhia Dixon",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "0785f402-af78-4d26-a024-a1fb32fefe04",
      "firstName": "Ryan",
      "lastName": "Booz",
      "bio": "Ryan is an Advocate at Redgate focusing on PostgreSQL. Ryan has been working as a PostgreSQL advocate, developer, DBA and product manager for more than 20 years, primarily working with time-series data on PostgreSQL and the Microsoft Data Platform.\r\n\r\nRyan is a long-time DBA, starting with MySQL and Postgres in the late 90s. He spent more than 15 years working with SQL Server before returning to PostgreSQL full-time in 2018. He’s at the top of his game when he's learning something new about the data platform or teaching others about the technology he loves.",
      "tagLine": "Developer Advocate at Redgate",
      "profilePicture": "https://sessionize.com/image/496f-400o400o2-Y9fC6pVEFDzgwH45dB4Nh5.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://www.twitter.com/ryanbooz",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ryanbooz/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.softwareandbooz.com",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        445279
      ],
      "fullName": "Ryan Booz",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "df992bbb-7d7a-4898-b2bf-252076fd9457",
      "firstName": "Samuel",
      "lastName": "Shaw",
      "bio": "Sam has been in the technology space professionally for seven years after dabbling as a developer while working in academia.  His spare time is spent trying new things or in the gym fighting.  Most recently the focus being Krav Maga and Kung Fu.",
      "tagLine": "Software Developer - CoverMyMeds",
      "profilePicture": "https://sessionize.com/image/bc1e-400o400o2-UddRVW1pNNzrRNd7nd1y4p.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/thesamdroid/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        442240
      ],
      "fullName": "Samuel Shaw",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "f0f1fa39-eb24-4ab6-866c-b8645975bd75",
      "firstName": "Scott",
      "lastName": "McAllister",
      "bio": "Scott McAllister is a Developer Advocate for ngrok. He has been building web applications in several industries for over a decade. Now he's helping others learn about a wide range of web technologies and incident management principles. When he's not coding, writing or speaking he enjoys long walks with his wife, skipping rocks with his kids, and is happy whenever Real Salt Lake, Seattle Sounders FC, Manchester City, St. Louis Cardinals, Seattle Mariners, Chicago Bulls, Seattle Storm, Seattle Seahawks, OL Reign FC, St. Louis Blues, Seattle Kraken, Barcelona, Fiorentina, Borussia Dortmund or Mainz 05 can manage a win.\r\n",
      "tagLine": "Developer Advocate at ngrok",
      "profilePicture": "https://sessionize.com/image/76d7-400o400o2-Pn9oh1DNVCkN3fTo1Y4zHS.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/stmcallister",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stmcallister/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dev.to/stmcallister",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://ngrok.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        448383
      ],
      "fullName": "Scott McAllister",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "b7235790-4c4a-491c-a8a1-1ed82a5d70b3",
      "firstName": "Seth",
      "lastName": "Petry-Johnson",
      "bio": "Seth spent 21 years as a professional developer/architect before finally joining the dark side of management. He now spends his days as a pointy-haired boss leading a small-but-mighty product development team in the search for elegant solutions to complex problems. He is passionate about clean architecture, testable systems, and bringing order to chaos. Seth lives in Columbus, OH and is an active participant in the Midwest developer community. He'll write TPS reports when he has to, but still enjoys writing, reviewing, and talking about code.",
      "tagLine": "Pointy-haired boss by day, coder by night",
      "profilePicture": "https://sessionize.com/image/1ec6-400o400o2-45odWhWL9vEuYNAqPTcuwL.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/spetryjohnson",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/sethpetryjohnson/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        431413
      ],
      "fullName": "Seth Petry-Johnson",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "8500ffde-a07d-40ad-8c9f-e35b97359bee",
      "firstName": "Sierra",
      "lastName": "OBryan",
      "bio": "Sierra is a Senior Software Engineer at Twitter, based in Cincinnati, OH, USA, focused primarily on native Android. She loves building beautiful and accessible Android apps, sharing knowledge with the community, and mentoring aspiring mobile developers. She is a Google Developer Expert for Android and serves as a director of Women Who Code Cincinnati, a global Leadership Fellow for Women Who Code Mobile, and a Women Techmakers Ambassador.",
      "tagLine": "Android @ Twitter",
      "profilePicture": "https://sessionize.com/image/10ad-400o400o2-71xKbc39LZi6tkVP2BZH6K.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/_sierraobryan",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/sierraobryan/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://sierraobryan.dev/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        434806
      ],
      "fullName": "Sierra OBryan",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "a5d50f4e-f021-4983-97a9-73f9415b3d5b",
      "firstName": "Steve",
      "lastName": "Smith",
      "bio": "Steve Smith (@ardalis) is an entrepreneur and software developer with a passion for building quality software as effectively as possible. Steve has published several courses on Pluralsight, covering DDD, SOLID, design patterns, and software architecture. He's a Microsoft ASP.NET MVP and Insider, a frequent speaker at developer conferences, an author, and a trainer.\r\n\r\nSteve works with companies that want to avoid the trap of technical debt by helping their teams deliver quality software, quickly. Steve and his team have been described by clients as a \"force multiplier\", amplifying the value of existing development teams. Steve's client list includes Microsoft, Quicken Loans, Celina Insurance, and many other satisfied customers.",
      "tagLine": "I Help Teams Deliver Better Software",
      "profilePicture": "https://sessionize.com/image/f430-400o400o2-4e-f021-4983-97a9-73f9415b3d5b.34dc742e-9a1e-4c87-98ad-c6bae9a07972.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ardalis",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stevenandrewsmith",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://ardalis.com/blog",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        450213
      ],
      "fullName": "Steve Smith",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "895833fa-4bbd-4d2a-bc58-195064458f4e",
      "firstName": "Tasha",
      "lastName": "Penwell",
      "bio": "Tasha Penwell is the founder and developer of Pretty Nerdy where she provides digital marketing services. She specializes in developing Snapchat filters and Alexa Skills.",
      "tagLine": "Pretty Nerdy, Founder/Developer",
      "profilePicture": "https://sessionize.com/image/d0f7-400o400o2-3Hh4w9E6T1VQFZRi2siYiS.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/PenwellTasha",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tashapenwell/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        438201
      ],
      "fullName": "Tasha Penwell",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "3ec45bcc-5de8-4495-a341-f2f94256189d",
      "firstName": "Tim",
      "lastName": "LeMaster",
      "bio": "Tim is a Principal Engineer at Pangea Money Transfer. He has 28 years of software development experience. He studied Physics at Purdue University and is a veteran of the United States Air Force.",
      "tagLine": "Pangea Money Transfer, Principal Engineer",
      "profilePicture": "https://sessionize.com/image/1174-400o400o2-Bf2MUdtG4ZDmvd44WYsqUB.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tim-lemaster-96598713",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dev-nops.net",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        442371
      ],
      "fullName": "Tim LeMaster",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "5f017dbb-6821-480b-a750-82a0f15fa1b2",
      "firstName": "Todd",
      "lastName": "Gardner",
      "bio": "Todd Gardner is a software entrepreneur and developer who has built multiple profitable products. He pushes for simple tools, maintainable software, and balancing complexity with risk. He is the cofounder of TrackJS and Request Metrics, where he helps thousands of developers build faster and more reliable websites. He also produces the PubConf software comedy show.",
      "tagLine": "CEO and founder at TrackJS and Request Metrics  | 💩 JavaScript Happens | Notepad Programmer | Web Development, Performance, and Observability",
      "profilePicture": "https://sessionize.com/image/e451-400o400o2-3cCPW7rgMFV6YEt4nG82sj.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/toddhgardner",
          "linkType": "Twitter"
        },
        {
          "title": "Blog",
          "url": "https://toddhgardner.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://requestmetrics.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        449862
      ],
      "fullName": "Todd Gardner",
      "categoryItems": [],
      "questionAnswers": []
    },
    {
      "id": "11fbf1c5-b0fc-42eb-a027-4fea2e54bb12",
      "firstName": "Vitaliy",
      "lastName": "Matiyash",
      "bio": "Vitaliy Matiyash is Software Engineer from Columbus, Ohio, working on both front end and back end technologies with focus on web accessibility. In his spare time he enjoys working on various DIY projects, biking, hiking Central Ohio trails and cooking from scratch.",
      "tagLine": "Senior Software Engineer, Builder, Problem Solver, Newbie Conference Speaker",
      "profilePicture": "https://sessionize.com/image/a595-400o400o2-UQKYbsP5udCreAyU5df2CV.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/vitaliymatiyash",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/VitaliyMatiyash/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://vitaliymatiyash.com/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        430037
      ],
      "fullName": "Vitaliy Matiyash",
      "categoryItems": [],
      "questionAnswers": []
    }
  ],
  "questions": [],
  "categories": [
    {
      "id": 46845,
      "title": "Track",
      "items": [
        {
          "id": 159275,
          "name": "Application Languages, Frameworks, Fundamentals",
          "sort": 1
        },
        {
          "id": 159282,
          "name": "Architecture, Patterns",
          "sort": 2
        },
        {
          "id": 159283,
          "name": "Cloud, Infra, DevOps",
          "sort": 3
        },
        {
          "id": 159284,
          "name": "Data, AI, ML",
          "sort": 4
        },
        {
          "id": 159276,
          "name": "Design, Product Strategy",
          "sort": 5
        },
        {
          "id": 159281,
          "name": "Full Stack Web Development",
          "sort": 6
        },
        {
          "id": 159277,
          "name": "IoT, Home Automation, Maker Topics",
          "sort": 7
        },
        {
          "id": 159278,
          "name": "Mobile & Desktop App Development",
          "sort": 8
        },
        {
          "id": 159279,
          "name": "Professional Skills, Leadership, Business",
          "sort": 9
        },
        {
          "id": 159285,
          "name": "Security",
          "sort": 10
        },
        {
          "id": 159280,
          "name": "Software Quality - Testing, Process, Code Reviews, etc.",
          "sort": 11
        }
      ],
      "sort": 2,
      "type": "session"
    }
  ],
  "rooms": [
    {
      "id": 32097,
      "name": "Room 1",
      "sort": 0
    },
    {
      "id": 32098,
      "name": "Room 2",
      "sort": 1
    },
    {
      "id": 32099,
      "name": "Room 3",
      "sort": 2
    }
  ]
}