{
  "sessions": [
    {
      "id": "1131023",
      "title": "150K Lines, 0 Unit Tests, No Documentation: How To Work With A Software Landfill",
      "description": "Most programmers don't start projects from scratch, but inherit them. Often, we join large, messy, years-old code bases that are poorly tested and documented, and are intimidating to work with. Working with them can feel like tap dancing through a mine field.\r\n\r\nGenerative AI also provides challenges for software developers, as it can generate huge amounts of code that need to be understood.\r\n\r\nThis talk offers practical strategies for navigating and improving legacy code. We'll see techniques like using git history with scripts to identify software hot spots, introducing software \"seams\" for safe refactoring, and isolating risky changes through \"sprouting\" and \"wrapping\" techniques. You'll see how small, strategic changes can introduce stability without requiring massive rewrites.\r\n\r\nAttendees will leave with concrete, proven techniques for understanding, modifying, and improving legacy code bases with confidence. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b765d60f-4717-4116-b9f2-002c8a10bd88"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1138947",
      "title": "A developer’s guide to making security reviews suck less",
      "description": "In many companies, security reviews suck. You’ve spent weeks or months grinding on a new feature and you’re finally ready to push to production, only to have a security review at the eleventh hour spark chaos. A security engineer raises a concern that might be valid or might be a total misunderstanding, but either way, it leads to urgent meetings, escalations, and complicated Go/No-Go decisions.\r\n\r\nIn this talk, we will dive into how to navigate these reviews without the drama. As an AppSec Director, I will help you understand exactly what security teams are looking for and why. I’ll show you anticipate their concerns and requirements so you aren’t surprised by scope creep right before code complete. We will explore how to effectively engage your security team, what specific information they need from you, and how to speak their language so you can accurately address concerns and get to the heart of their requirements.\r\n\r\nBy the end of this session, you will have a straightforward strategy to streamline your next security review and build a more collaborative relationship with your security partners. You will walk away with the tools to reduce the friction that leads to pre-launch panic, helping your team ship with significantly fewer headaches.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d06fd6a1-87cf-4d20-a5e0-2dd64c2039bb"
      ],
      "categoryItems": [
        431280
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127143",
      "title": "Agents & Arbiters - An Adventurer’s Guide to Multi-Agent Collaboration with LangGraph.js",
      "description": "Building interactive systems with conventional coding means trying to anticipate every possible user action and writing the right response. This quickly becomes nigh impossible. You end up lost in a maze of recursion, fragility, and nested if statements. The more interactive you make your system, the more complex your code gets, until debugging feels like being eaten by a grue—you know something's wrong, but you're just fumbling around in the dark.\r\n\r\nThere's a better way. Instead of scripting every interaction, we can give some of the elements in our system their own intelligence. Multi-agent collaboration lets us create systems where entities can become autonomous agents with their own perspectives and voices. Imagine a text-based adventure game where the brass lantern, the white house, and even the mailbox have something to say when responding to the player. Or consider a help desk system where agents from billing, technical support, and account management each weigh in to determine the best solution for a customer.\r\n\r\nIn this session, we'll explore multi-agent collaboration through a live demo of a text-based adventure system. You'll meet the orchestration workflow—router, classifier, agents, arbiter, and committer—and discover how LangGraph.js coordinates the chaos when multiple agents want to respond. We'll shine our brass lantern over the code to see how it uses Redis and LangGraph.js to make it all work. Then, we'll explore how this same approach solves real-world problems beyond gaming.\r\n\r\nWhen the adventure's over, you'll understand how to coordinate agents to handle complex interactions and know when this is a good approach. You'll have a working example you can adapt for your own adventures—be they exploring the Great Underground Empire, customer service platforms, or content management systems. And, you'll never look at building interactive systems the same way again.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "520bf4ca-b2d3-47c3-8475-c25bb2b257f7"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "CodeMash, other places by the time Stir Trek rolls around"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1123424",
      "title": "AI in Agile: How to Leverage AI for Smarter Sprints & Roadmaps",
      "description": "AI isn’t just disrupting industries; it’s redefining how Agile team's work. From backlog grooming to sprint planning, modern tools like ChatGPT, Jira Assist, and GitHub Copilot are helping Agile leaders and teams move faster, think smarter, and focus more on value delivery than manual overhead.\r\n\r\nIn this forward-looking session, we’ll explore how AI is transforming the Agile lifecycle. You’ll see real-world examples and a live demo showing how AI can assist with generating user stories, refining acceptance criteria, summarizing retrospectives, and even forecasting roadmap scenarios.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "8d6efde2-af82-4fb9-9d6a-1a88369657c1"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1119472",
      "title": "An intro to Retrieval Augmented Generation (RAG)",
      "description": "Learn to deliver AI search and Generative Answers on top of your unstructured data. RAG is easy to prototype but hard to run in production. In this session we'll start with retrieval augmented generation basics by building a simple proof of concept. Then, we'll compare solutions meant for scale with Agentic RAG, RAG Graph, and Entity Recognition. Throughout we'll see examples of how RAG applies to modern app development.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3fd9cade-10ef-43df-b124-944015042549"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1129012",
      "title": "Application Architecture Patterns",
      "description": "Architecting an application can be challenging.  What do you do to keep your application flexible to ever-constant requirement changes? How do you handle landscape changes (cloud, on-premises, databases)? How do you avoid over-engineering the application? How do I make sure my application plays well with other applications?\r\n\r\nIn this session, we'll take a look at some well-understood and practiced Software Architecture patterns.  We'll cover these patterns at a high level to understand how to use these patterns in different scenarios.\r\n\r\nYou'll walk away with some knowledge, tips, and tricks that you'll be able to use for new and existing applications.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "137fb55c-d120-4a6b-9e15-98123df17302"
      ],
      "categoryItems": [
        431275
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "https://www.youtube.com/watch?v=MGIWrvHjww8&list=PLESGit66MnbmnDhXdTZicVFF2Pql430pJ&index=13&pp=gAQBiAQB2AYOsAgC"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1128156",
      "title": "Automating User Interface Tests with Playwright",
      "description": "Testing a user interface is an important part of the development life cycle. However this testing is often done manually, which is expensive, time-consuming, and often inconsistent. Automating this process can make UI testing far more effective and efficient.\r\n\r\nAzure Playwright is an open source node.js project that provides a way to automate user interface testing.\r\n\r\nBy the end of this session, you’ll know how to:\r\n- Automate repetitive coding tasks with Playwright\r\n- Record user actions and use the rich object model to automate your tests\r\n- Integrate Copilot into your CI/CD pipeline\r\n- Reduce test development time.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "fe170f42-5405-4ad7-a69f-2276f081bf7e"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1126337",
      "title": "Better the Devil you NoSQL - A Battle of Paradigms",
      "description": "SQL or NoSQL? We’ll build the same app on DynamoDB and on Aurora DSQL, the latest cloud native database. Then compare modeling, query patterns, cost, latency, transactions, and ops. Takeaway practical insights from this packed micro demo. \r\n\r\n## Abstract\r\nI spent years living happily in my NoSQL safe space. I avoided SQL out of intimidation, without realizing the cost. Inspired by Ghost Rider’s redemption arc, I used the Devil I know to learn about the one I don’t. We’ll build a “Soul Contract Manager” for Ghost Rider with both DynamoDB and Aurora DSQL. In the process, we’ll see:\r\n\r\n- How data modeling shapes query flexibility and agility\r\n- The realities of multi-record consistency (transactions vs. item-level ops)\r\n- Cost and latency levers under typical read/write mixes\r\n- Secure connection patterns (IAM-issued tokens vs. app-managed secrets)\r\n\r\nOur goal isn’t to pick a winner; instead, you’ll get my hard-won lessons because redemption isn’t about choosing sides; it’s about feeling confident in your choices.\r\n\r\n## What You’ll Learn\r\n\r\n- **Mental models:** Access-pattern modeling (NoSQL) vs. relational modeling (SQL), you can explain to your team.\r\n- **Modeling tradeoffs in practice:** Keys/GSIs/streams vs. schemas/joins/transactions.\r\n- **Performance & cost levers:** How workload shapes (read/write ratio, query mix) changes outcomes.\r\n- **Security patterns:** Secrets-free connections with IAM tokens; least-privilege access.\r\n\r\n## Why You Can’t Miss It\r\n\r\n- **Memorable and Entertaining Analogies:** Inspired by Ghost-Rider’s redemption story to make concepts stick.\r\n- **Hands-on realism:** The *same* workflow implemented two ways—no hand-wavy “it depends.”\r\n\r\n# Audience & Level\r\n\r\nGeneral developers, backend/full-stack, cloud/serverless engineers, Beginner–Intermediate level",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "4de5c215-2eab-4a2d-bb3b-55817c56f01a"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120223",
      "title": "Blending Product Thinking with Software Modernization",
      "description": "In the world of software, products and systems don’t just remain static, they evolve, accumulate technical debt, and sometimes become an unmanageable mess of outdated frameworks, workarounds, and fragile dependencies. \r\n\r\nWhen dealing with a 15-year-old platform, the question isn’t just how to modernize but what to modernize. Should you refactor piece by piece or completely rebuild? What about adding that new feature for the Product Owner. The answer isn’t always obvious.\r\n\r\nThis session explores how blending product thinking with software modernization leads to better outcomes. We’ll examine the lens of long-term product strategy, user needs, and business value. Using real-world lessons from a long-running SaaS product, a case study in modernizing a complex legacy platform, we’ll highlight how to balance technical constraints with customer expectations.\r\n\r\nWhether you’re leading a legacy transformation or trying to avoid one in the future, this talk will showcase some smart modernization decisions that don’t make the business take a full stop.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "13924f5b-13f0-4fd8-a0bf-06f633dad5c9"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Merge Conf 2025, MI Dev Fest 2025"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127647",
      "title": "Caffeinate Your Queries: Brew Up Faster SQL with Tuning",
      "description": "In this session, embark on an engaging exploration as we unravel the mysteries of query tuning. From deciphering sluggish queries to unleashing their full potential, we will explore advanced techniques for optimizing SQL performance. Discover the art of indexing, rewriting queries for efficiency, leveraging execution plans, and unearthing hidden bottlenecks. Whether you're a seasoned developer or SQL enthusiast, you'll leave armed with the skills to transform your queries from coffee-break slow to lightning-fast.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c53b081c-6035-47f5-a606-91e83963556b"
      ],
      "categoryItems": [
        431277
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Coodemash - \"This talk was my favorite of the conference. The visuals he provided along with his presentation were great and definitely helped demonstrate what he wanted to get across. Additionally he was a very good speaker and kept me engaged for the whole presentation\""
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1123968",
      "title": "Choosing an AI Coding Workflow",
      "description": "AI is here, but deciding what to use and how is difficult. In this fast-paced session, we'll explore 15 key decisions for coding effectively in AI including IDEs, models, harnesses, instructions, permissions, agents, and more. You'll leave this session with a variety of ideas for how to rethink your AI-related tooling, patterns, and workflows.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "424f7166-a882-473f-b05e-15aed7f9ff86"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1119405",
      "title": "Claude Code in Action: Transforming Custom Software Development with Agentic AI",
      "description": " AI is no longer just a developer productivity boost — it's becoming a core driver of how software is designed, built, and delivered. At the forefront of this shift is Claude Code from Anthropic, a powerful, agentic AI coding partner that's redefining what's possible in modern development.\r\n\r\nIn this session, we'll cut through the hype and show decision-makers how Claude Code can directly accelerate delivery, improve quality, and unlock new capabilities in your custom software projects. We'll explore:\r\n\r\nAgentic development in action — how Claude Code plans, reasons, and collaborates with your team to produce production-ready code\r\n\r\nIntegration across leading IDEs and environments for seamless adoption\r\n\r\nReal-world use cases where Claude delivers transformational ROI — from rapid prototyping to complex refactoring and ongoing maintenance\r\n\r\nPricing models and considerations for scaling across teams\r\n\r\nHow we at ArchitectNow incorporate Claude into our own development process to deliver faster and smarter\r\n\r\nThrough illustrated real-world scenarios and concrete examples drawn from production projects, you'll see why Claude Code stands apart — not just as another coding assistant, but as a strategic tool for driving efficiency, innovation, and competitive advantage in custom software development.\r\n\r\nWhether you're a CTO, CEO, development manager, or project leader, you'll leave with a clear understanding of how Claude Code fits into your AI adoption strategy — and actionable steps to start realizing its benefits immediately.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b699d89f-f1d6-4fd5-be01-2594a950f55d"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Meetups and UG's around the midwest.  To customers as well."
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1121367",
      "title": "Comparing Promises, Observables, and Signals",
      "description": "Since JavaScript is single threaded, special techniques are necessary for asynchronous and reactive programming.\r\n\r\nPromises were introduced a few years ago to enable asynchronous programming without the dreaded \"callback hell\". They are a very powerful tool, especially with the async/await syntactic sugar.\r\n\r\nBut limitations in promises opened the door to observables and their associated operator functions. They are much more powerful than promises overall, but can also be much more confusing.\r\n\r\nSignals are yet another approach, one that has gained a lot of attention since Angular adopted them in 2023, but it solves completely different problems.\r\n\r\nNow we have three different reactive primitives. Why? What's the difference between them? Why would you choose one over the other? Or will they all have complementary roles in a modern JavaScript/TypeScript application?\r\n\r\nCome to this session to get the answers to these questions, and more!",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b6e26226-8a65-46e7-9538-d0924f53d895"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Yes, at UtahJS 2025 (recording: https://www.youtube.com/watch?v=hzyWBleh6e8) and CodeMash 2026 (slides: https://tinyurl.com/cm2026ReactivePrimitives)"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1129837",
      "title": "Completing the Rewrite from Hell: Five Years of Technical Debt and How We Escaped",
      "description": "Bad architecture decisions don't just slow you down - they destroy business value. Poor coupling means you can't add the features customers are asking for. Data model mistakes mean you don't have the information to answer your questions, and a lot of your decisions can't be easily reversed. You know the problems are there. You've known for years. But there's never time to fix it properly - you're too busy keeping the lights on.\r\n\r\nThen one day, the stars align. You finally have time to tackle it. You open the codebase, ready to make things right - and realize you have no idea where to start. Everything is wrong. Every fix breaks something else. The whole thing feels impossible.\r\n\r\nI'm a business owner. I had full authority to prioritize this rewrite. No one to convince, no budget to fight for. I still couldn't make it happen for five years - even while watching money walk out the door.\r\n\r\nThis is the story of how we finally completed that rewrite. You'll learn:\r\n\r\n- Why we abandoned a full rewrite and pivoted to strategic refactoring instead\r\n- How to assess whether your legacy system is salvageable (ours barely was)\r\n- The architectural patterns - including the actor model - that would have prevented this mess\r\n- How we used AI to accelerate the work (spoiler: it wasn't vibe coding)\r\n- The management failures that let this happen, and how to avoid them\r\n\r\nThis isn't a talk about how smart we are. It's about how we recovered from one of my biggest failures as an engineering leader - and what you can learn from our five-year journey through hell.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "470ab354-5943-49aa-b10e-b22be7166e72"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        },
        {
          "questionId": 118564,
          "answerValue": "https://aaronstannard.com/talks/ - just like the other talk I submitted, this one is new."
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1123888",
      "title": "Configurable cloud-native applications with .NET Aspire",
      "description": "Building apps for the cloud has always been hard. Developers are typically pulled away from writing their business logic and what matters most to deal with the complexity of the cloud.\r\n\r\nTo help simplify cloud app complexity, Microsoft has introduced .NET Aspire.  It includes a curated set of components that make sense to use in your C# projects.\r\n\r\n.NET Aspire makes it easy to discover, acquire, and configure essential dependencies for cloud-native apps from the very beginning of your project. \r\n\r\nJoin me to walk through the set-up and usage of this new, powerful tool that can make any .NET developer more efficient in delivering cloud-native applications.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "13924f5b-13f0-4fd8-a0bf-06f633dad5c9"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Beer City Code"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1124728",
      "title": "Cutting Through the Hype: Building High Performing Teams",
      "description": "Whether you’re a leader or an individual contributor, you rely on teams to get meaningful work done. We’ve been working in teams forever, yet some groups move fast and deliver consistently while others seem permanently stuck in the slow lane.\r\n\r\nIt’s not because one team has mythical “10x engineers” or the latest AI tools. Those things can amplify performance, but they don’t create it. High‑performing teams are built on a foundation of strong people practices and clear, healthy standards.\r\n\r\nDesigned for new leaders or anyone seeking a fresh perspective, this session breaks down a practical approach to building great teams by focusing on people and standards—and the way the two reinforce each other. By the end of this session, not only will you have ideas on how to improve your team, but also a concrete roadmap you can apply immediately.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "62ebafd8-8470-4415-bc16-6949e5c80f5b"
      ],
      "categoryItems": [
        431279
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1121847",
      "title": "Dark UX Patterns",
      "description": "Congratulations! You are the 1,000,000th visitor to our website. Click here to redeem your prize! Just provide your date of birth and phone number to get started.\r\n\r\nLearn about Dark UX Patterns, how they work, how they trick you and what companies are the worst offenders. Roach Motel, Privacy Zuckering? Let’s visit Dark Patterns Hall of Shame and see who joined the dark side!\r\n\r\nThis talk will break down the most popular dark patterns using real life examples from websites and apps you use every day. If you are a designer, a developer or a product manager, you will learn what to avoid when building your product and how to integrate digital well-being and safety features into your service. If you are an end user, we will teach you how to respond to dark patterns in order to stay safe online, protect your privacy, save your money and keep your sanity.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "11fbf1c5-b0fc-42eb-a027-4fea2e54bb12"
      ],
      "categoryItems": [
        431278
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "CodeMash"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1124736",
      "title": "Decision Records: Understanding Why Those Decisions Were Made!",
      "description": "Ever stared at a complex system and thought, \"Wait, why was that decision made?!” We’ve all been there – lost in a maze of logic, struggling to track down the root cause of a problem. Decision Records offer a brilliant way to finally unlock that understanding. They’re like having a detailed, searchable log of every decision in your applications – from architectural style to authentication to service discovery and containerization. By capturing these decisions, you build more maintainable, auditable, and, frankly, less frustrating systems. In this session, you will learn how decision records solve problems and will be given ideas of templates that you can implement in your projects today! Let’s ditch the guesswork and start documenting the why – because truly understanding your systems is the key to unlocking its full potential!",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "9bde9de9-7bcb-4077-8087-47bf492a1344"
      ],
      "categoryItems": [
        431275
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": ".NET Conf 2025 (30-minutes) https://www.youtube.com/watch?v=eHqBZOrx6ZI, CodeMash 2026 (1-hour, not recorded) "
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1126334",
      "title": "Designing Data Pipelines That Don’t Hate You Six Months Later",
      "description": "Most data pipelines don’t fail on day one. They fail months later — when requirements change, data volume grows, or the original developer is no longer around. Much like martial arts training, pipelines built on shaky fundamentals tend to collapse under pressure.\r\n\r\nThis session focuses on practical data pipeline design patterns that emphasize durability, maintainability, and operational confidence. Drawing from experience modernizing enterprise data platforms, I’ll walk through common failure modes in batch and streaming pipelines and how disciplined upfront design decisions can prevent them.\r\n\r\nWe’ll cover topics such as schema evolution, idempotency, observability, testing strategies, and scaling — grounded in real examples of what worked, what broke, and what we had to correct after the fact. There are no silver bullets here — just repeatable patterns and lessons learned from systems that had to stay running while everything around them changed.\r\n\r\nThis talk is tool-agnostic and focused on principles that apply whether you’re using Python, Spark, Kafka, or traditional ETL platforms.\r\n\r\nWhat’s in it for the attendee\r\n- How to design pipelines that withstand change and growth\r\n- Patterns for building observability and testability into data systems\r\n- Common anti-patterns that lead to brittle pipelines\r\n- Practical guidance rooted in real production experience",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c04acb4e-f54c-41d8-881a-8ca1f27e5d98"
      ],
      "categoryItems": [
        431277
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1124045",
      "title": "Ensuring Software Quality in the world of AI Developers",
      "description": "Like it or not, AI agents are now capable of turning a quickly written paragraph of requirements into a pull request that is ready to be integrated into real-world production applications and it's now our responsibility to make sure AI doesn't go rogue and take down prod - or corrupt our data by misunderstanding the requirements or our existing schemas.\r\n\r\nIn this session we'll explore strategies to protect our codebases through unit and integration testing, documentation, and code review along with additional ways of providing context and guard rails to our AI agents as they carry out the work we've assigned them to do.\r\n\r\nBy the time we're done, you'll have a firm grasp of the problem and understand some helpful options for protecting your codebase from vibe coding mishaps getting YOLOed into prod.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "17c299ee-d9fd-4020-b499-2837b2b3a2bf"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1128028",
      "title": "From Power to Supply Chains: Sustainability is Security",
      "description": "Technology is moving fast, and so are the environmental challenges we face. Security sits right in the middle of these pressures. It’s no longer just about defending systems—our choices around power, hardware, and supply chains also shape how secure those systems really are.\r\n\r\nIn this talk, I’ll explore why sustainability belongs in the security conversation. We’ll look at practical steps—like energy-efficient tools, leaner software, greener data centers, and responsible hardware lifecycles—that cut waste and costs while strengthening defenses. Just as importantly, we’ll examine how unstable supply chains, poor sourcing, or unreliable power can become security risks in themselves.\r\n\r\nWe’ll also connect this to risk and compliance: how building sustainability into security reduces exposure, steadies supply chains, and keeps organizations ahead of changing expectations. With real-world examples, you’ll walk away with a clear sense of how sustainability and security reinforce each other, and how to apply that thinking in your own work.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "bb52359f-7de5-4ab4-be0c-e0fdf39b7134"
      ],
      "categoryItems": [
        431280
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Codemash 2026"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127299",
      "title": "From PRs to Performance: Using Metrics and AI to Coach Stronger Engineering Teams",
      "description": "Velocity is useful, but it is not leadership. Most organizations either stop at team velocity and “gut feel,” or they overcorrect into individual scoreboards that erode trust and create perverse incentives. This talk shares a pragmatic middle path: how engineering leaders can use metrics to understand delivery health, code quality, and collaboration, without turning measurement into micromanagement.\r\n\r\nI built an internal metrics web application that connects to common systems like code repositories and agile/project tools (GitHub and Linear in my case, but the approach generalizes to Jira and other platforms). It tracks velocity and estimation trends over time, compares individual and team patterns, and adds pull request analysis to surface quality signals. I also integrated AI (Claude) to review commits and PR discussions and generate a quality assessment across four dimensions: code quality (DRY/SOLID), testing habits, adherence to standards, and collaboration in code review.\r\n\r\nThis session is designed for senior engineers through executive technology leaders. You will learn which metrics are actually useful, how to implement a dashboard in your environment, and how to apply guardrails so metrics drive coaching and continuous improvement rather than fear or gaming. The examples and demo are fully offline using anonymized or mock data and precomputed AI outputs, so the approach works even with limited connectivity.\r\n\r\nWhat’s in it for you: you’ll leave with a concrete dashboard blueprint and an implementation plan you can apply immediately: what to measure, how to visualize it, how to layer in AI responsibly, and how to use the signals to coach, improve standards, and raise delivery confidence.\r\n\r\nKey takeaways\r\n* A leadership-oriented metrics framework: outcomes vs system signals vs behaviors (and what not to measure)\r\n* A practical dashboard design that combines velocity, estimation reality (“hours per point”), and PR signals\r\n* How to use AI as an assistant for qualitative insights (and how to calibrate it so it does not become “truth”)\r\n* Guardrails for trust: privacy, transparency, and preventing metric gaming\r\n* A step-by-step path to build this in your org using APIs from your existing tools\r\n\r\n45-minute outline\r\n* Why most engineering metrics fail in practice (5 min)\r\n* Velocity, estimation, and forecasting that leaders can actually use (10 min) team velocity per cycle, averages, “hours per point” trends comparing individual patterns to team patterns without weaponizing it\r\n* Pull request signals that reveal quality and delivery risk (10 min)\r\nreview cycles, rework patterns, standards drift, collaboration signals\r\n* AI-assisted quality analysis, responsibly (12 min)\r\ncode quality, testing quality, standards, collaboration\r\ncalibrating with spot checks and known baselines; using confidence labels\r\n* How to apply the signals: coaching, leveling expectations, and intervention (6 min)\r\n* Build plan: how to implement this dashboard in your environment (2 min)",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b4bb31af-bcf8-4f20-af95-dd1c0d93f309"
      ],
      "categoryItems": [
        431279
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1123967",
      "title": "Generating Quality Code with AI",
      "description": "\"AI writes slop\" is a common concern. So how can we use LLMs to not just generate good code, but to *ensure* quality? Let's explore how to create effective \"guardrails\" via generated tests, spec-driven development, instruction approaches, prompting techniques, context management, and more. After this session you'll have a list of ideas for improving your AI coding workflow.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "424f7166-a882-473f-b05e-15aed7f9ff86"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127279",
      "title": "Ghosts in the Machine: Tampering with the JavaScript Supply Chain",
      "description": "What if the code you’re shipping isn’t yours anymore? The scariest JavaScript bugs don’t always come from your team, they come from open-source packages that have been possessed. This talk digs deep into the dark world of supply chain tampering: what it looks like, how it happens, and what modern devs can do to protect themselves. We’ll talk tamper detection, package provenance, lockfile integrity, and even how to set up GitHub Actions to ward off malevolent merges. Come for the security, stay for the stories of cursed commits.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "730a789f-e2a8-483d-91bc-6e794f1b44d5"
      ],
      "categoryItems": [
        431280
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1126556",
      "title": "Git Configuration secrets THEY don't want you to know about",
      "description": "In 2021 the Git core developers were asked to reset their config settings to see what working on Git \"Out of the Box\" was really like. They were then challenged to come up with the top settings that they really wanted to change. What came from that exercise was a list of 9 settings that the core development team mostly unanimously agreed should be the defaults.\r\n\r\nAttendees will leave this session with the following take ways:\r\n\r\n* How to configure Git so it is more ergonomic and pleasant to work with\r\n* How Git settings may change depending on our workflow\r\n* A deeper understanding of the internals of Git",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "53ac8546-b51e-4755-8d18-67c519a981c0"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Codemash, Nebraska.Code, Lincoln.Code"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120202",
      "title": "How to Ruin a User Interface: Surprisingly Easy Ways to Screw Over Your Users",
      "description": "Sure, when your boss signed the expense form for you to attend this conference, they thought you’d be bringing back new ideas about BETTER ways to do stuff – but honestly, isn’t that a little boring? What if we mixed it up a bit and instead discussed all the ways to make your UIs WORSE? \r\n\r\nFrom dark patterns to bad designs, there are tons of shockingly easy ways that you might be unknowingly making your website or app experience more difficult – or even painful – for your users. In this session, we’ll talk through some of the most common, so that you can avoid them in the future…or, you know, intentionally include them, if you’re evil. With great power comes great responsibility.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "44406a2e-5504-47d4-8fef-6d5c110704a0"
      ],
      "categoryItems": [
        431278
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "VueConf, RenderATL, 200OK "
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1131005",
      "title": "Increasing Productivity by Doing Nothing",
      "description": "It is easy to mistake “busy” for “productive.” We fill every gap—messages, meetings, side tasks, even our “breaks”—and then wonder why our focus, creativity, and decision-making keep getting worse.\r\n\r\nThis talk is about doing nothing on purpose. Not as a productivity hack, but as a practical way to restore your mind, body, relationships, and clarity. You’ll leave with a simple approach you can use immediately, plus a one-week experiment to reclaim slack in your day—because the deviation from the deadline will be far worse if you run out of gas.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5698811a-4c31-4537-970d-e427009e0cca"
      ],
      "categoryItems": [
        431279
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1121838",
      "title": "Java Anti-Patterns",
      "description": "God object, spaghetti code, magic numbers? Anti-patterns are traps that developers encounter frequently due to lack of time, carelessness, inexperience, or pressure from project managers. Rushing can lead to big problems for applications in future, so you need to know how to avoid potential errors.\r\n\r\nCome learn about Java Anti-Patterns. In this session beginner Java developers can learn to identify common rookie developer mistakes. Experienced developers can cry or laugh together as we look at real-life examples of Java code. You will leave this session knowing how to avoid these anti-patterns and write elegant, maintainable, and (dare we say it?) fun to work with code. Finally, you will find better ways to implement solutions using Java.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "11fbf1c5-b0fc-42eb-a027-4fea2e54bb12"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "CodeMash"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127280",
      "title": "Know Your JS: SBOMs for Frontend Devs",
      "description": "Ever wonder what’s lurking in the dark corners of your node_modules, like unidentified flying dependencies sneaking aboard your project? In an age of escalating software supply chain attacks, knowing exactly what you're shipping is as vital as tracking strange lights in the sky. This talk will shine a beam on SBOMs (Software Bills of Materials), explaining why frontend developers should care and how to generate one using tools like CycloneDX and Syft. You’ll leave with the skills to map your entire dependency galaxy. No security clearance required, just your JavaScript and an explorer’s mindset.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "730a789f-e2a8-483d-91bc-6e794f1b44d5"
      ],
      "categoryItems": [
        431280
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "https://shownotes.tuxcare.com/know-your-js-sboms-for-frontend-devs-5/"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130920",
      "title": "LGTM is not a Strategy",
      "description": "Pull requests are where quality is won or lost, and too many teams still treat reviews with a rushed \"LGTM\". In this talk, you'll learn a practical, repeatable approach to high-quality PR reviews that balances speed with risk management - covering how to triage changes quickly, review in layers, and write comments that lead to better outcomes without friction.  We'll also show how QA and developers bring complementary lenses to the same review, turning acceptance criteria, scenarios, and observability into shared responsibility instead of production surprises.  You'll leave with a lightweight framework and concrete habits for authors and reviewers that make reviews faster, kinder, and more effective.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "01782d24-b1aa-4645-a9f5-a15e51bf132c"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130963",
      "title": "Maintenance by Smell: When Reading Every Line Becomes Obsolete",
      "description": "Classic scenario. You get handed someone else's codebase. The original author has left for a beach somewhere, better gig, or possibly witness protection.\r\n\r\nYesterday: Read it. Line by line. Function by function. Build a mental model. Understand it deeply. Then fix it.\r\n\r\nTime required: Somewhere between \"too long\" and \"I have regrets about my career choices.\"\r\n\r\nToday: Don't read it. Ask AI what it does. Investigate what smells funny. Fix the smell. Move on with your life.\r\n\r\nThis talk is about the shift from syntax comprehension to diagnostic intuition. It's the difference between memorizing every street name in a city versus knowing the neighborhoods well enough to sense when you're heading somewhere sketchy. You don't need to parse every semicolon, you need to recognize when something's wrong.\r\n\r\nThe key skill isn't reading code faster. It's asking better questions. \"What's the happy path here?\" \"Where could this blow up?\" \"Why does this function exist?\" And critically: \"What's the thing the original author was worried about that I should also be worried about?\"\r\n\r\nYou'll walk away with practical patterns for smell-based debugging, the questions that matter more than comprehensive reading, and a significantly improved relationship with legacy code. (It's still not a good relationship. But it's faster.)",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "88b7259a-70ff-4438-a85a-16d87363f3e2"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1126202",
      "title": "Making and Baking an Application Security Department",
      "description": "Houston, we have a problem: we need more application security professionals. There is a lack of talented folks that can test, document and train developers on how to fix web and mobile applications for security vulnerabilities. Verizon’s estimates of 86% of 2017 breaches are caused by an application security component. This is a problem we must solve. \r\n\r\nBill and his team have been researching and experimenting on ways to solve the application security talent shortage. During this session, Bill will explain what they learned by teaching students of different experience levels. He will answer questions like: \"Who should I start with?\" and  \"What do they need to know to be effective?\" as well as what tools are most appropriate for them to learn.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "edf87fe3-df21-4e80-8834-c0d0365dbb59"
      ],
      "categoryItems": [
        431280
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "BSides Cleveland"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1125439",
      "title": "Managing for Failure",
      "description": "Oh no! Your team is doing a fabulous job. You never have to have difficult conversations, everyone is getting their work done to a high standard and on time. The higher ups are super happy with you. No one on your team has failed in longer than you can remember! How could you let this happen and what can you do to fix it?\r\n\r\nFailure is an important part of growing your team - both the individuals on it and the cohesiveness of the whole. Without it creative problem solving can stagnate, learning slows to a crawl, and the work you get done is less than it could have been. \r\n\r\nWe’ll dive in to strategies for helping your team (including you!) feel comfortable with failure, as well as strategies for keeping YOUR boss happy when it happens. We’ll also explore low-stakes ways to introduce failure into your team, so you’re not taking down prod to prove a point. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "645adf23-f177-4ca8-b3c5-f2217624f488"
      ],
      "categoryItems": [
        431279
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "KCDC, Momentum"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1126959",
      "title": "MCP Demystified 🤖",
      "description": "It is the age of AI, and there is a huge opportunity for developers to infuse apps with solutions powered by generative AI and large/small language models. Modern AI is big opportunity to streamline and automate developer workflows for better productivity. There are some challenges though – AI Models often lack context, and AI Agents need expertise to reliably pull off complex workflows across disparate systems.\r\n\r\nModel Context Protocol (MCP) can help. Developed as an open standard, MCP aims to provide a standardized way to connect AI models to different data sources, tools and non-public information. The point is to provide deep contextual information/APIs/data as tools to AI models/agents—MCP services also support robust authentication/authorization toward executing specific tasks on behalf of users.\r\n\r\nDevelopers can think of MCP as a common standardized language for information exchange between AI Agents/systems - MCP is growing in popularity and is showing a lot of promise as the emerging standard that bridges AI models with the tools they rely on. Beyond the hype, let’s understand the promise of MCP and explore tooling to easily create MCP Servers/Clients. With official SDKs, it is a breeze to work with MCP and boost AI Model responses or surface tools to extend AI Agents. Developers could bring their own data, APIs, services and more through MCP - and have it surfaced through Agents in GitHub Copilot/Claude Code/Cursor. MCP provides a standardized protocol for bringing contextual expertise to the AI world and light up unique workflows for integrations – upwards and onwards.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "fc1d0cd3-9675-4188-aa98-e0088069f1a4"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130941",
      "title": "Microsoft Fabric for Developers",
      "description": "Does your operational database contain staging and reporting data? Is it bloated and struggling under the load? As companies grow, its common to reach a tipping point where you can't just put everything into your shared OLTP database and keep scaling it up. That's when it's time to start thinking seriously about data and how best to manage it.\r\nTraditionally, data warehousing and ETL have required different skill sets and operated independently from application development, but with platforms like Microsoft Fabric, the skillsets aren't so different anymore, especially if you know a bit of Python.\r\nThis session will talk about some of the many services that make up Fabric, and how to use it coming from a development background.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "5b65f17e-cf5a-4746-84d6-217e6445931e"
      ],
      "categoryItems": [
        431277
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130675",
      "title": "Mission: AI Possible – Taming your AI agent swarms",
      "description": "As organizations implement AI systems, they often encounter tasks too complex for a single agent—making multi-agent architectures vital. For example, hospitals rely on specialized agents for medical imaging, scheduling, and insurance coordination; travel platforms use agents to book flights, find hotels, and suggest activities; retailers automate inventory, supply chain, and CRM through multiple integrated agents; and software teams decompose projects across coding, testing, and documentation agents. In these scenarios, successful orchestration ensures agents communicate, delegate, and collaborate effectively, always staying aligned with organizational goals.\r\n\r\nIn this talk, we will explore how Microsoft Agent Framework provides a robust foundation for building and orchestrating multiagent systems that are secure, extensible, and production ready. We will review the best practices and architecture patterns required to implement different orchestration workflows (for example: Sequential, concurrent and handoff) as well as the unique challenges presented by each of them.\r\n\r\nBy the end of the session, participants will understand how to apply different orchestration workflows to build scalable, collaborative AI systems that leverage multiple agents to deliver higher accuracy, resilience, and automation across different scenarios.\r\n",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "62b5c0da-ecfa-4566-8ce2-4eeb8e2d321d"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120566",
      "title": "Productivity Theater: When ‘Just Use AI’ Becomes a Management Strategy",
      "description": "We’re living through a strange era of work: leaders are told AI enables “10×” or “100×” productivity, while engineers are quietly fixing AI-introduced bugs, validating hallucinated outputs, and absorbing the mental load of tools that are powerful, but deeply imperfect.\r\n\r\nThis talk is about surviving that reality.\r\n\r\nWe’ll examine what actually happens when AI enters real developer workflows: where trust is partial, verification is mandatory, and speed often comes at the cost of focus and creativity. We’ll talk candidly about productivity theater, unrealistic expectations, and the quiet burnout that happens when “just use AI” becomes a substitute for good leadership and sustainable engineering practices.\r\n\r\nDrawing from real conversations with engineers and teams, this session offers practical ways to:\r\n• Push back (constructively) against impossible productivity narratives\r\n• Use AI without surrendering judgment, craft, or accountability\r\n• Protect mental energy in environments obsessed with output metrics\r\n• Re-anchor DevOps values around humans, not hype cycles\r\n\r\nThis isn’t a talk about how to get more done. It’s a talk about how to keep doing good work, and maintain health and stability, in a world that thinks software engineers should be machines.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "d98ac233-d319-45ab-9729-41f7c4ae2a62"
      ],
      "categoryItems": [
        431279
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120265",
      "title": "Securing your Azure AI Workload",
      "description": "You've been given the task of creating an AI workload that will work with your data to allow your customers to get answers.  Perhaps you even want to use some of these new \"agent\" things you've been hearing so much about.  Maybe you need to see how your regular apps can also integrate with your workload.\r\n\r\nBut AI is scary.  Just ask Samsung how they felt when their proprietary code showed up in chat GPT answers.  Just look to the Canadian Airline that had to pay a refund because their chat agent said the customer should get one.  Or how about the guy who negotiated a truck for $0?  It's challenging and scary - and that's just the implementation.  Just to be clear, learning how to ground your data properly is an entirely different session - and while we'll talk about that briefly, this session is more about the workload in Azure itself.\r\n\r\nWhat about the exposure of your data via your azure services?  How can you keep your HIPPA/GDPR/NIST certifications *and* integrate an azure AI workload?\r\n\r\nIn this session, you will learn about how you can correctly utilize Azure services to secure your AI workload from public exposure, and how you can connect securely to the AI deployments from your other secure services.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0c4f74c9-6be8-40d0-b588-674d3b783472"
      ],
      "categoryItems": [
        431275
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120953",
      "title": "Ship It First, Fix It Later: How a Medical Crisis Led to a Global Tool",
      "description": "When Roxy’s son was hospitalized yet again, she noticed nurses struggling to calculate his g-tube feed rates, so she built solution with simply HTML, CSS, and JavaScript, then almost didn’t share it due to everyone’s favorite pal, imposter syndrome. This talk chronicles a very specific calculator’s evolution into a production React PWA with AI integration, now used daily by families worldwide, who even find it through organic Google searches. Through honest code comparisons, you’ll see when vanilla JavaScript hits its limits, why React’s patterns became necessary, and how AI tools can accelerate development while you continue learning. You’ll also leave with a six-step framework for iterative development that overcomes the fear of shipping imperfect solutions. Whether you’re considering a React migration, curious about AI-assisted development, or sitting on a side project, you’ll leave with technical insights and a renewed motivation to ship.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "48167b9e-8862-4e6c-9bc9-17b89e0baaf6"
      ],
      "categoryItems": [
        431274
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "MagnoliaConf"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130900",
      "title": "The 5 Fundamentals of UX Everyone Should Know",
      "description": "If you are building something (website, API, developer tools, presentation, email, etc.), you are creating a UX (user experience). How do you make that a good user experience?\r\n\r\nIn this session, we will discuss 5 fundamental questions you can use as a framework to put you on the path to creating products your users will love.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "b642eabd-7250-4ac5-b3b0-ce01951b88aa"
      ],
      "categoryItems": [
        431278
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "CodeMash"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127331",
      "title": "The Dark Side of Microservices",
      "description": "You want to solve a problem with your application, and you want to use microservices. Ok, so now you have two problems...\r\n\r\nMicroservices continue to be a huge buzzword in our industry, and in some scenarios they can offer significant benefits. But building microservice-based systems requires substantially different skills than traditional applications, and in many cases the added complexity isn't warranted.\r\n\r\nIn this session, you'll learn when NOT to use a microservice, and many ways in which you can design your microservice architecture the wrong way, eliminating the benefits your organization had hoped to reap from them. Hopefully you'll leave knowing a few pitfalls to avoid, or at least if you already have some of the scars from past implementations, you may find the session therapeutic.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "a5d50f4e-f021-4983-97a9-73f9415b3d5b"
      ],
      "categoryItems": [
        431275
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "DevIntersection 2025 and others; always gets good ratings/feedback. "
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1131041",
      "title": "The Death of Data: AI, Obsolescence, and Your Digital Afterlife",
      "description": "Our lives are increasingly lived as data—photos, chats, documents, posts, code—but most of it is quietly dying. Formats rot, platforms disappear, accounts get locked, and even our memories fade. In this talk, we’ll explore “The Death of Data” through the lens of Swedish Death Cleaning: what would it look like to intentionally curate, archive, or delete our digital lives before entropy or corporate policy does it for us?\r\n\r\nWe’ll examine how AI is accelerating both preservation and erasure: from generative models trained on our public traces, to AI-powered photo enhancement, summarization, and memorialization tools that can outlive us. Along the way, we’ll look at digital memorials, legacy videos, and time capsules, and ask: what do we actually want to survive us—and who gets to decide? You’ll leave with a new mental model for your digital afterlife and practical ideas for designing a more intentional legacy.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0dfa92b1-c9a1-4910-8e95-a31049f0665a"
      ],
      "categoryItems": [
        431282
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120257",
      "title": "The DevOops Handbook: A satirical guide to slow software delivery",
      "description": "In the quest for rapid software delivery, DevOps principles are misapplied or skipped entirely, leading to a “DevOops culture.” In this talk we'll explore DevOps missteps through a satirical narrative where missteps and bad practices are presented as the path forward.\r\n\r\nTo start, we’ll discuss deploying code the way of the masochist. This will include a convincing argument for detail-oriented change requests and late-night deployments to prevent any witnesses to our misdeeds. Following this, we will outline our project mismanagement philosophy for maintaining constant chaos: embracing siloes and eliminating feedback loops. Finally, we'll present why quality assurance is overrated and unnecessary. Instead, we'll present the benefits of zero testing and disabling quality and security tools – they are just like that “check engine” light in the car: useless and annoying.\r\n\r\nTogether we’ll see how easy it is to establish the worst DevOps culture for modern software delivery: a DevOops culture! \r\n\r\nOr not. While this talk is tongue in cheek, we will see how to overcome these all-to-real mindsets. By the time we are done, we'll have navigated the treacherous waters of software misadventures with a wink and a smile so we can march forward, turning our ‘oopses’ into opportunities and our code catastrophes into triumphs.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "ac76d40e-1703-43ab-8b89-9402befdf3b1"
      ],
      "categoryItems": [
        431281
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Momentum, MITechCon, user groups, DevOpsDays"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1120206",
      "title": "The Life-Changing Art of Being Wrong",
      "description": "Even if it’s not intentional, there are a lot of assumptions we make about our users – everything from which devices they use to access our applications to what kinds of characters are included in their names. And guess what: our assumptions are usually wrong. Like…really wrong. Sometimes this creates laughable situations, but other times it causes a lot of unintentional harm. In this talk, we’ll discuss some of the most common (wrong) things that we, as developers, believe about our users and how we can shift our assumptions to create software that’s better for everyone. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "44406a2e-5504-47d4-8fef-6d5c110704a0"
      ],
      "categoryItems": [
        431278
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "CodeStock, VueConf "
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130802",
      "title": "The Low Risk Entrepreneur",
      "description": "We all love what we do and we know that if we were in charge, we could do it better!  But how do you make the leap from employee to the coveted position of \"Your Own Boss\"?  Are you ready to quit your job?  Do you HAVE to quit your job?  In this session, we'll look at the options for those who are considering making the big leap - and ways to make it less scary.  Attendees will learn about ways to be an entrepreneur while minimizing the risk, and even ways that they can \"entrepreneur in place\" at their current gig.  If you are itching to make a change, but not sure how to move forward, this session is for you.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "0a6a65cd-0f7c-4490-8168-3ac1d1f0c869"
      ],
      "categoryItems": [
        431279
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1143160",
      "title": "The Vibe Analyst's Guide to AI Coding: From Autocomplete to Agent Orchestration",
      "description": "Whether you're experimenting with AI coding assistants or managing teams that use them, understanding \"vibe coding\" is essential to navigating software development in 2026. This talk decodes the shift from autocomplete to autonomous agents, examining how developers went from tab completion to directing parallel AI workers overnight. You'll gain a clear framework for the 10 key capabilities developers now demand—from background agents and persistent memory to multi-agent orchestration and rollback systems—along with practical insights into which tools deliver and which fall short based on real practitioner feedback.\r\n\r\nBeyond the hype, you'll learn to navigate the defining tension shaping the market: the battle between human-in-loop control (audit trails, permissions, safety) and vibe coding's \"trust the output, not the process\" philosophy. Through examples like Ralph Wiggum's contextual pressure cooker, Gas Town's agent orchestration, and emerging patterns in spec-driven development, you'll understand where the ecosystem is headed and how to make informed decisions about adopting, managing, or building AI-assisted development tools. Whether you're a hands-on developer, engineering leader, or product strategist, you'll leave with a pragmatic understanding of what actually matters in this rapidly evolving space—and what's just noise.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "3d9afdca-043f-4a20-820c-f25ef3e85c1a"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "Dynatrace Perform. Not recorded. Jeff Blankenburg invited me to expand it and apply to present at Stir Trek"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127053",
      "title": "TypeScript You MIGHT Like",
      "description": "TypeScript isn’t just a stricter JavaScript, it’s a toolkit for writing clearer, safer, and more maintainable code. Many developers simply use it minimally after encountering verbose types, confusing errors, or patterns that feel academic.\r\n\r\nThis talk takes a different route: dozens practical, real‑world TypeScript examples you can use today without over‑engineering, or over-hauling, your codebase. Through dozens of bite‑sized examples drawn from actual projects, we’ll cover patterns that reduce bugs, tips that keep types manageable, and features you might be overlooking.\r\n\r\nWhether you’re a JavaScript developer TypeScript‑curious, or an experienced user looking for new tricks, you’ll leave with ideas you can drop straight into your editor; and a new appreciation for TypeScript that you MIGHT actually like.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "ed4af73a-6781-4882-a8c3-12ee0c68c1a5"
      ],
      "categoryItems": [
        431275
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1127657",
      "title": "Unlocking Quantum Computing: An Overview",
      "description": "Quantum computing is coming, but most of the explanations out there are either too academic or too hand-wavy to be useful. This talk is a practical overview for developers who want to understand what quantum computing actually is, why it matters, and where it's headed. We'll walk through the core concepts like superposition, entanglement, and interference without the math-heavy deep dive. You'll see what quantum computers are good at, what they're not, and how they might affect the systems and security decisions you make in the future. No physics background required. You'll walk away with enough understanding to follow the conversation and recognize when quantum starts to matter for your work. ",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "c53b081c-6035-47f5-a606-91e83963556b"
      ],
      "categoryItems": [
        431282
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "I gave a workshop version of this with great feedback at CodeMash. This is the summarized version. "
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1128674",
      "title": "Vector Databases and Embeddings Demystified",
      "description": "Ever wonder how Netflix knows you'll love that obscure documentary about penguins, or how Google Photos finds every picture of your dog even though you never tagged them? The secret sauce is vector embeddings and similarity search – technologies that convert complex data (text, images, audio) into high-dimensional numerical representations that capture semantic meaning. While traditional databases excel at exact matches (\"find user ID 12345\"), vector databases revolutionize \"find similar\" queries by measuring relationships between these numerical vectors using techniques like cosine similarity. This session demystifies the math and technology behind the AI-powered search and recommendation systems you use every day.\r\n\r\nYou'll discover how companies transform words into vectors where \"king\" - \"man\" + \"woman\" actually equals \"queen\" in mathematical space, explore the architecture behind popular vector databases like Pinecone and see live demonstrations of building semantic search systems. We'll cover real-world applications from RAG-powered chatbots to fraud detection, show you how to implement document similarity search in 20 lines of Python, and discuss the practical considerations of scaling vector systems to billions of embeddings. Whether you're building recommendation engines, semantic search, or AI-powered applications, this session provides the foundational knowledge to leverage vector databases effectively in your projects.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "83dd13b2-4171-47e4-bece-ebf60502b632"
      ],
      "categoryItems": [
        431276
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "true"
        },
        {
          "questionId": 118564,
          "answerValue": "CodeMash"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    },
    {
      "id": "1130109",
      "title": "When Logs Tell the Whole Story: OpenTelemetry for Beginners",
      "description": "Failures in production are a certainty. When something goes wrong, the difference between a quick fix and a prolonged outage often comes down to whether your logs tell a clear, connected story.\r\n\r\nIn this session, we’ll introduce OpenTelemetry as a language-agnostic, vendor-neutral approach to application observability. We'll start with the fundamentals—what logs, traces, and metrics are, why they matter, and how they work together—before focusing on how to use logging effectively rather than excessively.\r\n\r\nAttendees will learn how to structure logs for clarity and correlation, how trace context connects logs across services, and how to choose log levels that provide insight without noise. We’ll also cover common logging anti-patterns, including over-logging and unstructured messages, and how to avoid them to keep both troubleshooting effort and observability costs under control.\r\n\r\nUsing practical, real-world examples, this session will show how OpenTelemetry logging improves debugging, incident response, and overall system understanding. Whether you’re new to observability or replacing a legacy logging approach, you’ll leave with a clear mental model and concrete best practices you can apply immediately.",
      "startsAt": null,
      "endsAt": null,
      "isServiceSession": false,
      "isPlenumSession": false,
      "speakers": [
        "e4808bf3-8fc2-43e5-b9d0-303f77f43547"
      ],
      "categoryItems": [
        431275
      ],
      "questionAnswers": [
        {
          "questionId": 118563,
          "answerValue": "false"
        }
      ],
      "roomId": null,
      "liveUrl": null,
      "recordingUrl": null,
      "status": "Accepted",
      "isInformed": true,
      "isConfirmed": true
    }
  ],
  "speakers": [
    {
      "id": "470ab354-5943-49aa-b10e-b22be7166e72",
      "firstName": "Aaron",
      "lastName": "Stannard",
      "bio": "Aaron is the founder and CTO of Petabridge, and the co-founder of the Akka.NET open-source project. Prior to Petabridge, Aaron founded MarkedUp Analytics, a real-time in-app marketing and analytics service used by 1000+ developers. Prior to that he worked at Microsoft as a Startup Developer Evangelist.",
      "tagLine": "Petabridge CEO, Akka.NET Founder, and .NET Contrarian",
      "profilePicture": "https://sessionize.com/image/5438-400o400o1-LsP5JdSvTKTp9ABiYAcp6u.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/Aaronontheweb",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/aaronstannard/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://aaronstannard.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://petabridge.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1129837
      ],
      "fullName": "Aaron Stannard",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "HOuston, TX"
        }
      ]
    },
    {
      "id": "8d6efde2-af82-4fb9-9d6a-1a88369657c1",
      "firstName": "Amanda",
      "lastName": "Lange",
      "bio": "Scrum master/ Product Owner with a demonstrated history of working in the computer software industry. Skilled in negotiation, enablement, communication, evangelism, autonomy, leadership, management, networking and KINDNESS! ",
      "tagLine": "Senior Agile Delivery Lead, NetJets",
      "profilePicture": "https://sessionize.com/image/ca60-400o400o1-h44dmwb2BVRDqg5kUfytxv.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/amanda-lange-scrummaster/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        1123424
      ],
      "fullName": "Amanda Lange",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus"
        }
      ]
    },
    {
      "id": "645adf23-f177-4ca8-b3c5-f2217624f488",
      "firstName": "Amy",
      "lastName": "Norris",
      "bio": "Amy is a graphic designer turned software developer currently building weird, cool, and unconventional stuff at Dimensional Innovations. On her off time she can be found volunteering with Kansas City Women in Tech, reading or playing Dungeons and Dragons.\r\n",
      "tagLine": "Software Development Supervisor, Dimensional Innovations",
      "profilePicture": "https://sessionize.com/image/cb31-400o400o1-4nPNWQbLmwf81JL3XiS1n.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/norrisamy/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.dimin.com",
          "linkType": "Company_Website"
        },
        {
          "title": "Bluesky",
          "url": "https://bsky.app/profile/amynorris.bsky.social",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1125439
      ],
      "fullName": "Amy Norris",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Kansas City, MO, USA"
        }
      ]
    },
    {
      "id": "5b65f17e-cf5a-4746-84d6-217e6445931e",
      "firstName": "Andrew",
      "lastName": "May",
      "bio": "Andrew has been consulting as an architect for Leading EDJE for 18  years, and has specialized in Cloud Platforms and Cloud-Native architecture for the last 10 years. He's a stickler for detail, and a fierce code reviewer. Originally from the UK, Andrew's accent has settled somewhere in the mid-Atlantic.",
      "tagLine": "Senior Solutions Architect, Cloud/DevOps specialist at Leading EDJE",
      "profilePicture": "https://sessionize.com/image/5963-400o400o1-BUh7aMr33kj34wAQVfdws.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/leadingedje",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/andrew-may-0554b3173",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.leadingedje.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1130941
      ],
      "fullName": "Andrew May",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus"
        }
      ]
    },
    {
      "id": "a5d50f4e-f021-4983-97a9-73f9415b3d5b",
      "firstName": "Ardalis",
      "lastName": ".",
      "bio": "Ardalis (Steve Smith) is an entrepreneur and software developer with a passion for building quality software as effectively as possible. Ardalis has published DOZENS of courses on Pluralsight and Dometrain, covering DDD, SOLID, design patterns, and software architecture. He's a Microsoft ASP.NET MVP, a frequent speaker at developer conferences, an author, and a trainer.\r\n\r\nArdalis works with companies through NimblePros, the boutique consulting company he runs with his wife, Michelle. They help teams who want to avoid the trap of technical debt to deliver better software, faster. Ardalis and NimblePros have been described by clients as a \"force multiplier\", amplifying the value of existing development teams.\r\n\r\nFollow ardalis on BlueSky, YouTube, and ardalis.com.",
      "tagLine": "Founder and Principal Architect at NimblePros, Microsoft MVP, Author, Speaker, Trainer",
      "profilePicture": "https://sessionize.com/image/0307-400o400o1-L2Be7vVA9x6NNKKT2NEqox.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/ardalis",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stevenandrewsmith",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://ardalis.com/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://nimblepros.com",
          "linkType": "Company_Website"
        },
        {
          "title": "BlueSky",
          "url": "https://bsky.app/profile/ardalis.com",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1127331
      ],
      "fullName": "Ardalis .",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Kent, Ohio"
        }
      ]
    },
    {
      "id": "e4808bf3-8fc2-43e5-b9d0-303f77f43547",
      "firstName": "Barret",
      "lastName": "Blake",
      "bio": "Microsoft MVP, husband, father, speaker, mentor, writer, architect@NimblePros, developer, former manager, gamer, LEGO enthusiast, Buckeyes fan, model railroader. When I'm not doing all that other stuff I also occasionally develop applications. Find links to my previous speaking, podcasts and sessions at my website: https://barretblake.dev",
      "tagLine": "#MicrosoftMVP, speaker, husband, father, architect@NimblePros, developer, former manager, gamer, LEGO enthusiast, Buckeyes fan, model railroader",
      "profilePicture": "https://sessionize.com/image/0d94-400o400o1-Dc7G7MqgRQdxCvhDFwtvfL.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/barretblake",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://barretblake.dev",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.cgi.com/en",
          "linkType": "Company_Website"
        },
        {
          "title": "Bluesky",
          "url": "https://bsky.app/profile/barretblake.dev",
          "linkType": "Other"
        },
        {
          "title": "Mastadon",
          "url": "https://mstdn.social/@barret",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1130109
      ],
      "fullName": "Barret Blake",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus"
        }
      ]
    },
    {
      "id": "edf87fe3-df21-4e80-8834-c0d0365dbb59",
      "firstName": "Bill",
      "lastName": "Sempf",
      "bio": "Bill Sempf is a software security architect. His breadth of experience includes business and technical analysis, software design, development, testing, server management and maintenance, and security. In his 20 years of professional experience he has participated in the creation of well over 200 applications for large and small companies, managed the software infrastructure of two Internet service providers, coded complex software happily in every environment imaginable, tested the security of all natures of applications and APs, and made mainframes talk to cell phones. He is the author of C# 5 All in One for Dummies and Windows 8 Programming with HTML5 For Dummies; a coauthor of Effective Visual Studio.NET and many other books, a frequent contributor to industry magazines; and has recently been an invited speaker for the ACM and IEEE, BlackHat, CodeMash, DerbyCon, BSides, DevEssentials, the International XML Web Services Expo and the Association of Information Technology Professionals. Bill also serves on the board of the Columbus branch of the Open Web Application Security Project, and is the Administrative Director of Locksport International.",
      "tagLine": "Application Security Architect",
      "profilePicture": "https://sessionize.com/image/7376-400o400o1-n9DpXHVGQEH9f9sZo1fqmj.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/billsempf/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://sempf.net/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.pointweb.net",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1126202
      ],
      "fullName": "Bill Sempf",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Grove City. I'll pack a snack."
        }
      ]
    },
    {
      "id": "ed4af73a-6781-4882-a8c3-12ee0c68c1a5",
      "firstName": "Bob",
      "lastName": "Fornal",
      "bio": "Microsoft MVP with focus is on Web Development: JavaScript, TypeScript, CSS, SVG, Angular, React, React-Native, Vue, and Ionic. I commonly speak about Cloud CI/CD, Quality Engineering, Best Practices, and Front-End Technologies.\r\n\r\n* Owner of Code Squid, LLC.\r\n* Senior Solutions Developer II (Front-End) at Leading EDJE, Inc.\r\n\r\n\"Learning from my mistakes over the decades, I feel that I have become a solid programmer.\" -- Me",
      "tagLine": "Microsoft MVP | Senior Developer with a passion for learning, testing, mentoring, speaking and personal growth. Blessed husband and proud father of two.",
      "profilePicture": "https://sessionize.com/image/5128-400o400o1-P6JDgB6iy1CVfjqvA2GQv5.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/rfornal",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/rfornal/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dev.to/rfornal",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.leadingedje.com/home",
          "linkType": "Company_Website"
        },
        {
          "title": "Business Website",
          "url": "https://code-squid.com",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1127053
      ],
      "fullName": "Bob Fornal",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH"
        }
      ]
    },
    {
      "id": "0c4f74c9-6be8-40d0-b588-674d3b783472",
      "firstName": "Brian",
      "lastName": "Gorman",
      "bio": "Brian is a Microsoft Azure MVP, speaker, author, trainer, and .NET developer with deep expertise across cloud and application development. He holds MCSA: Web App Certification, MCSD: App Builder, and twelve Azure certifications, including Developer, Administrator, DevOps Engineer, Solutions Architect, Data Administrator, Security Engineer, AI Engineer, and Cosmos DB — along with multiple Fundamentals certifications. Since 2019, he has also been a Microsoft Certified Trainer (MCT).\r\n\r\nBrian earned a Master of Science in Computer Information Systems and a Bachelor of Science in Computer Science. He brings over 15 years of experience teaching computer science, SQL databases, object-oriented programming (C#, VB.NET, Java), and Microsoft Office in online university settings.\r\n\r\nAs an educator and creator, Brian has developed numerous online training courses available across multiple platforms and has authored several books with APress, including Practical Entity Framework and Practical Entity Framework Core 6, Developing Solutions for Microsoft Azure Certification Companion: Hands-on Preparation and Practice for Exam AZ-204, and is scheduled to publish the third edition of Practical Entity Framework in November along with .NET/EF 10",
      "tagLine": "Microsoft Azure MVP, Speaker, Author, Trainer, and .Net Developer",
      "profilePicture": "https://sessionize.com/image/58a6-400o400o1-PUAuyP15wFdUoBZNW88Up8.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/blgorman",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        1120265
      ],
      "fullName": "Brian Gorman",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Iowa"
        }
      ]
    },
    {
      "id": "13924f5b-13f0-4fd8-a0bf-06f633dad5c9",
      "firstName": "Brian",
      "lastName": "McKeiver",
      "bio": "Brian McKeiver is Co-Owner at BizStream, digital agency in Allendale, MI. At BizStream he is a solution architect, visionary, dual Microsoft Azure MVP (Azure AI and Azure PaaS), Kentico MVP, and Kontent.ai MVP. He has over 23 years of experience leading his agency of more than 40 employees, about a hundred clients spread out across North America, and one heck of an interesting story of how it all started from a two-person team. In addition to his expertise in web development, cloud, integration, and digital marketing, Brian is active with the tech community via his blog at Mcbeev.com. ",
      "tagLine": "Microsoft Azure MVP; Co-Owner at BizStream",
      "profilePicture": "https://sessionize.com/image/97b3-400o400o1-nSLP29cVu9YTX6vADBG9Rd.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/mcbeev",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/brianmckeiver/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.mcbeev.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.bizstream.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1120223,
        1123888
      ],
      "fullName": "Brian McKeiver",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Grand Rapids, MI"
        }
      ]
    },
    {
      "id": "b642eabd-7250-4ac5-b3b0-ce01951b88aa",
      "firstName": "Burton",
      "lastName": "Smith",
      "bio": "I am a technical lead at Microsoft working with design systems and web components.\r\n\r\nI am also the creator of various open-source projects like Kickstand UI (a design system built with web components - kickstand-ui.com) and Clarion (a style framework for managing design systems - projectclarion.com).\r\n\r\nIn my free time, I love spending time with my wife and three daughters, practicing martial arts, jamming on my ukulele, and learning new things (usually about software engineering).",
      "tagLine": "Technical Lead at Microsoft",
      "profilePicture": "https://sessionize.com/image/a176-400o400o1-RK53QgNQm7o2xatLDp6RRh.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/stuffbreaker",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/burton-smith-48132a34/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://dev.to/stuffbreaker",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.microsoft.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1130900
      ],
      "fullName": "Burton Smith",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH"
        }
      ]
    },
    {
      "id": "62ebafd8-8470-4415-bc16-6949e5c80f5b",
      "firstName": "Cameron",
      "lastName": "Presley",
      "bio": "Cameron Presley is owner of Small Batch Solutions (https://smallbatchsolutions.io/), a speaker, and a Microsoft MVP in Developer Technologies.\r\n\r\nBased out of Charlotte, North Carolina, Cameron has ten years of experience working with start-ups and large enterprise both publicly and privately held to architect solutions, implement solutions, and training developers to be better today than what they were yesterday!\r\n\r\nIn his spare time, Cameron can be found hanging out with his family, playing board games, jamming on the bass guitar, and reading books.",
      "tagLine": "Owner of Small Batch Solutions - Professional Problem Solver",
      "profilePicture": "https://sessionize.com/image/d675-400o400o1-UnSBPiUNot5D6eQ1HzDxbH.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/pcameronpresley",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/pcameronpresley",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://blog.thesoftwarementor.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://smallbatchsolutions.io",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1124728
      ],
      "fullName": "Cameron Presley",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Cornelius, NC"
        }
      ]
    },
    {
      "id": "c04acb4e-f54c-41d8-881a-8ca1f27e5d98",
      "firstName": "Chris",
      "lastName": "Birie",
      "bio": "Chris Birie is a software/data/platform/jack of all trades engineer who believes strong systems and apps are built through repetition, fundamentals, and attention to detail. Influenced by his kung fu practice, he applies the same mindset to designing scalable architectures and delivery workflows. He is passionate about teaching, mentoring, and helping teams build software that holds up under pressure.",
      "tagLine": "Software and Data Martial Artist",
      "profilePicture": "https://sessionize.com/image/24a6-400o400o1-ECzGMghBfMqsDiKMxrpnee.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://x.com/biriebiriebirie",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/christopher-birie/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        1126334
      ],
      "fullName": "Chris Birie",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, Ohio"
        }
      ]
    },
    {
      "id": "730a789f-e2a8-483d-91bc-6e794f1b44d5",
      "firstName": "Chris",
      "lastName": "DeMars",
      "bio": "Chris DeMars is a Senior Developer Advocate with over 20 years of technical experience. He speaks all over the world on web accessibility, feature flags, A/B testing, and CSS. For his community contributions, he holds awards as a Progress Champion and former Microsoft MVP, Google Developer Expert, Cloudinary Media Developer Expert, and Auth0 Ambassador. When he is not working on making the web great and accessible you can find him fishing, on the paintball field, rating Detroit Style pizza, and looking for UFO's.",
      "tagLine": "Senior Developer Advocate at TuxCare",
      "profilePicture": "https://sessionize.com/image/0aff-400o400o1-DZTrRVmXSXXmBCc1HeyCNF.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "http://twitter.com/saltnburnem",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/chrisdemars/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://chrisdemars.net/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.tuxcare.com/",
          "linkType": "Company_Website"
        },
        {
          "title": "Dev Advocate Profile",
          "url": "https://bit.ly/dev-advocate-profile",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1127279,
        1127280
      ],
      "fullName": "Chris DeMars",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Detroit"
        }
      ]
    },
    {
      "id": "424f7166-a882-473f-b05e-15aed7f9ff86",
      "firstName": "Cory",
      "lastName": "House",
      "bio": "Cory is an author, a 12 time Microsoft MVP, and international speaker. He is founder of reactjsconsulting, where he helps companies transition to React. He has trained over 10,000 software developers at conferences and businesses worldwide. Cory has authored over a dozen courses on JavaScript, React, C#, testing, and web development on Pluralsight and Dometrain. He shares software development tips daily on X as @housecor.",
      "tagLine": "Author / Consultant",
      "profilePicture": "https://sessionize.com/image/059c-400o400o1-aYUBFjC32EiUaZTNmypwoN.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "http://www.twitter.com/housecor",
          "linkType": "Twitter"
        }
      ],
      "sessions": [
        1123968,
        1123967
      ],
      "fullName": "Cory House",
      "categoryItems": [
        432501
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Kansas City, KS"
        }
      ]
    },
    {
      "id": "fe170f42-5405-4ad7-a69f-2276f081bf7e",
      "firstName": "David",
      "lastName": "Giard",
      "bio": "David Giard is a former accountant and a former biochemist, who has been developing solutions using Microsoft technologies for over three decades.  Currently, David helps companies solve hard technical problems in his role as a Microsoft Partner Solution Architect. David has been very active in the developer community, speaking at numerous major conferences, code camps, and user groups around the world; helping to lead user groups; and helping to organize conferences and other geek events. He is the host and producer of the mildly popular online TV shows \"Technology and Friends\" and \"GCast\". He is the co-author of the Wrox book Real World .NET, C#, and Silverlight. You can read his latest thoughts at davidgiard.com.  His hobbies include video, photography, sports, and embarrassing his sons.\r\n",
      "tagLine": "Microsoft Partner Solution Architect",
      "profilePicture": "https://sessionize.com/image/b7ae-400o400o1-YSK1bcfJeCkfQkLugf1eYa.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/davidgiard",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/davidgiard/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://davidgiard.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://microsoft.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1128156
      ],
      "fullName": "David Giard",
      "categoryItems": [
        432501
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Chicago, IL, USA"
        }
      ]
    },
    {
      "id": "3fd9cade-10ef-43df-b124-944015042549",
      "firstName": "Ed",
      "lastName": "Charbeneau",
      "bio": "Ed is a Microsoft MVP and an international speaker, writer, online influencer, a Developer Advocate for Progress, and expert on all things web development. Ed enjoys geeking out to cool new tech, brainstorming about future technology, and admiring great design.\r\n\r\nEd has shared his insights, experiences, and advice around collaboration, knowledge management, social computing, and training at many industry events around the United States. Highly ethical and engaging with an uncanny business acumen, he is a creative community builder and outside the box thinker. Long term business relationships throughout the world within internal communications, employee engagement and marketing as well as IT. Focusing on Financial, Healthcare, Manufacturing, Agency and Professional Services. He has defined, architected, implemented line of business solutions with a touch of style and UX best practices.",
      "tagLine": "Ed is a Microsoft MVP and an international speaker, writer, online influencer, a Developer Advocate for Progress.",
      "profilePicture": "https://sessionize.com/image/eaa9-400o400o1-7HuHMgWphuKbPVZHn5J1ix.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/edcharbeneau",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/edcharbeneau/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.telerik.com/blogs",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.telerik.com/",
          "linkType": "Company_Website"
        },
        {
          "title": "Personal Blog",
          "url": "https://edcharbeneau.com",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1119472
      ],
      "fullName": "Ed Charbeneau",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Louisville "
        }
      ]
    },
    {
      "id": "b4bb31af-bcf8-4f20-af95-dd1c0d93f309",
      "firstName": "Eric",
      "lastName": "Martin",
      "bio": "Eric is the Director of Engineering at KODE Health, bringing 25 years of expertise in software development to his role. Specializing in revenue cycle systems for healthcare, Eric has built and led teams that automate and track 1 billion communications annually.\r\n\r\nEric holds a degree in Information Systems from Ohio State University and an MBA from Keller Graduate School of Management. He is a co-patent holder for an innovative obfuscation of PII used in print and digital composition and delivery.\r\n\r\nThroughout his career, Eric has demonstrated a passion for helping engineers grow and achieve their next level of professional development. His leadership and commitment to innovation have left a lasting impact for customers and organizations.",
      "tagLine": "KODE Health, Director of Software Engineering",
      "profilePicture": "https://sessionize.com/image/99fa-400o400o1-G8F9EZuthi63cCskH9sH5X.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/ericemartin1/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.linkedin.com/in/ericemartin1/recent-activity/all/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.kodehealth.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1127299
      ],
      "fullName": "Eric Martin",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus"
        }
      ]
    },
    {
      "id": "520bf4ca-b2d3-47c3-8475-c25bb2b257f7",
      "firstName": "Guy",
      "lastName": "Royse",
      "bio": "Guy works for Redis as a Developer Advocate. Combining his decades of experience in writing software with a passion for learning—and for sharing what he has learned—Guy explores interesting topics and spreads the knowledge he has gained around developer communities worldwide.\r\n\r\nTeaching and community have long been a focus for Guy. He ran a local JavaScript meetup in Ohio for more than a decade and has served on the selection committees of numerous conferences. He'll happily speak anywhere that will have him and has even has helped teach programming at a prison in Central Ohio.\r\n\r\nIn his personal life, Guy is a hard-boiled geek interested in role-playing games, science fiction, and technology. He also has a slightly less geeky interest in history and linguistics. He has an entire wall of role-playing games and science fiction books, speaks Spanish like a two-year old, and is a ham radio operator—callsign W8GUY.\r\n\r\nGuy lives in Ohio with his wife. His three sons are adults now and are all moved out. He is immensely proud of the men they have become.",
      "tagLine": "Developer Advocate at Redis",
      "profilePicture": "https://sessionize.com/image/a3ad-400o400o1-ra3ppxKk6zcw4d7WejbVhm.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/guyroyse",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/groyse",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://guyroyse.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://redis.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1127143
      ],
      "fullName": "Guy Royse",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Westerville"
        }
      ]
    },
    {
      "id": "83dd13b2-4171-47e4-bece-ebf60502b632",
      "firstName": "Jackie",
      "lastName": "Gleason",
      "bio": "Jackie Gleason is an experienced principal engineer for a property management startup named PurePM. Mr. Gleason has almost 20 years of experience in the Columbus area including Chase, NetJets, PUCO, OCLC and the Columbus Foundation. Jackie has presented previously at CodeMash, M3, and other local user groups on topics such as Java, Javascript, mobile development, testing and more. In addition to development Jackie enjoys 3D printing, billiards, and traveling. For more information or to reach out go to https://jackiergleason.com.",
      "tagLine": "THE Jackie Gleason",
      "profilePicture": "https://sessionize.com/image/8d0f-400o400o1-WDCUTq1g2H5foSNXicToKc.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/LifeIsTooShort",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jackie-gleason-5a52114/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://jackiergleason.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://thejackiegleason.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1128674
      ],
      "fullName": "Jackie Gleason",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus"
        }
      ]
    },
    {
      "id": "d06fd6a1-87cf-4d20-a5e0-2dd64c2039bb",
      "firstName": "Jamie",
      "lastName": "Dicken",
      "bio": "Jamie Dicken has worked across much of cybersecurity domain, including product security, AppSec, DevSecOps, security tooling and automation, and GRC. Prior to her transition into cybersecurity, she spent 8 years as a software engineer and technical manager at two Fortune 15 healthcare companies, where she focused on designing, building, and delivering new features to the market. Now Jamie focuses on protecting systems like the ones she used to build and transforming the ways that engineering teams and security professionals work together. Jamie is currently the Director of Security Platforms and Architecture at GitLab, leading Security Architecture, Security Research, and AppSec. She also freelances as a threat modeling instructor at Shostack + Associates.\r\n\r\nHer professional passions include leading high-performing teams, executing on high-profile strategic initiatives, championing employee growth and development, and mentoring others. Outside of work, Jamie has lots of adventures with her two boys and husband.  She enjoys crafting and spending time outdoors.\r\n",
      "tagLine": "Builder and Protector",
      "profilePicture": "https://sessionize.com/image/44c9-400o400o1-KrJ8DDBwwEaX3zkVTvSPWF.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jdicken/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@jamie_dicken",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        1138947
      ],
      "fullName": "Jamie Dicken",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH"
        }
      ]
    },
    {
      "id": "5698811a-4c31-4537-970d-e427009e0cca",
      "firstName": "Jay",
      "lastName": "Harris",
      "bio": "Jay is a speaker, software consultant, and owner of Arana Software. He has been developing on the web since 1995, when the Blink tag lured him away from Visual Basic 3, and has been awarded as a Microsoft Regional Director, ASPInsider, and Microsoft MVP. Recognizing that the greatest application performance bottleneck is a developer’s time, Jay’s continuing quest is for frameworks, modules, tools, and practices that make developers stronger, fitter, happier, and more productive.\r\n\r\n Jay resides in Las Vegas, USA. Follow him on Twitter at @jayharris.",
      "tagLine": "Problem Solver at Arana Software",
      "profilePicture": "https://sessionize.com/image/04b5-400o400o1-1a-4c31-4537-970d-e427009e0cca.79063233-9eb7-48b2-b374-7101223a309c.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://www.twitter.com/jayharris",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jasonharris/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://www.aranasoft.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1131005
      ],
      "fullName": "Jay Harris",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Las Vegas"
        }
      ]
    },
    {
      "id": "0dfa92b1-c9a1-4910-8e95-a31049f0665a",
      "firstName": "Jeffrey",
      "lastName": "Miller",
      "bio": "Jeffrey Miller is a Senior Technologist, Trainer, Speaker, Tech Lead, DevOps-CI/CD Tools Lead, Graph Data Explorer, and Second Brain Builder.\r\n\r\nJeffrey brings over 25 years of experience helping organizations to bring value to their customers through software. He presents a variety of tech and business topics at user groups and conferences.\r\n\r\nYou can find his writing on knowledge management and tech topics at https://knowledgeplaybook.com/.\r\n\r\nJeffrey and his wife, Brandy, live near Columbus, Ohio, and celebrate their roles as adoptive parents with a fun children’s book called \"Skeeters\" with proceeds supporting adoption. Learn more about the project at https://skeeterbooks.com/adoption/.",
      "tagLine": "Technologist, Speaker, Author",
      "profilePicture": "https://sessionize.com/image/e283-400o400o1-wkqqor3X63ekEykbRRnw8c.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/xagronaut",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/jamiller",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://knowledgeplaybook.com/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        1131041
      ],
      "fullName": "Jeffrey Miller",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH"
        }
      ]
    },
    {
      "id": "137fb55c-d120-4a6b-9e15-98123df17302",
      "firstName": "Joseph",
      "lastName": "Guadagno",
      "bio": "Joe Guadagno has been writing software for over 30 years, has been an active member of the .NET community, formerly serving on the .NET Foundation Board of Directors, as President, and has been a Microsoft MVP in .NET for more than 15 years. He has spoken through the United States and international events on topics ranging from Microsoft .NET, Microsoft Azure, Ionic, Bootstrap, and many others. You can see the complete list at https://www.josephguadagno.net/presentations. When not sitting at a computer, Joe loves to hang out with his family and play games. When not playing games with the family, Joe is checking out the latest in Home Automation. You can connect with Joe on Bluesky at @jguadagno.com, Facebook at JosephGuadagnoNet, and on his blog at https://www.josephguadagno.net",
      "tagLine": "Microsoft \"Developer Services\" MVP, Progress Telerik Champion, and Organizer of Desert Code Camp",
      "profilePicture": "https://sessionize.com/image/a114-400o400o1-3tev7cMVvNUmgJZveNqbpX.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://www.twitter.com/jguadagno",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/josephguadagno/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.josephguadagno.net",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.josephguadagno.net",
          "linkType": "Company_Website"
        },
        {
          "title": "Bluesky",
          "url": "https://bsky.app/profile/jguadagno.com",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1129012
      ],
      "fullName": "Joseph Guadagno",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Phoenix, AZ"
        }
      ]
    },
    {
      "id": "3d9afdca-043f-4a20-820c-f25ef3e85c1a",
      "firstName": "Kate",
      "lastName": "Holterhoff",
      "bio": "Kate Holterhoff, an industry analyst with RedMonk, has a background in frontend engineering, academic research, and technical communication. Kate comes to RedMonk from the digital marketing sector and brings with her expertise in frontend engineering, QA, accessibility, and scrum best practices.\r\n\r\nBefore pursuing a career in the tech industry Kate taught writing and communication courses at several East Coast universities. She earned a PhD from Carnegie Mellon in 2016 and was awarded a postdoctoral fellowship (2016-2018) at Georgia Tech, where she is currently an affiliated researcher.",
      "tagLine": "RedMonk",
      "profilePicture": "https://sessionize.com/image/17cf-400o400o1-SzRZf9EesD647sn1tD3V5S.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/KateHolterhoff",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kateholterhoff/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://redmonk.com/kholterhoff/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://redmonk.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1143160
      ],
      "fullName": "Kate Holterhoff",
      "categoryItems": [
        432501
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Atlanta, GA"
        }
      ]
    },
    {
      "id": "44406a2e-5504-47d4-8fef-6d5c110704a0",
      "firstName": "Kathryn",
      "lastName": "Grayson Nanz",
      "bio": "In 2013, I graduated with a BFA and took my first job as a Junior Graphic Designer at a small, boutique ad agency. While there, my Creative Director warned me to never let anyone find out I could code, because if I did I'd be stuck doing it forever. I ignored his warning; it turns out he was completely right, but I've never been happier. \r\n\r\nI currently work as a developer advocate on a wonderful team where I help people build web applications in React, design and maintain their UI component libraries, and desperately attempt to stop back-end devs from writing any more CSS.",
      "tagLine": "UI Designer & Front-end Developer",
      "profilePicture": "https://sessionize.com/image/5c0a-400o400o1-VtRqBrXs52D45KWN5WgwxL.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/kathryngrayson",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kathryngrayson/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://kgrayson.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.telerik.com/kendo-ui",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1120202,
        1120206
      ],
      "fullName": "Kathryn Grayson Nanz",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Asheville, NC "
        }
      ]
    },
    {
      "id": "b765d60f-4717-4116-b9f2-002c8a10bd88",
      "firstName": "Kelly",
      "lastName": "Morrison",
      "bio": "Kelly Morrison is a native of Georgia with a BS in mathematics and a PhD in computer engineering. He has over 30 years of software experience in various industries, including the television, education, retail, and agriculture sectors. He also wrote a monthly column for \"Digital Output\" magazine under the pen name \"Armand Tarantino\". He is currently employed as a solutions architect at CGI.",
      "tagLine": "Solutions Architect at CGI / PhD in Computer Engineering",
      "profilePicture": "https://sessionize.com/image/dd09-400o400o1-9tsRrS5quwEQ2sTcBph9gU.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://x.com/softwareriot",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kellyivymorrison/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        1131023
      ],
      "fullName": "Kelly Morrison",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Savannah, Georgia"
        }
      ]
    },
    {
      "id": "53ac8546-b51e-4755-8d18-67c519a981c0",
      "firstName": "Ken",
      "lastName": "Versaw",
      "bio": "I am an Asp.Net Insider and a Software Engineering Manager with over 22 years of software development experience. I am also active in the regional software development community, organizing a monthly software development meetup (Lincoln.Code) and 3 annual software development conferences (Nebraska.Code, Prairie.Code, and Indy.Code). ",
      "tagLine": "Software Engineering Manager - Nelnet Business Solutions",
      "profilePicture": "https://sessionize.com/image/489e-400o400o1-T53WQjwinCfy8n7HN2k8d6.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/kversaw1",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kversaw",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://nebraskacode.amegala.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1126556
      ],
      "fullName": "Ken Versaw",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Nebraska"
        }
      ]
    },
    {
      "id": "b699d89f-f1d6-4fd5-be01-2594a950f55d",
      "firstName": "Kevin",
      "lastName": "Grossnicklaus",
      "bio": "Kevin started developing software in 1985 at the age of 10 when his new Apple IIgs booted to a command prompt and he didn't know what else to do with it.   He is now the president of a St. Louis, Missouri based development firm called ArchitectNow (www.architectnow.net).  At ArchitectNow, Kevin and his team specialize in a wide variety of tools and technologies while delivering applications across a variety of cloud and mobile platforms.   He is an avid Telecaster player, fly fisherman, home brewer, and gamer (including everything from retro arcade games, to board games, to role playing games).  When not spending time on any of those hobbies he waits patiently for a second season of Firefly.",
      "tagLine": "President, ArchitectNow",
      "profilePicture": "https://sessionize.com/image/1643-400o400o1-WfLVM1hTkar3BZNSM9rYP5.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "http://twitter.com/kvgros",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kvgros/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://www.architectnow.net/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.architectnow.net",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1119405
      ],
      "fullName": "Kevin Grossnicklaus",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "St. Louis, MO"
        }
      ]
    },
    {
      "id": "b6e26226-8a65-46e7-9538-d0924f53d895",
      "firstName": "Lance",
      "lastName": "Finney",
      "bio": "After more than a decade focused on the Java desktop world, I've been in the Angular/JavaScript/TypeScript space since 2014.\r\n\r\nAs an Angular Google Developer Expert, I develop Angular projects and mentor junior Angular developers on my projects, and I used to be an instructor with Angular Boot Camp. Father of two, software developer, and world traveler (when I can sneak it in).",
      "tagLine": "Angular Developer and Instructor",
      "profilePicture": "https://sessionize.com/image/2e8c-400o400o1-GkU4FL6QoA2dns4fwJF7gE.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "http://twitter.com/LMFinneyCoder",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/lmfinney/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://lmfinney.wordpress.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://www.inficon.com/en",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1121367
      ],
      "fullName": "Lance Finney",
      "categoryItems": [
        432501
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "St. Louis, Missouri, USA (STL)"
        }
      ]
    },
    {
      "id": "bb52359f-7de5-4ab4-be0c-e0fdf39b7134",
      "firstName": "Matt \"Kelly\"",
      "lastName": "Williams",
      "bio": "Matt \"Kelly\" Williams is the founder of Making Software Greener, the CEO  of the Sustainable IT Manifesto Foundation, advisory board member for the Green Computing Foundation, and a speaker and mentor on IT practices including DevOps, Cloud Computing, and mental health advocacy. He has always wanted to be a Renaissance person; perhaps one day he will be. In the meantime, he explores IT Sustainability, is learning photography, designs tabletop games, reads, weaves, cooks, hacks, and explores the mountains near Loveland, Colorado.",
      "tagLine": "Sustainable IT Innovator Championing Agile Sustainability & Green Tech | | CEO of Sustainable IT Manifesto Foundation | International Speaker | Advisory Board Member",
      "profilePicture": "https://sessionize.com/image/dbee-400o400o1-WJ9SgktJqoE3kwVoZBtd8a.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "http://twitter.com/matt_k_williams",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/mattkwilliams/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://matthewkwilliams.com",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://makingsoftwaregreener.com",
          "linkType": "Company_Website"
        },
        {
          "title": "Sustainable IT Manifesto",
          "url": "https://sustainableitmanifesto.org",
          "linkType": "Other"
        },
        {
          "title": "BlueSky",
          "url": "https://bsky.app/profile/mkellywilliams.bsky.social",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1128028
      ],
      "fullName": "Matt \"Kelly\" Williams",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Loveland, CO"
        }
      ]
    },
    {
      "id": "17c299ee-d9fd-4020-b499-2837b2b3a2bf",
      "firstName": "Matthew-Hope",
      "lastName": "Eland",
      "bio": "An AI Specialist and Wizard at Leading EDJE who is known to teach software engineering, AI, and data science concepts in the most ridiculous ways possible. Matt has used machine learning to settle debates over whether Die Hard is a Christmas movie, reinforcement learning to drive the behavior of digital squirrels, data analytics to suggest improvements to his favorite TV show, and AI agents to play board games and create an AI agent with the personality of a dog. Matt is the author of \"Data Science in .NET with Polyglot Notebooks\" and \"Refactoring with C#\" as well as several LinkedIn Learning courses. Matt helps organize the Central Ohio .NET Developer Group, runs several blogs and a YouTube channel, has a Master’s of Science in Data Analytics, and is a current Microsoft MVP in AI and .NET.",
      "tagLine": "Wizard at Leading EDJE",
      "profilePicture": "https://sessionize.com/image/a665-400o400o1-7NGiz9KaduJtrqHefWg6B1.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/IntegerMan",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/matteland/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://MattOnML.NET",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://LeadingEDJE.com",
          "linkType": "Company_Website"
        },
        {
          "title": "Portfolio",
          "url": "https://MattEland.dev",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1124045
      ],
      "fullName": "Matthew-Hope Eland",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Local"
        }
      ]
    },
    {
      "id": "0a6a65cd-0f7c-4490-8168-3ac1d1f0c869",
      "firstName": "Michelle",
      "lastName": "Smith",
      "bio": "Dr. Michelle Smith’s unusual background gives her a fresh perspective on the tech industry and what it takes to build and keep great teams.  She is a veterinarian by education, and she still practices in the State of Ohio.  She’s also been an executive at a global software company and an active leader in her local community.  But her real passions are entrepreneurship and building successful organizations.  Along with her husband and business partner, Steve Smith, Michelle has built and sold several technology companies.  Michelle and her current team (which include several alumni from previous companies!) work with organizations to help them not only improve the quality of their code, but their overall teamwork.",
      "tagLine": "Builder of Great Teams",
      "profilePicture": "https://sessionize.com/image/dae0-400o400o1-VZ3TL5yxvcZKJqjVZ2yHyP.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/mickeyme",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/michellesmith6/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Company Website",
          "url": "https://nimblepros.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1130802
      ],
      "fullName": "Michelle Smith",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Kent, Ohio"
        }
      ]
    },
    {
      "id": "4de5c215-2eab-4a2d-bb3b-55817c56f01a",
      "firstName": "Paul",
      "lastName": "Chin Jr.",
      "bio": "Paul Chin Jr is a Hampton Roads native and a curious human. He is passionate about exploring technology, art, and business. He advocates for making technology accessible and growing communities to help one another. He has created new markets, guided start-up validations, and architected enterprise platforms. The future is amazing, and he can't wait to help you build it.\r\n",
      "tagLine": "Curious Human who loves Automation, Food, & Business. ",
      "profilePicture": "https://sessionize.com/image/44a5-400o400o1-KHrZFYiCoggBhis5uvsiSW.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/paulchinjr",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.linkedin.com/in/paulchinjr/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://serverlessguru.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1126337
      ],
      "fullName": "Paul Chin Jr.",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Virginia Beach, VA"
        }
      ]
    },
    {
      "id": "48167b9e-8862-4e6c-9bc9-17b89e0baaf6",
      "firstName": "Roxy",
      "lastName": "Rodriguez-Becker",
      "bio": "Roxy Rodriguez-Becker is a freelance web developer with a background in math education and library science. She created the Tube Feed Tracker PWA for a niche part of the medical community to help thousands of families around the world. Roxy is a Cuban American mother of 3 living in Houston, Texas. She enjoys working out, doing handstands, listening to tech podcasts, and is looking for her next role in tech. ",
      "tagLine": "software engineer, developer advocate, and community leader",
      "profilePicture": "https://sessionize.com/image/d60c-400o400o1-Qvkkz9i6DodvgErt4EsqXu.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/RoxanaCodes",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/roxana-rodriguez-becker",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        1120953
      ],
      "fullName": "Roxy Rodriguez-Becker",
      "categoryItems": [
        432501
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Houston, Texas"
        }
      ]
    },
    {
      "id": "fc1d0cd3-9675-4188-aa98-e0088069f1a4",
      "firstName": "Sam",
      "lastName": "Basu",
      "bio": "Sam Basu is a technologist, author, speaker, Microsoft MVP and Lead Developer Advocate for Uno Platform. With a long developer background, he now spends much of his time advocating modern development platforms & AI tools for cross-platform technology stacks. His spare times call for travel, fast cars, cricket and culinary adventures. You can find him on the internet.",
      "tagLine": "Lead Developer Advocate",
      "profilePicture": "https://sessionize.com/image/9947-400o400o1-d3-9675-4188-aa98-e0088069f1a4.0788eacd-acef-44d2-868e-cf111b1f2516.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/samidip",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/sam-basu-332247394/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://samidipbasu.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://platform.uno/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1126959
      ],
      "fullName": "Sam Basu",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Erie PA"
        }
      ]
    },
    {
      "id": "62b5c0da-ecfa-4566-8ce2-4eeb8e2d321d",
      "firstName": "Samuel",
      "lastName": "Gomez",
      "bio": "I've worked in software development for 15+ years (mostly Microsoft technologies) and love the problem solving aspect of the work. In recent years I have become very passionate about AI and machine learning technologies and how they can be applied to different aspects of our lives. When not coding I enjoy spending time with my family, soccer (watching, playing, and coaching), playing videogames and watching movies. ",
      "tagLine": "Microsoft MVP and Head of AI at Geneca",
      "profilePicture": "https://sessionize.com/image/b9e8-400o400o1-K6649gMDEzkWxFkUQLE8Bm.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/thesoccerdev",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/samueljgomez/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://www.thesoccerdev.com/",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://geneca.com/",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1130675
      ],
      "fullName": "Samuel Gomez",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH. United States."
        }
      ]
    },
    {
      "id": "9bde9de9-7bcb-4077-8087-47bf492a1344",
      "firstName": "Sarah",
      "lastName": "Dutkiewicz",
      "bio": "Sadukie is a tech polyglot who brings code to life and helps others unlock their potential through teaching and mentorship. As a seasoned software architect with a sharp eye for user experience, she makes it easy for developers to pick up new tools and hit the ground running. When technical roadblocks pop up, she’s the one who clears the path—breaking down complex ideas and helping teams communicate more effectively. A natural connector and strong community advocate, Sadukie loves bringing people together across the tech world. Whether she’s mentoring, speaking, or juggling life as a full-time mom, her mission stays the same: to make tech more approachable and spark confidence in every coder’s journey.",
      "tagLine": "Wife, mom, techie - 100% me, unapologetically",
      "profilePicture": "https://sessionize.com/image/c819-400o400o1-hBX495aDgfA7dLm7BQV5pb.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/sadukie",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://sadukie.com",
          "linkType": "Blog"
        },
        {
          "title": "GitHub",
          "url": "https://sadukie.github.io",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1124736
      ],
      "fullName": "Sarah Dutkiewicz",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Stow, OH"
        }
      ]
    },
    {
      "id": "01782d24-b1aa-4645-a9f5-a15e51bf132c",
      "firstName": "Todd",
      "lastName": "Nussbaum",
      "bio": "With a career spanning two and a half decades, Todd has worn nearly every hat in the SDLC—from dev and architect to engineering leader. He is a firm believer that great software requires both a foundation of clean architecture and sensible UI design. Off the clock, Todd can be found tinkering with the newest open source library or AI app, and often trades the keyboard for the sidelines, following his sons' college journeys, timing his daughter’s laps at the pool, and acting as the primary support crew for his wife’s running goals.",
      "tagLine": "Director, Consulting Services @ CGI",
      "profilePicture": "https://sessionize.com/image/4c2d-400o400o1-9ZebybpFDukXXULUiSYtJX.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tjnussbaum/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        1130920
      ],
      "fullName": "Todd Nussbaum",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Plain City, Ohio"
        }
      ]
    },
    {
      "id": "c53b081c-6035-47f5-a606-91e83963556b",
      "firstName": "Tristan",
      "lastName": "Chiappisi",
      "bio": "With over a decade and a half of programming and working with data, I have a passion for anything related to the subject. If it has something to do with technology, I'm in.\r\n\r\nBeyond my professional realm, I'm a dad to a vibrant crew of young adventurers. Together, we seek out outdoor thrills, from skiing to biking, in my perpetual quest to earn the 'cool dad' badge.",
      "tagLine": "Principal Data Architect - Cetera",
      "profilePicture": "https://sessionize.com/image/8aa0-400o400o1-RDgwKQFYtCrDmAPVecnwQ5.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tristanchiappisi/",
          "linkType": "LinkedIn"
        }
      ],
      "sessions": [
        1127647,
        1127657
      ],
      "fullName": "Tristan Chiappisi",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus"
        }
      ]
    },
    {
      "id": "d98ac233-d319-45ab-9729-41f7c4ae2a62",
      "firstName": "Valarie",
      "lastName": "Regas",
      "bio": "Valarie Regas is a DevOps fanatic, a Georgia Tech coding bootcamp graduate, and a veteran mommy. She holds a BA in Psychology and currently works in Computer Science education. After years being a stay-at-home mom, she decided to change her life by entering tech, and has learned a lot along the way. Outside of work, she enjoys mixed martial arts fighting, table-top role playing games, public speaking, creating tiny humans, and activism of all sorts.",
      "tagLine": "DevOps, Advocacy, and Human Interest",
      "profilePicture": "https://sessionize.com/image/d1d3-400o400o1-swfigjHbpyg9v2JbJQKEVd.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/ValarieRegas",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/valarieregas/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@valarieregas",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://valarieregas.com",
          "linkType": "Company_Website"
        },
        {
          "title": "Speaking Profile - Notist",
          "url": "https://noti.st/valarieregas",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1120566
      ],
      "fullName": "Valarie Regas",
      "categoryItems": [
        432500
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Atlanta, Georgia, USA"
        }
      ]
    },
    {
      "id": "ac76d40e-1703-43ab-8b89-9402befdf3b1",
      "firstName": "Victor",
      "lastName": "Frye",
      "bio": "Victor Frye is a developer who thrives at the intersection of technical problem-solving and creative innovation. As a Senior Software Engineer and DevOps specialist at Leading EDJE, he specializes in .NET application development, Azure cloud infrastructure, and DevOps automation, with a focus on modernization and developer productivity. The self-proclaimed number one Clippy fan, he brings a playful yet efficient approach to his work. Beyond the keyboard, Victor is an active member of the Grand Rapids developer community, always eager to share insights and explore emerging technologies. During his free time, he can be found exploring fantasy worlds—in pages or pixels—or spending quality time with his wife and two dogs. Fueled by coffee and curiosity, Victor is always ready for the next challenge.",
      "tagLine": "Your friendly neighborhood developer",
      "profilePicture": "https://sessionize.com/image/5b29-400o400o1-a3EA1GzQh3riPrisRHKwG5.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/victorfrye",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://victorfrye.com/blog",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://leadingedje.com/",
          "linkType": "Company_Website"
        },
        {
          "title": "BlueSky",
          "url": "https://bsky.app/profile/victorfrye.com",
          "linkType": "Other"
        },
        {
          "title": "Threads",
          "url": "https://www.threads.net/@thevictorfryeadventure",
          "linkType": "Other"
        },
        {
          "title": "Portfolio",
          "url": "https://victorfrye.com/",
          "linkType": "Other"
        }
      ],
      "sessions": [
        1120257
      ],
      "fullName": "Victor Frye",
      "categoryItems": [
        432501
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Grand Rapids MI "
        }
      ]
    },
    {
      "id": "11fbf1c5-b0fc-42eb-a027-4fea2e54bb12",
      "firstName": "Vitaliy",
      "lastName": "Matiyash",
      "bio": "Vitaliy Matiyash is Software Engineer from Columbus, Ohio, working on both front end and back end technologies with focus on web accessibility, Java and microservices. In his spare time he enjoys working on various DIY projects, biking, hiking Central Ohio trails and cooking from scratch.",
      "tagLine": "Staff Software Engineer, Builder, Problem Solver.",
      "profilePicture": "https://sessionize.com/image/a45d-400o400o1-UQKYbsP5udCreAyU5df2CV.jpg",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/vitaliymatiyash",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/VitaliyMatiyash/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "http://vitaliymatiyash.com/",
          "linkType": "Blog"
        }
      ],
      "sessions": [
        1121847,
        1121838
      ],
      "fullName": "Vitaliy Matiyash",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH"
        }
      ]
    },
    {
      "id": "88b7259a-70ff-4438-a85a-16d87363f3e2",
      "firstName": "William",
      "lastName": "Klos",
      "bio": "Bill got his start building monolithic applications on monolithic hardware.  Literally.  The AS/400s of the day were tall, matte black, and had an ominous “hum” about them.  Since then, he has moved steadily towards more distributed pursuits.  Today, Bill works primarily in AI, the cloud across multiple platforms, and specializes in IoT/distributed architectures.  He also believes watching the data streams directly is more satisfying than what any UI has to offer.",
      "tagLine": "Architect and Chief Golang Advocate for CapTech Consulting",
      "profilePicture": "https://sessionize.com/image/80fd-400o400o1-W7X2SFpSG8rAwv3ZUmwU5T.png",
      "isTopSpeaker": false,
      "links": [
        {
          "title": "X (Twitter)",
          "url": "https://twitter.com/williamklos",
          "linkType": "Twitter"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/wjklos/",
          "linkType": "LinkedIn"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@williamklos",
          "linkType": "Blog"
        },
        {
          "title": "Company Website",
          "url": "https://captechconsulting.com",
          "linkType": "Company_Website"
        }
      ],
      "sessions": [
        1130963
      ],
      "fullName": "William Klos",
      "categoryItems": [
        432499
      ],
      "questionAnswers": [
        {
          "questionId": 119284,
          "answerValue": "Columbus, OH"
        }
      ]
    }
  ],
  "questions": [
    {
      "id": 118563,
      "question": "Have you presented this talk before?",
      "questionType": "Checkbox",
      "sort": 1
    },
    {
      "id": 118564,
      "question": "If so, where?",
      "questionType": "Short_Text",
      "sort": 2
    },
    {
      "id": 119284,
      "question": "Where are you traveling from?",
      "questionType": "Short_Text",
      "sort": 16
    }
  ],
  "categories": [
    {
      "id": 118560,
      "title": "Track",
      "items": [
        {
          "id": 431274,
          "name": "Application Development",
          "sort": 1
        },
        {
          "id": 431275,
          "name": "Architecture & Platform Engineering",
          "sort": 2
        },
        {
          "id": 431276,
          "name": "Artificial Intelligence & Machine Learning",
          "sort": 3
        },
        {
          "id": 431277,
          "name": "Data Engineering & Analytics",
          "sort": 4
        },
        {
          "id": 431278,
          "name": "Product Design & User Experience",
          "sort": 5
        },
        {
          "id": 431279,
          "name": "Professional Growth & Leadership",
          "sort": 6
        },
        {
          "id": 431280,
          "name": "Security & Privacy Engineering",
          "sort": 7
        },
        {
          "id": 431281,
          "name": "Software Quality & Delivery",
          "sort": 8
        },
        {
          "id": 431282,
          "name": "Other",
          "sort": 9
        }
      ],
      "sort": 0,
      "type": "session"
    },
    {
      "id": 119611,
      "title": "Do you require travel assistance?",
      "items": [
        {
          "id": 432499,
          "name": "No, I'm good!",
          "sort": 1
        },
        {
          "id": 432500,
          "name": "No, but it would help",
          "sort": 2
        },
        {
          "id": 432501,
          "name": "Yes, required for me to be at Stir Trek",
          "sort": 3
        }
      ],
      "sort": 19,
      "type": "speaker"
    }
  ],
  "rooms": []
}