[
    {
        "FirstName": "Adam",
        "LastName": "Pasternack",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--3af1c412-9801-44ed-8b1c-31360f23c731-636553214174552299.jpg",
        "UserName": "AdamPasternack",
        "Biography": "Adam Pasternack is a life-long adventurer who is insatiably curious.  He enjoys making ideas into reality, and sharing the things he has learned with others at user-groups and conferences.  Currently a consultant at Improving, he is well versed in application development.  Javascript and front end frameworks have been a special interest over the past couple years.  Currently Adam is deepening his interests in Machine Learning and Data Pipelining through a MS in CS in Machine Learning through Udacity and Georgia Tech.  Adam helps run the Central Ohio .Net Developers group and is the co-leader of the Columbus Angular meetup.  Outside of code, his passions include skiing, cooking, epic hikes, and philosophy.  Connect with him on twitter @AJPasternack.",
        "WebSite": null,
        "Company": null,
        "Title": "Consultant - Improving",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:37.457"
    },
    {
        "FirstName": "Angel",
        "LastName": "Thomas",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--518b1a42-b205-439b-90e8-ae2e888b8828-636553214178600185.jpg",
        "UserName": "AngelThomas",
        "Biography": "Angel is a founder and chapter leader for the Toledo chapter of Girl Develop It. She works as a software developer for Center for Information Management in Ann Arbor, Michigan. When she is not busy with work and family, she enjoys helping others to develop a love for code.",
        "WebSite": null,
        "Company": null,
        "Title": "Software Developer",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:37.86"
    },
    {
        "FirstName": "Anna",
        "LastName": "Heiermann",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--8c368373-bba1-436b-b25d-7eedce206569-636553214183073375.jpg",
        "UserName": "AnnaHeiermann",
        "Biography": "Anna Heiermann brings 10 years of experience in leading Test Teams in Higher Education, Nutrition, Insurance, Energy and Aviation industries. Outside of the QA world, Anna enjoys cooking, power lifting, and mini weekend roadtrips. She loves living the country life on a couple of acres with her husband and two crazy dogs, Chloe (Boston Terrier) and Lola (a boxer with a bad case of FOMO).",
        "WebSite": null,
        "Company": null,
        "Title": "Senior Consultant, HMB",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:38.307"
    },
    {
        "FirstName": "Barry",
        "LastName": "Tarlton",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--7d272674-a6fe-47a7-8072-576d09a31dde-636553214187866787.jpg",
        "UserName": "BarryTarlton",
        "Biography": " Barry is passionate about learning, problem solving, and teaching.  He believes that software developers are problem solvers at heart and the languages and platforms we work with are simply the tools in our utility belts.  Barry can often be found trying to inspire and educate others both inside and outside of work. Whether he's MacGyver'ing IOT solutions together or leading a hackathon team, he loves innovating and constantly trying new things.",
        "WebSite": null,
        "Company": null,
        "Title": "MacGyver like Problem Solver and Tech Teacher!",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:38.787"
    },
    {
        "FirstName": "Benjamin",
        "LastName": "Bykowski",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--7aa3797d-ca47-4c76-9711-e75fe66d1400-636553214192274927.jpg",
        "UserName": "BenjaminBykowski",
        "Biography": "Hailing from a small island in Lake Erie, Ben spent his formative years accompanying his father to work at the local arcade, learning to roll quarters and play Pac-Man and pinball. So it was no surprise that he developed an affinity for technology early on that eventually culminated in a degree in computer science and engineering. A life-long fan of fantasy and science fiction, he parlayed his coding skills and penchant for storytelling into the applied application of user experience on the Web. Nowadays Ben can be found practicing appreciative inquiry and information architecture, taking the time to speak, coach, and teach on these subjects whenever possible. His wife keeps him grounded while indulging his fancy for gadgets, geek culture, and Game of Thrones and together they do their best to raise their three boys.",
        "WebSite": null,
        "Company": null,
        "Title": "Manager and Tech Enthusiast at Hyland Software",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:39.227"
    },
    {
        "FirstName": "Bill",
        "LastName": "Sempf",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--8d479f1d-a778-4c0e-a282-24b4f56098d7-636553214196663052.jpg",
        "UserName": "BillSempf",
        "Biography": "Bill Sempf is a software security architect. His breadth of experience includes business and technical analysis, software design, development, testing, server management and maintenance, and security. In his 20 years of professional experience he has participated in the creation of well over 200 applications for large and small companies, managed the software infrastructure of two Internet service providers, coded complex software happily in every environment imaginable, tested the security of all natures of applications and APs, and made mainframes talk to cell phones. He is the author of C# 5 All in One for Dummies and Windows 8 Programming with HTML5 For Dummies; a coauthor of Effective Visual Studio.NET and many other books, a frequent contributor to industry magazines; and has recently been an invited speaker for the ACM and IEEE, BlackHat, CodeMash, DerbyCon, BSides, DevEssentials, the International XML Web Services Expo and the Association of Information Technology Professionals. Bill also serves on the board of the Columbus branch of the Open Web Application Security Project, and is the Administrative Director of Locksport International.",
        "WebSite": null,
        "Company": null,
        "Title": "Application Security Architect",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:39.667"
    },
    {
        "FirstName": "Bobby",
        "LastName": "Grayson",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--804d2391-3dbb-421e-8b70-7435ea9e0f2e-636553214201536524.png",
        "UserName": "BobbyGrayson",
        "Biography": "Bobby is a person, comic, and software developer based in New York City. He enjoys grilled cheese sandwiches. He also enjoys building things with Elixir, Ruby, Python, and JavaScript.",
        "WebSite": null,
        "Company": null,
        "Title": "Software Developer/Cautionary Tale, Stella Service",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:40.153"
    },
    {
        "FirstName": "Brandon",
        "LastName": "Bruno",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--7474c984-faee-4181-98df-6db183e91ace-636553214207525790.jpeg",
        "UserName": "BrandonBruno",
        "Biography": "Brandon has been hacking away at code since a dusty Commodore 64 appeared from his parents' attic in the early 90's, but has spent the last ten years building client solutions in .NET, JavaScript, and Sitecore. He is currently a Senior Technical Consultant at Perficient and focuses on solution architecture, content management, app security, and dodging Atlanta traffic.",
        "WebSite": null,
        "Company": null,
        "Title": "Senior Technical Consultant at Perficient Digital",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:40.753"
    },
    {
        "FirstName": "Brett",
        "LastName": "Koenig",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--9d07be6f-9140-487c-895c-2ed51f4670d5-636553214211703778.jpg",
        "UserName": "BrettKoenig",
        "Biography": "Brett is a consultant with HMB and has been making websites for more than 5 years. In software his main interests lie on the front-end and how it can be used to bring ideas into reality and in emerging technologies and how they can be used to solve problems.\r\n\r\nOutside of the office, you can find him and his wife cheering on the Buckeyes in about any sport possible or pursuing their fledgling dreams of being world-traveling outdoorsmen.",
        "WebSite": null,
        "Company": null,
        "Title": "Consultant @ HMB",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:41.17"
    },
    {
        "FirstName": "Chad",
        "LastName": "Green",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--d8d11629-81a4-4042-8405-30665ff67e49-636553214215791680.jpg",
        "UserName": "ChadGreen",
        "Biography": "Chad Green is a manager, software developer, architect, community leader, and most importantly a father and husband. Chad works as the Data & Solution Architect for ProgressiveHealth where he manages the application development team which is responsible for crafting software solutions for the various company affiliates located across the country, which provides health and wellness solutions in the healthcare and industrial service settings. Over the years, Chad has managed groups from 5 to 63 people and worked on projects in a wide range of markets including healthcare, military, government, workforce management, financial services, chemical research, and electronic commerce.\r\n\r\nOne of the ways Chad has kept up with technology and development practices is by attending user groups and software development events throughout the country. Being a big believer in giving back and wanting to ensure that there are cool events for other software development professionals, Chad founded and chairs the annual Code PaLOUsa conference, organizes the Louisville .NET Meetup user group and the Monthly Tech Leader Coffee and Discussion, and has helped with other groups like the Louisville Tech Ladies and events like Cincy Day of Agile. Chad also speaks at user groups and conferences about .NET development, VSTS, and leadership.",
        "WebSite": null,
        "Company": null,
        "Title": "Data & Solution Architect at ProgressiveHealth",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:41.58"
    },
    {
        "FirstName": "Chris",
        "LastName": "DeMars",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--39f2a643-26a3-409c-8ebf-4bda096ffbee-636553214220069730.jpg",
        "UserName": "ChrisDeMars",
        "Biography": "Chris DeMars is a UI developer first, UX architect always, working out of Detroit, Michigan. Chris is also an instructor, teacher assistant, and volunteer for the Ann Arbor and Detroit chapters of Girl Develop It. Chris loves coming up with solutions for enterprise applications, which include modular CSS architectures, performance, and advocating for Web accessibility. When he is not working on making the Web great and inclusive you can find him writing blog posts, watching horror movies, drinking the finest of beers, or in the woods of northern Michigan.",
        "WebSite": null,
        "Company": null,
        "Title": "Senior UI Developer",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:42.007"
    },
    {
        "FirstName": "Craig",
        "LastName": "Stuntz",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Craig-Stuntz-e19ff752-1102-4aa9-8921-63ee9d5dfd7b-636553214224432841.jpg",
        "UserName": "craigstuntz",
        "Biography": "Craig Stuntz is a software engineer and a lifelong student of computer science, with specific interests in programming languages, type theory, compilers, and math. He is Technical Director for Improving in Columbus, Ohio, and cofounded the Columbus branch of Papers We Love, a reading group for people interested in academic computer science research. In the past year he has presented talks at CodeMash, OWASP, Dog Food Conference, Stir Trek, and many user groups.\r\n\r\nWhen not at work or playing with his kids, he is usually studying math or playing Irish traditional music on the tin whistle and wooden flute.",
        "WebSite": "http://www.craigstuntz.com/",
        "Company": "Improving",
        "Title": "Technical Director, Improving Columbus",
        "Twitter": "@craigstuntz",
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": "https://github.com/CraigStuntz/",
        "LastUpdated": "2018-02-27T09:43:42.443"
    },
    {
        "FirstName": "Dave",
        "LastName": "Wasmer",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--051af337-289b-4e25-ba22-dbd614de9a31-636553214228345626.jpg",
        "UserName": "DaveWasmer",
        "Biography": "Creator of @denali_js, Ember.js & Node developer, product craftsman, economist, sailor, husband, father, follower of Christ.",
        "WebSite": null,
        "Company": null,
        "Title": "Developer & UX Craftsman @ Echobind",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:42.833"
    },
    {
        "FirstName": "David",
        "LastName": "Neal",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--8f7734c3-f494-400c-ab8b-25be836c06df-636553214232868855.jpg",
        "UserName": "DavidNeal",
        "Biography": "David is a family man, musician, motorcyclist, and Microsoft MVP living in North Georgia, USA. He runs on a high-octane mixture of caffeine and bacon.",
        "WebSite": null,
        "Company": null,
        "Title": "Fueled by Bacon",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:43.287"
    },
    {
        "FirstName": "Dennis",
        "LastName": "Dunn",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Dennis-Dunn-7dfe82dd-4c0e-4298-9ade-48c4c1531983-636553214236876709.png",
        "UserName": "dennis.dunn",
        "Biography": "On his third career as a dark-matter hacker, Dennis has written code for academia, state government, and the private sector. As a polyglot, he has coded in languages that have long since died out as well as more obscure tongues such as TCL. He finds parser combinators fascinating and when not engaging with the field of computer science you will find him sleeping. He enjoys science fiction, paragliding, and Catan.",
        "WebSite": null,
        "Company": null,
        "Title": "Serial hobbyist",
        "Twitter": "@ansofive",
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": "https://github.com/dennisdunn",
        "LastUpdated": "2018-02-27T09:43:43.687"
    },
    {
        "FirstName": "Drew",
        "LastName": "Furgiuele",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Drew-Furgiuele-04bfa541-95cb-4e1f-9c0e-fb00b4589aa7-636553214242405653.jpg",
        "UserName": "pittfurg",
        "Biography": "Drew is a Senior Database Administrator at IGS, and has been working with the Microsoft Data Platform for over 15 years. When he's not accidentally dropping tables in production, he enjoys helping developers and analysts write faster and more efficient queries, using PowerShell to automate himself, and messing around creating IoT devices, including trying to send SQL Server to the edge of space for the High Altitude SQL Server Project (HASSP). \r\n\r\nDrew's presented on topics for Brent Ozar's online conference and training sessions, and he's even a major contributor to the awesome open source PowerShell toolkit for DBAs: dbatools (https://dbatools.io/). \r\n\r\nOutside of work, he enjoys blogging, traveling, speaking, CrossFit, and hearing people try to pronounce his last name. He loves his dog more than he loves anything or anyone else, and isn't ashamed of his Spotify playlist.",
        "WebSite": "http://www.port1433.com",
        "Company": "IGS",
        "Title": "Senior DBA, IGS",
        "Twitter": "@pittfurg",
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": "https://www.linkedin.com/in/pittfurg/",
        "GitHub": "https://github.com/drewfurgiuele",
        "LastUpdated": "2018-02-27T09:43:44.24"
    },
    {
        "FirstName": "Ed",
        "LastName": "Charbeneau",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Ed-Charbeneau-c4c717ab-3bf7-4a2c-ab7f-8d0a4d29c518-636553214246453527.jpg",
        "UserName": "edcharbeneau",
        "Biography": "Ed is a Microsoft MVP and an international speaker, writer, online influencer, a Developer Advocate for Progress, and expert on all things web development. Ed enjoys geeking out to cool new tech, brainstorming about future technology, and admiring great design.\r\n\r\nEd has shared his insights, experiences, and advice around collaboration, knowledge management, social computing, and training at many industry events around the United States. Highly ethical and engaging with an uncanny business acumen, he is a creative community builder and outside the box thinker. Long term business relationships throughout the world within internal communications, employee engagement and marketing as well as IT. Focusing on Financial, Healthcare, Manufacturing, Agency and Professional Services. He has defined, architected, implemented line of business solutions with a touch of style and UX best practices.",
        "WebSite": "http://edcharbeneau.com",
        "Company": "Progress",
        "Title": "Ed is a Microsoft MVP and an international speaker, writer, online influencer, a Developer Advocate for Progress.",
        "Twitter": "@edcharbeneau",
        "Facebook": "https://www.facebook.com/edcharbeneau",
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": "https://github.com/edcharbeneau",
        "LastUpdated": "2018-02-27T09:43:44.647"
    },
    {
        "FirstName": "Eric",
        "LastName": "Potter",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--0898207e-9a43-46b5-98ea-36744a734d7b-636553214250831648.jpg",
        "UserName": "EricPotter",
        "Biography": "Eric is a Software Architect for Aptera Software and a Microsoft MVP for Visual Studio and Development Technologies. He works primarily in the .Net web platform but loves opportunities to try out other stacks. He has been developing high-quality custom software solutions since 2001. At Aptera, he has successfully delivered solutions for clients in a wide variety of industries. He loves to dabble in new and exciting technologies. In his spare time, he loves to tinker with Arduino projects. He fondly remembers what it was like to develop software for the Palm OS. He has an amazing wife and 5 wonderful children. He blogs at http://humbletoolsmith.com/ and you can follow him on twitter as @pottereric. \r\n",
        "WebSite": null,
        "Company": null,
        "Title": "Software Architect ",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:45.083"
    },
    {
        "FirstName": "Greg",
        "LastName": "Malcolm",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--da6f97f2-c51a-4a65-a4e6-7ecd3f42a4a7-636553214256145434.jpg",
        "UserName": "GregMalcolm",
        "Biography": "Greg is an Application Developer/Consultant working for ICC. He is a polyglot developer who loves experimenting with new languages and frameworks. In recent years he's been focusing more and more on JavaScript related frameworks. If you’re wondering about the accent, everyone speaks like this in the southern foothills of Columbus.",
        "WebSite": null,
        "Company": null,
        "Title": "Tech Lead/Consultant - ICC",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:45.613"
    },
    {
        "FirstName": "James",
        "LastName": "Balmert",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--c971bac3-167a-4126-83dd-6e7ec188f73d-636553214260563584.jpeg",
        "UserName": "JamesBalmert",
        "Biography": "James Balmert is a consultant for Manifest Solutions out of Columbus, Ohio. With nearly 20 years of experience, he specializes in object oriented design and test driven development. He has worked for large companies in the financial, insurance, and health sectors, helping them to improve code quality and productivity. James is also an instructor in the Manifest Solutions bootcamp program. We help prepare the next generation of agilists for work in the industry. James has a bachelors of science degree in computer science engineering from the Ohio Status University. He is an avid reader, collects Rubik’s cubes, and has a soft spot for Metroidvania games",
        "WebSite": null,
        "Company": null,
        "Title": "Director of Craftsmanship (Codesaurus) at Manifest Solutions",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:46.057"
    },
    {
        "FirstName": "Jarred",
        "LastName": "Olson",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--7fe4d4e8-6586-4bfe-9404-fbc3dbacf4a7-636553214264781588.jpg",
        "UserName": "JarredOlson",
        "Biography": "Jarred has been developing software professionally for over 10 years. He is passionate about scalability, continuous delivery, removing inefficiencies, and developing DRY clean code in Groovy, Java, Javascript, Scala, or whatever the best tool for the job is. Currently employed at Step It Up in Columbus OH where he slings code while keeping a light and fun team environment. Outside of software Jarred enjoys spending time with his wife and 2 kids, woodworking, and watching college football.",
        "WebSite": null,
        "Company": null,
        "Title": "Problem Solver",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:46.477"
    },
    {
        "FirstName": "Jeff",
        "LastName": "McKenzie",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--d8043d0b-f39c-4583-bfef-8412e258b45f-636553214269154704.jpg",
        "UserName": "JeffMcKenzie",
        "Biography": "Jeff McKenzie has worked in software development for nearly twenty years, in both freelance and full-time capacities, as a developer and team leader. He enjoys helping others solve problems through technology, whether it's the small business getting on the web for the first time, or a Fortune 500 company expanding its enterprise. Although he started his career using BASIC on an Atari 800, he took a big detour, getting Biology and English degrees before rediscovering programming, with a new thing called the World Wide Web. He is currently Principal Consultant at Cardinal Solutions Group in Columbus Ohio.",
        "WebSite": null,
        "Company": null,
        "Title": "Principal Consultant, Cardinal Solutions",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:46.917"
    },
    {
        "FirstName": "Jeremy",
        "LastName": "Clark",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--f548d4d3-7adf-4a33-b303-70aa058131da-636553214273357698.jpg",
        "UserName": "JeremyClark",
        "Biography": "Jeremy Clark makes developers better. By drawing on over 15 years of experience in application development, he helps developers take a step up in their skillset with a focus on making complex topics approachable regardless of skill level. He is a Microsoft MVP for .NET, and he has authored seven courses for Pluralsight, including \"C# Interfaces\", a course aimed at giving developers a clear understanding of abstraction. He loves speaking and has delivered over 200 technical presentations in the last 7 years in the United States and Europe. Jeremy lives in northern Washington with 2 dogs, 2 cats and a banjo.",
        "WebSite": null,
        "Company": null,
        "Title": "Developer Better",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:47.337"
    },
    {
        "FirstName": "Johnson",
        "LastName": "Denen",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--68bca2c9-fc64-4a56-b1df-782045dc6e9a-636553214280357690.jpg",
        "UserName": "JohnsonDenen",
        "Biography": "Johnson is a Software Artisan with Pillar Technology. He currently leads a team developing a big data platform in AWS, and he's spent far too much of his time with Docker and Jenkins.\r\n\r\n\"If I can't do it in Emacs, it's probably not worth doing.\"",
        "WebSite": null,
        "Company": null,
        "Title": "Artisan and Emacs Advocate at Pillar Technology",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:48.037"
    },
    {
        "FirstName": "Jon",
        "LastName": "Kruger",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Jon-Kruger-601e73c0-bdc1-4d01-a9e3-957a224a7bc5-636553214284755826.jpg",
        "UserName": "jonkruger",
        "Biography": "Hi, I'm Jon Kruger and I am a software developer and technical leader in Columbus, OH.  I specialize in software solutions, project leadership, and Agile coaching and training and I have experience in a wide range of industries and environments. I use my experience as a leader and software developer to find ways to create better quality software, improve the software development process, and maximize value for the business.  You can follow me on my blog (jonkruger.com) or on Twitter (@JonKruger).",
        "WebSite": "http://jonkruger.com",
        "Company": null,
        "Title": "Improving people's lives through software",
        "Twitter": "@JonKruger",
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": "https://www.linkedin.com/in/jonkruger",
        "GitHub": "https://github.com/jonkruger",
        "LastUpdated": "2018-02-27T09:43:48.477"
    },
    {
        "FirstName": "Justin",
        "LastName": "James",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--7941ba5e-3f4a-40b1-a875-22c356492d4c-636553214288648593.jpg",
        "UserName": "JustinJames",
        "Biography": "Justin is a Microsoft MVP, DevOps Evangelist, Web developer and Professional Speaker who loves to code, teach, and share his knowledge with others to help them grow in their careers.  He specializes in making the complex simple and easy to understand.    \r\n  \r\nJustin has worked at Intel for over 20 years in various groups leading software development projects, being an Agile advocate  and most recently has taken on a role as a DevOps Evangelist.  Justin's new role as a DevOps Evangelist is the perfect marriage of his love of development and teaching.     \r\n  \r\nJustin frequently speaks at conferences, meetups, and community events.  He has been a guest on the .NET Rocks podcast, Angular Air videocast, and Developer on Fire podcast.   To hear his thoughts on software development and public speaking,  follow his website at http://digitaldrummerj.me, subscribe to his YouTube channel at https://www.youtube.com/channel/UCDMvOL1XSKclxwplUT0fzLA  or subscribe to his Twitch channel at https://www.twitch.tv/digitaldrummerj.     \r\n \r\nIf you see him in the hallway, come up and say hi! ",
        "WebSite": null,
        "Company": null,
        "Title": "Making the complex simple and easy to understand",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:48.863"
    },
    {
        "FirstName": "Kevin",
        "LastName": "Holtz",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--bfce3e85-c2c2-4b17-85e0-ea209556e633-636553214293026717.jpg",
        "UserName": "KevinHoltz",
        "Biography": "Nearly 20 years experience in everything software - from sales engineering to customer success management to my current role as a Product Manager in the healthcare industry.\r\n\r\n-Product strategy, goals, and objectives\r\n-Delivering solutions to users that solve problems\r\n-Software innovation, execution, and delivery\r\n-Learning through rapid testing\r\n-Team engagement and management\r\n-Constantly refining effective communication strategies",
        "WebSite": null,
        "Company": null,
        "Title": "Product Manager, OnShift, Inc.  Cleveland, OH",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:49.303"
    },
    {
        "FirstName": "Kevin",
        "LastName": "Mack",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Kevin-Mack-19a3357a-b573-4bbf-b438-d99334f688f9-636553214297199688.jpg",
        "UserName": "kevinmack",
        "Biography": "\r\nWith over 20 years of digital experience, Kevin Mack has worked along other industry leaders to make creative and innovative experiences that scale and meet customer demands, needs, and visions. His background includes designing and developing user experiences for large-scaling websites and applications. Kevin is the Chief Experience Officer (CXO) of BYBE where he focuses on the evolution of the BYBE brand and creating integrated experiences for retailers and consumers. Kevin has been running a holding company called Discreet AF. Discreet's primary company is Bosun, a digital marketing agency, which is a collection of nerds, creatives, consultants/advisors that wake up doing what they love to do each day. He is the co-founder and organizer of The Columbus Web Group http://columbuswebgroup.com where he actively participates in growing and educating the community around design, development, best practices and standards for the web. You can find him on Twitter (@nicetransition), YouTube https://goo.gl/jrHuQH, CodePen http://codepen.io/nicetransition, or GitHub https://github.com/kevinmack18. His passions are \"all things web\" and mentoring others. Plus, he parties.",
        "WebSite": "http://columbuswebgroup.com",
        "Company": "BYBE / DIscreet AF",
        "Title": "I get excited and make things",
        "Twitter": "nicetransition",
        "Facebook": "https://facebook.com/kevinmack",
        "GooglePlus": null,
        "LinkedIn": "https://www.linkedin.com/in/kevindmack",
        "GitHub": "https://github.com/kevinmack18",
        "LastUpdated": "2018-02-27T09:43:49.72"
    },
    {
        "FirstName": "Kim",
        "LastName": "McGill",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--4dcf686d-1275-4b34-bd60-2864ba30f22c-636553214300997392.jpg",
        "UserName": "KimMcGill",
        "Biography": "Kim McGill has supported a wide range of industries as a Scrum Master, Agile Transformation Coach, Business Analyst, Product Owner and Project and Program Manager over the last 15 years. With her dedication to building teams and organizations that understand real value delivery, she has built a reputation for creating successes in 'real life'. She combines a deep interest in behavioral science, human communication models, and complex system modeling with a deep and abiding belief that healthy functional teams are the cornerstone of all great things. In the last year she has spoken at the Cincinnati, OH chapter of the IIBA as well as at CodeMash 2018. She continues to be an active member of various technical user groups and communities of practice and advocates responsible Agile in every organization she comes into contact with.",
        "WebSite": null,
        "Company": null,
        "Title": "Sr Consultant, Ingage Partners ",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:50.1"
    },
    {
        "FirstName": "Kris",
        "LastName": "Hatcher",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--841e4666-2551-44e5-b6c2-e2c732d6b20d-636553214305070300.jpg",
        "UserName": "KrisHatcher",
        "Biography": "Kris Hatcher is a web developer and agile enthusiast working at Smart Data in Dayton, Ohio. He enjoys developing productive teams and has over 15 years of experience working with clients in a variety of fields. His passion is working collaboratively with clients to figure out the best solution for their long-term plans.  To better help clients transition to the AWS cloud, Kris recently became an AWS Certified Solutions Architect Associate. ",
        "WebSite": null,
        "Company": null,
        "Title": "Development Lead, Smart Data",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:50.507"
    },
    {
        "FirstName": "Lars",
        "LastName": "Klint",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Lars-Klint-8abcc194-5082-4d78-90b9-cc4aa48f3295-636553214309148198.jpg",
        "UserName": "larsklint",
        "Biography": "Lars is an author, trainer, Microsoft MVP, community leader, authority on all things Windows Platform and part time crocodile wrangler. He is heavily involved in the space of HoloLens and mixed reality, as well as a published Pluralsight author, freelance solution architect and writer for numerous publications. He has been a part of the software development community for the past 20 years and co-organises the DDD Melbourne community conference, organises developer events with Microsoft, and also runs a part time car restoration business. He has spoken at numerous technical events around the world and is an expert in Australian Outback Internet.",
        "WebSite": "https://larsklint.com",
        "Company": "larsklint.com",
        "Title": "Programmer, Speaker, Chief Hologram Maker",
        "Twitter": "larsklint",
        "Facebook": "https://www.facebook.com/lklint",
        "GooglePlus": null,
        "LinkedIn": "https://www.linkedin.com/in/lklint/",
        "GitHub": "https://github.com/lklint",
        "LastUpdated": "2018-02-27T09:43:50.913"
    },
    {
        "FirstName": "Mandar",
        "LastName": "Malunjkar",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--cafa6d16-c857-48e1-8696-6384ec38dbe2-636553214313296158.jpg",
        "UserName": "MandarMalunjkar",
        "Biography": "Mandar Malunjkar is an Agile Software Development leader with broad technical expertise and strong focus on software engineering practices. For over a decade, Mandar has ledculturally diverse teams across North America, Europe & Asia.\r\n\r\nAll along his career Mandar has worn several different hats, working as a Developer, Tech Lead, Scrum Master and People Leader. He played a key role in agile transformation at Alliance Data, starting out in a technical leadership role and simultaneously taking on Scrum Master responsibilities. Presently he is responsible for overseeing a team of a baker’s dozen developers, working on multiple cross functional teams.\r\n\r\nIn his spare time, Mandar enjoys reading books, going on long walks, travelling and listening to music.",
        "WebSite": null,
        "Company": null,
        "Title": "There is too much blood in my caffeine system.",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:51.33"
    },
    {
        "FirstName": "Marc",
        "LastName": "Peabody",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--1f30f6f0-2e9e-4211-98aa-995c78bbbf30-636553214317714302.png",
        "UserName": "MarcPeabody",
        "Biography": "Marc Peabody is Agent 0027, a remote consultant with Test Double who helps software teams reach their highest potential through writing better code and improving team rapport. He especially loves dabbling in JavaScript, Ruby, or any tech that can afford him quick feedback loops. When not coding, he can be found mucking about gaming, running, or amusing himself via any close-at-hand musical instrument.",
        "WebSite": null,
        "Company": null,
        "Title": "Double Agent",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:51.77"
    },
    {
        "FirstName": "Marlena",
        "LastName": "Bowen",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--3631b337-cb76-406d-bd58-b3f77433bc4d-636608513788495419.jpg",
        "UserName": "MarlenaBowen",
        "Biography": "Marlena Bowen is a software engineer at Root Car Insurance. She loves automating manual processes, squashing bugs, and doing things right the first time.",
        "WebSite": null,
        "Company": null,
        "Title": "Software Engineer",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-05-02T09:49:38.85"
    },
    {
        "FirstName": "Martine",
        "LastName": "Dowden",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--fbf45ffb-76ff-4cd3-9b37-348a8be23f7f-636553214329352597.png",
        "UserName": "MartineDowden",
        "Biography": "Focusing on web interfaces that are beautiful, functional, and usable, Martine delivers products that adhere to WCAG 2.0 and Section 508 for accessibility and compliance. She approaches User Experience from both Art and Science, drawing from her degrees in Psychology and Visual Communications. Martine has worked as an artist, educator, and consultant since 2005.\r\n\r\nShe stays active in the industry, teaching new developers at Eleven Fifty Academy, attending and speaking at conferences and meetups, and publishing the occasional blog. In 2015 Martine's children's book \"Programming Languages ABC++\" was published by Inedo, and in 2016 the Workbook Edition sold over 20,000 copies.",
        "WebSite": null,
        "Company": null,
        "Title": "UX/UI Designer & Developer",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:52.937"
    },
    {
        "FirstName": "Michael",
        "LastName": "Dowden",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--6da7880b-4b42-4c01-8ee3-db031cbdee1a-636553214335051668.png",
        "UserName": "MichaelDowden",
        "Biography": "Michael Dowden is the Co Founder of startup incubator Andromeda, Product Architect for FlexePark, and President of M2D2 Enterprises. Since 1992 he has provided a full range of full-stack technology and consulting services to more than 60 companies ranging from startups to the Fortune 100.\r\n\r\nAs a software developer and architect Michael focuses on the K.I.S.S. principle, keeping systems as simple as possible (but no simpler). Michael is passionate about lightweight frameworks in both both Java and JavaScript ecosystems, often pointing out that Java is to JavaScript as Car is to Carrot. As an MBA he focuses on solutions that provide true business value and always works to improve collaboration and communication between teams.\r\n\r\nSince 1997 Michael has been active in helping other developers grow in their career, as a teaching assistant, user group organizer, and instructor for both Eleven Fifty Academy and Propel Up. Michael is currently developing a Java cryptography course for Pluralsight. His book Programming Languages ABC++ has sold more than 20,000 copies and has made its way into elementary schools across Indiana. Michael also speaks at tech conferences including Code PaLOUsa, Indiana IT Symposium, Indy.Code(), KCDC, and Dev Up.\r\n",
        "WebSite": null,
        "Company": null,
        "Title": "Entrepreneur. Coder. Gamer. Geek.",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:53.507"
    },
    {
        "FirstName": "Richard",
        "LastName": "Taylor",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--406260a5-e2be-48ae-ad0f-7536c7e96c39-636553214339499824.jpg",
        "UserName": "RichardTaylor",
        "Biography": "Richard L. Taylor Jr. is a 25 year software development and technology professional living in Huntersville, NC. His experience includes the design and development of small to enterprise class applications.  He currently serves as Director of Engineering at SentryOne.\r\n\r\nRichard is a believer of using the right tools for the job and has leveraged ASP.NET (Web API, MVC), SQL Server/MongoDB, Angular, Bootstrap, JavaScript/NodeJS, KendoUI, and Xamarin (just to name a few) to deliver solutions.  He has a great deal of experience but likes to explore new technologies, tools, and techniques to help create better software.\r\n\r\nRichard has a passion for the software development community. He serves as one of the organizers of the Modern Devs Charlotte meetup group and is the founding organizer of the Charlotte Xamarin Developers meetup group.  Both groups try to create environments where developers of all skill levels can come together and learn about the latest technologies, tools, and techniques to create software. These groups also provide a venue to network with fellow developers in the community.  In addition to serving the local software development community via meetup groups, Richard also speaks at regional, national, and international technology users groups and conferences.  His speaking schedule can be found here: http://www.rightincode.com/page/speaking-schedule \r\n\r\nAs a result of his technical community work, Richard has received the Microsoft Most Valuable Professional (MVP) award in the Visual Studio and Development Technologies category.  MVPs make up a global community of over 4,000 technical experts and community leaders across 90 countries and are driven by their passion, community spirit, and quest for knowledge.   Richard has also received the Progress (Telerik) Developer Expert designation.  DE’s are highly skilled, visible, and elite industry leaders who write, speak, help, and code using Progress (Telerik) products.  There are 44 DE’s in 13 different countries who are ambassadors for Progress Products to the tech community.\r\n\r\nWhen not developing software, Richard is focused on spending time with his lovely wife Shondrecca (she gives the best hugs!!) and their five children (Richard III, Ayanna, David, Jonathan, and Stephen).",
        "WebSite": null,
        "Company": null,
        "Title": "Husband, father, Microsoft MVP, Progress/Telerik Dev Expert, and software dev with a passion for .Net, and doing software right. It's all about Right'in Code",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:53.95"
    },
    {
        "FirstName": "Rob",
        "LastName": "Richardson",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--c9c8ff7c-5cac-451b-8678-dd17ba1b47df-636553214344033057.jpg",
        "UserName": "RobRichardson",
        "Biography": "Rob Richardson is a software craftsman building web properties in ASP.NET and Node, Angular and React. He’s a Microsoft MVP, published author, frequent speaker at conferences, user groups, and community events, and a diligent teacher and student of high quality software development. You can find this and other talks on his blog at https://robrich.org/presentations and follow him on twitter at @rob_rich.",
        "WebSite": null,
        "Company": null,
        "Title": "@rob_rich",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:54.403"
    },
    {
        "FirstName": "Ronda",
        "LastName": "Bergman",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--63dd512f-6392-429e-9ec1-d16a1ae9818e-636553214348806458.jpg",
        "UserName": "RondaBergman",
        "Biography": "Ronda has been working as a software developer for 18+ years, primarily in the .NET stack. She has worked for large multi-national organizations and small startups. She is the Founder and Lead Consultant of EllaVatec, a diversity and inclusion consultancy. The Co-founder and Chapter Leader of Girl Develop It Ann Arbor. A Software Artisan at Pillar Technologies, and the Vice President of Ann Arbor .NET Developers. As a female developer and the mother of 2 female developers Ronda is working hard to help level the playing field for everyone in the industry.",
        "WebSite": null,
        "Company": null,
        "Title": "Founder / Lead Consultant",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:54.88"
    },
    {
        "FirstName": "Seth",
        "LastName": "Petry-Johnson",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/seth-petry-johnson-86c44c0c-784c-45fd-b839-fade4501f66e-636553214357192437.jpg",
        "UserName": "sethpetryjohnson",
        "Biography": "Seth spent 21 years as a professional developer/architect before finally turning in his daily commit rights for a Microsoft Project product key. He now spends his days as a pointy-haired boss leading a small product development team in the search for simple solutions to complex problems. He is passionate about clean architecture, testable systems, and bringing order to chaos. Seth lives in Columbus, OH and is an active participant in the Midwest developer community. He'll write TPS reports when he has to, but still enjoys writing, reviewing, and talking about code.",
        "WebSite": "http://www.petry-johnson.com",
        "Company": "Heuristic Solutions, Inc",
        "Title": "Pointy-haired boss by day, coder by night",
        "Twitter": "@spetryjohnson",
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:55.72"
    },
    {
        "FirstName": "Shawn",
        "LastName": "Price",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--9501f0dc-18b3-4cd3-85d3-23e4a1570fba-636553214361255325.png",
        "UserName": "ShawnPrice",
        "Biography": "Shawn spent nearly a decade in the consulting world before stumbling into Healthcare. He's learned enough along the way that he thinks he might be able to help others. He likes playing music, crossfit, being a dad and lots of other things that make him insufferable to talk to at social gatherings.",
        "WebSite": null,
        "Company": null,
        "Title": "Co-founder, CTO and upstanding citizen at Healthy Roster",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:56.127"
    },
    {
        "FirstName": "Steve",
        "LastName": "Smith",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Steve-Smith-96c5bd17-06f6-4fd8-9194-dc65b7c32eaf-636553214370707062.jpg",
        "UserName": "ardalis",
        "Biography": "Steve Smith (@ardalis) is an entrepreneur and software developer with a passion for building quality software as effectively as possible. Steve has published several courses on Pluralsight, covering DDD, SOLID, design patterns, and software architecture. He's a Microsoft ASP.NET MVP and Insider, a frequent speaker at developer conferences, an author, and a trainer.\r\n\r\nSteve works with companies that want to avoid the trap of technical debt by helping their teams deliver quality software, quickly. Steve and his team have been described by clients as a \"force multiplier\", amplifying the value of existing development teams. Steve's client list includes Microsoft, Quicken Loans, Celina Insurance, and many other satisfied customers.",
        "WebSite": "http://ardalis.com",
        "Company": "DevIQ",
        "Title": "I Help Teams Deliver Better Software",
        "Twitter": "@ardalis",
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": "https://www.linkedin.com/in/stevenandrewsmith",
        "GitHub": "https://github.com/ardalis",
        "LastUpdated": "2018-02-27T09:43:57.07"
    },
    {
        "FirstName": "Thomas",
        "LastName": "Haver",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--d35d991a-f39c-4e92-b7b1-07b190f2765e-636553214374389685.jpg",
        "UserName": "ThomasHaver",
        "Biography": "Thomas Haver is presently serving as the Senior Application Architect for Huntington National Bank. He is responsible for the conversion from manual testing to Ruby/Cucumber automation for the entire enterprise. Originally accountable for the development and maintenance of automation frameworks for Digital Channels, he now leads the automation effort for 63 applications across Huntington that encompass testing, metrics & reporting, data, and environment. Thomas is a scientist turned baker turned technology professional. He started as a research scientist in fluorescence microscopy & spectroscopy, and has worked at three different R1 research institutes. He has worked as a tester, a developer, a requirements analyst, and finally an application architect. On the weekends, he makes baked goods for a local bakery and hosts gaming events for his non-profit. His passion for reducing the cost of quality through automation and continuous improvement leads him to explore new areas of technology and business management.",
        "WebSite": null,
        "Company": null,
        "Title": "Huntington National Bank",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:57.44"
    },
    {
        "FirstName": "Tim",
        "LastName": "LeMaster",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--ea840e31-ef42-4b08-a50d-8fb91310f6bb-636553214382800680.jpg",
        "UserName": "TimLeMaster",
        "Biography": "Tim is a Senior Software Engineer at Doc Halo. He has 22 years of software development experience and has been developing for iOS since 2009. He studied Physics at Purdue University and is a veteran of the United States Air Force.",
        "WebSite": null,
        "Company": null,
        "Title": "Doc Halo, Senior Software Engineer",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:58.28"
    },
    {
        "FirstName": "Tim",
        "LastName": "Hoolihan",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--14a84057-4971-40a4-9c12-25004674cc4e-636553214378582673.jpg",
        "UserName": "TimHoolihan",
        "Biography": "Tim Hoolihan is the Senior Director of Data Science at DialogTech. He is the organizer for the Cleveland R User Group, and the author of three video courses on machine learning in R available via Packt Pub. Tim lives in Northeast Ohio.",
        "WebSite": null,
        "Company": null,
        "Title": "Senior Director of Data Science at DialogTech",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:57.86"
    },
    {
        "FirstName": "Warner",
        "LastName": "Moore",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/Warner-Moore-26ae439e-1941-4fde-a2bc-9e0da9ca0efb-636554920101828476.jpg",
        "UserName": "WarnerMoore",
        "Biography": "Warner Moore is a driven technology leader and architect with a background in web operations and information security. He has focused his career in working with high growth organizations where technology is their business and product. Within these organizations, Warner has an accomplished record of building successful security programs and high performing technology teams. ",
        "WebSite": null,
        "Company": null,
        "Title": "Technology and Information Security leader",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-03-01T09:06:50.183"
    },
    {
        "FirstName": "Wasim",
        "LastName": "Hanna",
        "HeadShot": "//stirtrek.com/cloud/profilephotos/--2a98768f-276f-4179-a898-e98e4df6e862-636553214387143771.jpg",
        "UserName": "WasimHanna",
        "Biography": "Wasim Hanna is a software developer and consultant for the past decade with focus on Microsoft technologies. He helps companies build enterprise level applications",
        "WebSite": null,
        "Company": null,
        "Title": "Senior Consultant at Cardinal Solutions Group",
        "Twitter": null,
        "Facebook": null,
        "GooglePlus": null,
        "LinkedIn": null,
        "GitHub": null,
        "LastUpdated": "2018-02-27T09:43:58.713"
    }
]