{
  "sponsors": {
    "principal": [
      {
        "name": "Insight",
        "level": "principal",
        "link": "https://www.insight.com/en_US/solve/digital-innovation.html",
        "description": "Insight Digital Innovation, formerly Cardinal Solutions, is global technology company committed to helping clients innovate smarter so they can create digital experiences that drive differentiation, competitive advantage, and loyalty.",
        "logo": "/images/sponsors/insight_350x200.png"
      },
      {
        "name": "IGS",
        "level": "principal",
        "link": "https://igs.com",
        "description": "With nearly 30 years of experience in the energy industry, the IGS family of companies provides the following to over one million customers across the country: natural gas, electricity, and home warranty products; power generation solutions off the grid; clean, domestic alternative fueling options; and solar solutions. We focus on empowering consumers to make choices that best fit their energy needs. Our community investment program, IGS Impact, provides employees with opportunities to get involved with causes that are meaningful to both the company and to them personally.",
        "logo": "/images/sponsors/IGS_350x200v2.png"
      },
      {
        "name": "OCLC",
        "level": "principal",
        "link": "https://www.oclc.org/en/home.html",
        "description": "OCLC, a worldwide library services organization headquartered in Dublin, Ohio, is a leader in information technologies and innovative online services. With office locations around the globe, OCLC employees are dedicated to offering premier services and software to help libraries cut costs while keeping pace with the demands of our information-driven society.",
        "logo": "/images/sponsors/oclc_350x200.jpg"
      },
      {
        "name": "CapTech",
        "level": "principal",
        "link": "https://www.captechconsulting.com/",
        "description": "CapTech is a national IT management consulting firm that bridges the gap between business and technology. We partner with some of the world's most successful companies to design, develop, and manage technical and digital solutions that delight customers, drive insights, and meet strategic objectives.",
        "logo": "/images/sponsors/captech_350x200.png"
      },
      {
        "name": "TEKsystems",
        "level": "principal",
        "link": "https://www.teksystems.com/",
        "description": "At TEKsystems, we’re obsessed with technology. Its power to change everything. Technology fuels our passion and commitment to helping organizations do what they set out to. When we engage, we bring fresh ideas that help you galvanize your performance. Refine your strategy. Spark new energy. The future—and how we get there—depends on those who build, connect, create and transform our world. The most successful and innovative businesses are already doing it, and we’re skilled experts at bringing in the teams and support needed to thrive.",
        "logo": "/images/sponsors/teksystems_350x200.png"
      },
      {
        "name": "Progress",
        "level": "principal",
        "link": "http://www.telerik.com/",
        "description": "Progress (NASDAQ: PRGS) offers the leading platform for developing and deploying mission-critical business applications. The creator of the award-winning Telerik .NET and Kendo UI JavaScript user interface components/controls, reporting solutions and productivity tools, Progress offers all the tools developers need to build high-performance modern apps with outstanding UI. Learn more about the Progress developer tools at: www.telerik.com or 1-781-280-4000.",
        "logo": "/images/sponsors/Progress_350x200.png"
      },
      {
        "name": "Workstate",
        "level": "principal",
        "link": "https://www.workstate.com/",
        "description": "Workstate is a global IT consulting company. Our mission depends on long-term, meaningful and straightforward relationships with our clients – what we call “no BS consulting.” The fire in our bellies is inextricably tied to partnering actively with our clients, instead of the more-typical in-and-out vendor relationship. The best vendors can build precisely what they're told. But the best partners roll up their sleeves, dig in and actively work to elevate their clients' business outcomes. When we began over 20 years ago, we were determined to challenge the status quo by championing our clients’ vision, building mutual trust and respect, and harnessing technology for growth and change. That goal has withstood the test of time. In short: Good things come to those who Workstate.",
        "logo": "/images/sponsors/workstate_350x200v2.png"
      },
      {
        "name": "Leading EDJE",
        "level": "principal",
        "link": "http://leadingedje.com",
        "description": "Leading EDJE helps our partners solve their most complex business challenges by building the highest quality custom solutions….and we do it better than anyone else! Since 2007, we have created a unique culture which promotes high positive energy with an entrepreneurial spirit. Our firm is made of exceptionally talented professionals who deliver exceptional results, and our clients are made from a wide array of industries but have a common goal of choosing a partner who provides distinct, creative solutions. We choose to work and live deliberately via our uncompromising core values, of Put Team First, Is Dedicated to Growth, Does the Right Thing…Not the Right Now Thing, Is Authentic and Clear and Approaches Problem Solving Passionately.",
        "logo": "/images/sponsors/leadingedje_350x200.png"
      }      
    ],
    "platinum": [
      {
        "name": "CGI",
        "level": "platinum",
        "link": "https://www.cgi.com/",
        "description": "Founded in 1976, CGI is among the largest IT and business consulting services firms in the world. We are insights-driven and outcomes-based to help accelerate returns on your investments. Across hundreds of locations worldwide, we provide comprehensive, scalable and sustainable IT and business consulting services that are informed globally and delivered locally. In all we do, our goal is to build trusted relationships through client proximity, providing industry and technology expertise to help you meet the needs of your customers and citizens.",
        "logo": "/images/sponsors/cgi_350x200v2.jpg"
      },
      {
        "name": "Revel IT",
        "level": "platinum",
        "link": "https://www.revelit.com/",
        "description": "Revel IT is a young and high energy company, we aim to help consultants and candidates land fulfilling jobs that offer real career growth. Our goal is to treat our consultants and clients the way we would like others to treat us — we are honest, stay true to our word, and work in the best interest of our clients, consultants, and candidates. Many say they work this way, but few actually do. We are a company that does. Our mission is to find and provide the best talent for clients and excellent career opportunities for consultants and candidates — whom we treat as part of our team.",
        "logo": "/images/sponsors/revelit_350x200.png"
      },
      {
        "name": "Upstart",
        "level": "platinum",
        "link": "https://www.upstart.com/",
        "description": "Upstart is the leading AI lending platform designed to expand access to affordable credit. With $5.7B in loans originated, Upstart’s loss rates are less than half those of industry peers for borrowers with similar FICO scores. Our product consistently ranks at the top of leading review sites like CreditKarma and Trustpilot.",
        "logo": "/images/sponsors/upstart_350x200.png"
      },
      {
        "name": "CAS",
        "level": "platinum",
        "link": "https://www.cas.org/",
        "description": "CAS, a division of the American Chemical Society specializing in scientific information solutions, partners with R&D organizations globally to provide actionable insights that help them plan, innovate, protect their innovations, and predict how new markets and opportunities will evolve. Scientific researchers, patent professionals and business leaders around the world across commercial, academic and government sectors rely on our solutions and services to advise discovery and strategy. Leverage our unparalleled content, specialized technology, and unmatched human expertise to customize solutions that will give your organization an information advantage. With more than 110 years' experience, no one knows more about scientific information than CAS. Learn more at www.cas.org.",
        "logo": "/images/sponsors/cas_350x200.png"
      },
      {
        "name": "DMG",
        "level": "platinum",
        "link": "https://divisionsmg.com/",
        "description": "We are a tech-based company, one the fastest growing private enterprises in the Tri-State. Divisions Maintenance Group is a Top Workplace, Inc. 5000 member, rising quickly on the Fast 55 and Top Privately Held Companies lists. We are a national leader in Facilities Maintenance, handling thousands of properties across the country from one, centralized location in Newport, KY. Our tech team participates in the design, development, and implementation of large complex technology solutions. We have great respect and interest in new technologies and applications.",
        "logo": "/images/sponsors/dmg_350x200.jpg"
      },
      {
        "name": "Daugherty Business Solutions",
        "level": "platinum",
        "link": "https://www.daugherty.com/",
        "description": "For over 35 years, Daugherty has been committed to driving innovation, growth and customer satisfaction across the nation while making a positive difference in the community. With software engineering, data analytics, business advisory services, and technology and delivery leadership, Daugherty delivers significant business results quickly and effectively. Leveraging proprietary tools, techniques, and virtual and regional development centers, Daugherty is a preferred strategic advisor and partner for the Fortune 500, helping customers achieve better and more predictable outcomes for mission-critical initiatives.",
        "logo": "/images/sponsors/daugherty_350x200.jpg"
      },
      {
        "name": "impact.com",
        "level": "platinum",
        "link": "https://impact.com/",
        "description": "impact.com, the world’s leading partnership management platform, is transforming the way businesses manage and optimize all types of partnerships—including traditional rewards affiliates, influencers, commerce content publishers, B2B, and more. The company’s powerful, purpose-built platform makes it easy for businesses to create, manage, and scale an ecosystem of partnerships with the brands and communities that customers trust to make purchases, get information, and entertain themselves at home, at work, or on the go. To learn more about how impact.com’s technology platform and partnerships marketplace is driving revenue growth for global enterprise brands such as Walmart, Uber, Shopify, Lenovo, L’Oreal, Fanatics and Levi’s, visit www.impact.com.",
        "logo": "/images/sponsors/impact-350x200.jpg"
      }      
    ],
    "gold": [
      {
        "name": "Improving",
        "level": "gold",
        "link": "http://www.improving.com/",
        "description": "Improving is a technology management and consulting services firm deeply rooted in our commitment to establishing trust — not only with each other but with our clients, partners, communities, and others. We aspire to do this through creating transparency, delivering results, continuously improving, clarifying expectations, and keeping our commitments.",
        "logo": "/images/sponsors/improvingenterprises.png"
      },
      {
        "name": "Nationwide",
        "level": "gold",
        "link": "https://www.nationwide.com",
        "description": "Nationwide, a Fortune 100 company based in Columbus, Ohio, is one of the largest and strongest diversified insurance and financial services organizations in the U.S. and is rated A+ by both A.M. Best and Standard & Poor’s. The company provides a full range of insurance and financial services, including auto, commercial, homeowners, farm and life insurance; public and private sector retirement plans, annuities and mutual funds; banking and mortgages; excess & surplus, specialty and surety; pet, motorcycle and boat insurance. For more information, visit www.nationwide.com.",
        "logo": "/images/sponsors/nationwide_350x200.jpg"
      },
      {
        "name": "Beam",
        "level": "gold",
        "link": "https://beam.dental",
        "description": "Beam Dental was founded in 2012 by three engineers who saw the opportunity to modernize the dental insurance industry using technology. The first product was the Beam Brush, which was one of the earliest examples of the Internet of Things in healthcare. Today, Beam Dental is the fastest growing provider of dental benefits in the country and is available in over 40 states around the US. Beam’s product focuses on ease of use, tailored pricing, and a unique commitment to preventative care by incorporating dental hygiene behavior into policy pricing.",
        "logo": "/images/sponsors/beam_350x200.jpg"
      },
      {
        "name": "Com Resource",
        "level": "gold",
        "link": "https://comresource.com/",
        "description": "We are problem-solvers by nature. More than 250 of us…and growing. Customizing processes and technology are our specialties. The more complicated the IT challenge, the better. Having delivered strategic IT solutions for over 25 years, we’ve gotten pretty good at it too. At least that’s what our 200+ clients are telling us. And because we get to work on so many cool and different projects for cream-of-the-crop companies, we have attracted the best and brightest talent. We have an unmatched team spirit which really makes work fun. Probably the reason we are a \"Best Places to Work\"!",
        "logo": "/images/sponsors/comresource_350x200.jpg"
      },
      {
        "name": "Aware",
        "level": "gold",
        "link": "https://callibrity.com/",
        "description": "At Aware, we view work as an opportunity–an opportunity to see new ideas come to life. To solve problems with tenacity through teamwork. To define new categories and improve existing infrastructures. To innovate and make an impact. As the global landscape of work continues to change, Aware is creating opportunities that empower company and employee experiences to be better. Let's work together–Let's grow together.",
        "logo": "/images/sponsors/aware_350x200.png"
      },      
      {
        "name": "Callibrity",
        "level": "gold",
        "link": "https://callibrity.com/",
        "description": "Callibrity is a software consultancy specializing in software engineering, digital transformation, cloud strategy, and data-driven insights. Our national reach serves clients on their digital journey to solve complex problems and create innovative solutions for ever-changing business models. Our technology experience covers a diverse set of industries with a focus on middle-market and enterprise companies.Callibrity is a software consultancy specializing in software engineering, digital transformation, cloud strategy, and data-driven insights. Our national reach serves clients on their digital journey to solve complex problems and create innovative solutions for ever-changing business models. Our technology experience covers a diverse set of industries with a focus on middle-market and enterprise companies.",
        "logo": "/images/sponsors/callibrity_350x200.jpg"
      }      
    ],
    "silver": []
  }
}
