{
    "sponsors": {
        "platinum": [],
        "gold": [
            {
                "name": "CGI",
                "link": "https://www.cgi.com/",
                "description": "Founded in 1976, CGI is a leading global IT and business consulting firm. We offer insights-driven, outcomes-based services to boost your investment returns. Operating in 21 industries across 400 locations, we deliver scalable, sustainable solutions.",
                "logo": "/images/sponsors/cgi_350x200v2.jpg"
            }
        ],
        "silver": [
            {
                "name": "Revel IT",
                "link": "https://www.revelit.com",
                "description": "Revel IT delivers top talent through a unique recruiting process and a dedicated sales and recruiting team. We specialize in IT consulting, staffing solutions, and talent development, fostering a skilled workforce through strategic partnerships.",
                "logo": "/images/sponsors/revelit_350x200.png"
            }
        ],
        "bronze": [
            {
                "name": "Central Insurance",
                "link": "https://www.central-insurance.com",
                "description": "Founded as the Central Mutual Insurance Company in 1876, Central Insurance has evolved into a successful property and casualty group operating on a strong foundation of core values including Integrity, Relationships, and Excellence.",
                "logo": "/images/sponsors/central_insurance_350x200.png"
            },
            {
                "name": "IGS",
                "link": "https://www.igs.com/",
                "description": "IGS Energy is a family-owned energy company serving over 1 million customers. They offer green electricity, carbon-neutral natural gas, solar solutions, and home warranty plans, emphasizing sustainability and tailored energy strategies.",
                "logo": "/images/sponsors/IGS_350x200v2.png"
            },
            {
                "name": "NetJets",
                "link": "https://www.netjets.com/",
                "description": "NetJets operates the largest, most diverse private aircraft fleet in the world and offers a full range of personalized private aviation solutions to meet—and exceed—the high standards of the world's most discerning travelers.",
                "logo": "/images/sponsors/netjets_350x200.png"
            },
            {
                "name": "OCLC",
                "link": "https://www.oclc.org/",
                "description": "At OCLC, we exist because what is known must be shared. On the surface this seems simple. But dig deeper. We hold petabytes of diverse data in different languages, different scripts, and different formats.",
                "logo": "/images/sponsors/oclc_350x200.jpg"
            },
            {
                "name": "Improving",
                "link": "http://www.improving.com/",
                "description": "Improving is a digital services company that provides enterprise software consulting, development, and training to large enterprises worldwide.",
                "logo": "/images/sponsors/improving_350x200.jpg"
            }
        ]
    }
}