{
  "year2018": {
    "principal": [
      {
        "name": "IGS",
        "level": "principal",
        "link": "https://igs.com",
        "description": "With nearly 30 years of experience in the energy industry, the IGS family of companies provides the following to over one million customers across the country: natural gas, electricity, and home warranty products; power generation solutions off the grid; clean, domestic alternative fueling options; and solar solutions. We focus on empowering consumers to make choices that best fit their energy needs. Our community investment program, IGS Impact, provides employees with opportunities to get involved with causes that are meaningful to both the company and to them personally.",
        "logo": "/images/sponsors/IGS.png"

      },
      {
        "name": "OCLC",
        "level": "principal",
        "link": "https://www.oclc.org/en/home.html",
        "description": "OCLC, a worldwide library services organization headquartered in Dublin, Ohio, is a leader in information technologies and innovative online services. With office locations around the globe, OCLC employees are dedicated to offering premier services and software to help libraries cut costs while keeping pace with the demands of our information-driven society.",
        "logo": "/images/sponsors/oclc.png"
      },
      {
        "name": "Fast Switch",
        "level": "principal",
        "link": "https://fastswitch.com",
        "description": "",
        "logo": "/images/sponsors/fastswitch_350x200.jpg"

      }
    ],
    "platinum": [
      {
        "name": "Leading EDJE",
        "level": "platinum",
        "link": "http://leadingedje.com",
        "description": "Leading EDJE helps our partners solve their most complex business challenges by building them the highest quality custom software….and we do it better than anyone else! Since 2007, we have created a unique culture which promotes high positive energy with an entrepreneurial spirit. Our firm is made of exceptionally talented professionals who deliver exceptional results, and our clients are made from a wide array of industries but have a common goal of choosing a partner who provides distinct, creative solutions. We choose to work and live deliberately via our uncompromising core values, of Put Team First, Is Dedicated to Growth, Does the Right Thing…Not the Right Now Thing, Approaches Problem Solving Passionately, and Communicates Effectively.",
        "logo": "/images/sponsors/leadingedje_350x200.jpg"

      },
      {
        "name": "Cardinal Solutions",
        "level": "platinum",
        "link": "http://cardinalsolutions.com/",
        "description": "Cardinal Solutions is a national solution provider with seven locations throughout the Midwest and Southeast, and clients across the U.S. Over the course of 20+ years, we have continually evolved our solution offerings to adapt to the changes in technology and the needs of customers. We lead with our experience and expertise in digital solutions across mobile, web, analytics, and cloud, while collaborating with clients through an agile process that allows organizations to be more creative and flexible in responding to user and stakeholder feedback. Cardinal also provides strategic guidance, training, and mentoring for our clients.",
        "logo": "/images/sponsors/cardinalsolutions_350x200.jpg"

      },
      {
        "name": "Sogeti",
        "level": "platinum",
        "link": "http://us.sogeti.com",
        "description": "We are an IT services company delivering business value through industrialized solutions with sector expertise–one client at a time. With over 45 years of experience, Sogeti offers a comprehensive portfolio of services including Insights & Data, Digital Transformation, Digital Manufacturing, Applications & Cloud Technology, and Digital Assurance Testing. At the heart of our team is a passion for technology and people. Armed with our comprehensive, standard-defining portfolio of solutions, and hyper-focused, client-centric model, we leverage cutting-edge technology to deliver innovative results and best-in-class service to our clients.",
        "logo": "/images/sponsors/sogeti_350x200.jpg"

      },
      {
        "name": "HMB",
        "level": "platinum",
        "link": "https://hmbnet.com",
        "description": "HMB is a professional services firm that specializes in software & product development, and infrastructure solutions. We hire full-time, salaried consultants in Columbus, OH & Louisville, KY. If you want to develop your career and have fun, join us! :)",
        "logo": "/images/sponsors/hmb-350x200.jpg"

      },
      {
        "name": "CapTech",
        "level": "platinum",
        "link": "https://www.captechconsulting.com/",
        "description": "CapTech is a national IT management consulting firm that bridges the gap between business and technology. We partner with some of the world's most successful companies to design, develop, and manage technical and digital solutions that delight customers, drive insights, and meet strategic objectives.",
        "logo": "/images/sponsors/captech.jpg"
      },
      {
        "name": "Nationwide",
        "level": "platinum",
        "link": "https://www.nationwide.com",
        "description": "Nationwide, a Fortune 100 company based in Columbus, Ohio, is one of the largest and strongest diversified insurance and financial services organizations in the U.S. and is rated A+ by both A.M. Best and Standard & Poor’s. The company provides a full range of insurance and financial services, including auto, commercial, homeowners, farm and life insurance; public and private sector retirement plans, annuities and mutual funds; banking and mortgages; excess & surplus, specialty and surety; pet, motorcycle and boat insurance. For more information, visit www.nationwide.com.",
        "logo": "/images/sponsors/nationwide_350x200.jpg"
      },
      {
        "name": "MPW",
        "level": "platinum",
        "link": "http://www.mpwservices.com/",
        "description": "MPW offers a variety of industrial cleaning, water treatment, facility management, environmental management and container management services to thousands of clients throughout North America. Our diversified industrial services are applicable to a wide array of customer needs and enable clients to prosper in today’s competitive environment. MPW improves operating reliability and profitability by coupling the best trained professionals with the most innovative technologies. MPW’s in-house engineers and fabrication technicians customize proprietary tooling and mobile operating systems to accommodate specialized industry requirements and ever changing environmental demands.",
        "logo": "/images/sponsors/MPW.png"

      },
      {
        "name": "DynamIT",
        "level": "platinum",
        "link": "https://www.dynamit.com",
        "description": "At Dynamit, we create web and mobile applications. Together with our clients, we identify big opportunities and solve big problems. We serve our clients as strategists, creatives, and engineers. We shine in situations where simple, graceful web and mobile experiences can make a big difference in the way our clients do business. We believe that — done right — technology should simplify. It should make life easier for our clients and their customers. Clients include: Hilton Worldwide, NiSource, La Quinta Inns & Suites, M/I Homes, Panda Express, Donatos Pizza, BJ's Restaurants & Brewhouse, Mercy Health, Kindred Healthcare, Tire Discounters, White Castle and Thorntons.",
        "logo": "/images/sponsors/DYNAMIT.png"

      }
    ],
    "gold": [
      {
        "name": "ICC",
        "level": "gold",
        "link": "http://icctechnology.com/",
        "description": "User First. Data Driven. Technology Development. ICC is changing the way companies solve their business challenges, and the above principles dictate our solutions. This approach inspires intelligent, precise technology that addresses the human need. Three practice areas give ICC the necessary latitude to overcome the complex challenges that businesses face.",
        "logo": "/images/sponsors/ICC.png"

      },
      {
        "name": "Kroger",
        "level": "gold",
        "link": "http://www.kroger.com/",
        "description": "Kroger Technology’s vision is to be the most valued technology organization in retail. In many ways, Kroger is a technology company that’s in the business of selling groceries. We deliver leading-edge technology and innovative solutions that improve the customer and associate experience. Kroger is an industry leader in leveraging data science to personalize the shopping experience for our customers. We also use The Internet Of Things in our stores to automate processes, reduce operation costs and improve quality. Kroger Technology associates are passionate about revolutionizing the grocery retail business through innovation.",
        "logo": "/images/sponsors/KROGER.png"

      },
      {
        "name": "Microsoft Azure Advocates ",
        "level": "gold",
        "link": "https://developer.microsoft.com/en-us/advocates/index.html",
        "description": "We write, speak, and dream in code. Our global team is maniacal about making the world amazing for developers of all backgrounds. Connect with us, write code with us, and let's meet up and talk cloud and all things developer!",
        "logo": "/images/sponsors/Microsoft.png"

      }
    ],
    "silver": [
      {
        "name": "Improving",
        "level": "silver",
        "link": "http://www.improving.com/",
        "description": "Improving is a technology management and consulting services firm deeply rooted in our commitment to establishing trust — not only with each other but with our clients, partners, communities, and others. We aspire to do this through creating transparency, delivering results, continuously improving, clarifying expectations, and keeping our commitments.",
        "logo": "/images/sponsors/improvingenterprises.png"
      },
      {
        "name": "ComResource",
        "level": "silver",
        "link": "http://comresource.com/",
        "description": "ComResource is one of Central Ohio’s top IT consulting companies solving IT problems for growing businesses for over 25 years. ComResource is a unique player in the IT Consulting industry because of its expertise and experience in delivering a diversity of solutions, not only Professional Services Staffing (Project Management, Business & Data Analysis, AppDev, DevOps and QA), but also Information Security, Cloud & Virtual, Data Quality, B2B Integration, Systems & Network, Disaster Recovery & Business Continuity, VoIP, Wireless, and Storage. ComResource has built Centers of Excellence to fully engage and motivate over 220 employees and to ensure the highest level of innovation for more than 200 clients. On multiple occasions, ComResource has been recognized as a “Best Places To Work”, “Corporate Caring Award Finalist” and a “Fast Fifty 50” award winner. In 2017, ComResource was named the US SMB Rising Star Heartland Partner of the Year by Microsoft’s US Small and Mid-sized Business (SMB) Group.",
        "logo": "/images/sponsors/COMRESOURCE.png"
      },
      {
        "name": "AWH",
        "level": "silver",
        "link": "http://awh.net/",
        "description": "AWH is a 23-year old digital product consulting, user experience, and software development firm located in Dublin, OH. From startups to enterprise, we collaborate with clients to build great digital products through strong product management. Our team of experts helps organizations make product decisions driven and validated by customer/user focus and deliver products that solve high-value problems. Areas of expertise include user experience (UX), application and data architecture, APIs, data and analytics, Internet of Things (IoT), and artificial intelligence and machine learning.",
        "logo": "/images/sponsors/awh_350x200.jpg"
      },
      {
        "name": "Manifest",
        "level": "silver",
        "link": "http://manifestcorp.com/",
        "description": "Enjoy Code. It’s more than a slogan. It’s our mission statement, our code of conduct, our mantra, our obsession, - our ethos. For over 20 years Manifest consultants have been making a difference in some of the most esteemed businesses in Columbus. Our commitment to training enables our consultants and clients to continuously adapt and grow with the advancement of new technologies. Our areas of expertise include: Java & .NET Development, Acceptance Test Driven Development, Test Automation, Project Management, Business Analysis and Agile Mentoring. Come see why Manifest was honored again in 2017 by Columbus CEO magazine as a Top Workplace in Central Ohio. We invite you to visit the Manifest booth and start a conversation about how we may help you on your path to career happiness. Enjoy.",
        "logo": "/images/sponsors/ManifestSolutions.png"
      },
      {
        "name": "Cover My Meds",
        "level": "silver",
        "link": "https://www.covermymeds.com/main/careers/",
        "description": "CoverMyMeds is one of the fastest growing healthcare technology companies in the US. We help prescribers and pharmacies submit Prior Authorization requests for any drug and nearly all health plans - 100% free - to get millions of patients on their medications every single year. Our team of highly-productive healthcare enthusiasts with a passion for helping others is the best thing about working here. On-site chef and paid benefits? Yeah, we have those too. But don’t take our word for it. We’ve been named to Glassdoor's top 50 places to work in the nation, Inc. 500’s list three times, were awarded one of the top places to work by Modern Healthcare and three times won best places to work in Columbus, Ohio.",
        "logo": "/images/sponsors/cmm_350x200.jpg"

      },
      {
        "name": "Pillar",
        "level": "silver",
        "link": "http://pillartechnology.com/",
        "description": "We're a technology consulting powerhouse rooted in extreme programming and flourishing in rock-solid code, design thinking and marketing. We breathe life into big ideas, delivering industry-disrupting opportunities at lightning speed.",
        "logo": "/images/sponsors/pillar-180x95.jpg"

      },
      {
        "name": "CareWorks",
        "level": "silver",
        "link": "https://www.careworkstech.com/",
        "description": "For more than 18 years, CareWorks Tech has been delivering technology solutions that drive results. As your advocate, the common thread across our associates is crafting the right tech-savvy solutions. Whether it’s IT Consulting, Infrastructure Services, Security, Enterprise Service Management, or Interactive, we’re all about finding solutions that advance your business. Our ongoing client relationships speak to our collaborative partnerships.",
        "logo": "/images/sponsors/Careworks.png"
      },
      {
        "name": "Huntington",
        "level": "silver",
        "link": "https://www.huntington.com/",
        "description": "Huntington Bancshares Incorporated is a regional bank holding company headquartered in Columbus, Ohio, with $104 billion of assets and a network of 966 branches and 1,848 ATMs across eight Midwestern states. Founded in 1866, The Huntington National Bank and its affiliates provide consumer, small business, commercial, treasury management, wealth management, brokerage, trust, and insurance services. Huntington also provides auto dealer, equipment finance, national settlement, and capital market services that extend beyond its core states. Visit huntington.com for more information.",
        "logo": "/images/sponsors/HUNTINGTON.png"
      },
      {
        "name": "JumpMind",
        "level": "silver",
        "link": "http://www.jumpmind.com/",
        "description": "JumpMind is a commercial open source software company specializing in data replication and integration software for the enterprise. SymmetricDS is a flexible data replication server that syncs databases and files in near real time across a heterogeneous environment. Metl is a lightweight, web-based integration platform for building and running data flows between disparate systems. As open source software developers, we value openness, innovation, passion for our work, and having fun while working hard. We provide consulting, development, training, and 24/7 support for our software.",
        "logo": "/images/sponsors/JUMPMIND.png"
      },
      {
        "name": "Doc Halo",
        "level": "silver",
        "link": "https://www.dochalo.com/",
        "description": "Doc Halo’s clinical communication platform, Halo Spectrum, is transforming patient care by streamlining real-time communication among physicians, nurses and staff. The mobile app and online console provide secure, HIPAA-compliant texting. Robust care coordination tools integrate with hospital systems to allow instant access to EHRs, critical and clinical teams, on-call schedules, call centers, labs and directories. Exclusively designed for healthcare, the Doc Halo clinical communication platform is used by several of the most prestigious organizations in the country.",
        "logo": "/images/sponsors/DOCHALO.png"
      },
      {
        "name": "Alliance Data Card Services",
        "level": "silver",
        "link": "https://knowmoresellmore.com/",
        "description": "Alliance Data’s card services business develops market-leading private label, co-brand, and business credit card programs for many of the world's most recognizable brands. Through our branded credit programs, we help build more profitable relationships between our partners and their cardmembers, and drive lasting loyalty. We uphold our Know more. Sell more. promise by leveraging unmatched customer insights, advanced analytics, and broad-reaching innovative capabilities. It's how we deliver increased sales to our partners, build enduring loyalty to their brands, and provide more value to our cardmembers.",
        "logo": "/images/sponsors/ALLIANCEDATA.png"
      }
    ]
  },
  "year2019": {
    "principal": [
      {
        "name": "AWH",
        "link": "http://www.awh.net/",
        "description": "AWH is a 24-year old digital product consulting, user experience, and software development firm located in Dublin, OH. AWH’s mission is to collaborate with clients to fully understand business needs, collectively define the project, and generate an approach that consistently improves results and delivers an exceptional experience. From startups to enterprises, AWH turns ideas into reality through our awesome team members and their expertise in user experience (UX), application and data architecture, APIs, data and analytics, Internet of Things (IoT), and artificial intelligence and machine learning.",
        "logo": "/images/sponsors/awh_350x200.png"

      },
      {
        "name": "IGS",
        "link": "https://igs.com",
        "description": "With nearly 30 years of experience in the energy industry, the IGS family of companies provides the following to over one million customers across the country: natural gas, electricity, and home warranty products; power generation solutions off the grid; clean, domestic alternative fueling options; and solar solutions. We focus on empowering consumers to make choices that best fit their energy needs. Our community investment program, IGS Impact, provides employees with opportunities to get involved with causes that are meaningful to both the company and to them personally.",
        "logo": "/images/sponsors/IGS.png"
      },
      {
        "name": "Workstate",
        "link": "https://www.workstate.com/",
        "description": "Workstate is a digital transformation powerhouse with over 20 years of experience and a reputation for internalizing our clients' mission-critical initiatives, and creating solutions to meet their goals. We go the extra mile by partnering with our clients to surpass their own expectations, year after year. In other words, our clients' success is our success. We do this by taking our cues from our employees. From our newest junior consultant, to our most senior architect, our employees impact our business with their best ideas, and their collaboration across teams and across clients. We wouldn’t have it any other way.  Workstate specializes in Digital Transformation, CMS and Digital Experience Platforms, CX strategy, Enterprise and Legacy applications, and custom software development teams.",
        "logo": "/images/sponsors/workstate_350x200.png"
      },
      {
        "name": "Insight",
        "link": "https://www.insight.com/en_US/solve/digital-innovation.html",
        "description": "Insight Digital Innovation, formerly Cardinal Solutions, is global technology company committed to helping clients innovate smarter so they can create digital experiences that drive differentiation, competitive advantage, and loyalty.",
        "logo": "/images/sponsors/insight_350x200.png"
      },
      {
        "name": "New Relic",
        "link": "https://www.newrelic.com/",
        "description": "New Relic provides the real-time insights that software-driven businesses need to innovate faster. New Relic’s cloud platform makes every aspect of modern software and infrastructure observable, so companies can find and fix problems faster, build high-performing DevOps teams, and speed up transformation projects. Learn why more than 50% of the Fortune 100 trust New Relic at newrelic.com.",
        "logo": "/images/sponsors/NewRelic_350x200.png"
      },
      {
        "name": "Bold Penguin",
        "link": "https://www.boldpenguin.com/",
        "description": "Bold Penguin is the highly efficient commercial insurance Exchange that connects businesses, agents, and carriers to match the right quote in record time.",
        "logo": "/images/sponsors/boldpenguin_350x200.png"
      }
    ],
    "platinum": [
      {
        "name": "Leading EDJE",
        "link": "http://leadingedje.com",
        "description": "Leading EDJE helps our partners solve their most complex business challenges by building the highest quality custom solutions….and we do it better than anyone else! Since 2007, we have created a unique culture which promotes high positive energy with an entrepreneurial spirit. Our firm is made of exceptionally talented professionals who deliver exceptional results, and our clients are made from a wide array of industries but have a common goal of choosing a partner who provides distinct, creative solutions. We choose to work and live deliberately via our uncompromising core values, of Put Team First, Is Dedicated to Growth, Does the Right Thing…Not the Right Now Thing, Is Authentic and Clear and Approaches Problem Solving Passionately.",
        "logo": "/images/sponsors/leadingedje_350x200.png"

      },
      {
        "name": "HMB",
        "link": "https://hmbnet.com",
        "description": "HMB is a professional services firm that specializes in software & product development, and infrastructure solutions. We hire full-time, salaried consultants in Columbus, OH & Louisville, KY. If you want to develop your career and have fun, join us! :)",
        "logo": "/images/sponsors/hmb-350x200.png"

      },
      {
        "name": "OCLC",
        "link": "https://www.oclc.org/en/home.html",
        "description": "OCLC, a worldwide library services organization headquartered in Dublin, Ohio, is a leader in information technologies and innovative online services. With office locations around the globe, OCLC employees are dedicated to offering premier services and software to help libraries cut costs while keeping pace with the demands of our information-driven society.",
        "logo": "/images/sponsors/oclc.png"

      },
      {
        "name": "MPW",
        "link": "http://www.mpwservices.com/",
        "description": "MPW offers a variety of industrial cleaning, water treatment, facility management, environmental management and container management services to thousands of clients throughout North America. Our diversified industrial services are applicable to a wide array of customer needs and enable clients to prosper in today’s competitive environment. MPW improves operating reliability and profitability by coupling the best trained professionals with the most innovative technologies. MPW’s in-house engineers and fabrication technicians customize proprietary tooling and mobile operating systems to accommodate specialized industry requirements and ever changing environmental demands.",
        "logo": "/images/sponsors/MPW.png"

      },
      {
        "name": "Sogeti",
        "link": "https://www.us.sogeti.com/",
        "description": "We are a leading provider of technology and engineering services, partnering with our clients to make cutting-edge solutions thanks to our valuable world-class expertise in existing and emerging technologies. With over 50 years of experience, Sogeti offers a comprehensive portfolio of services including Insights & Data, Digital Transformation, Digital Manufacturing, Applications & Cloud Technology, and Digital Assurance & Testing. At the heart of our team is a passion for technology and people. Armed with our comprehensive, standard-defining portfolio of solutions, and hyper-focused, client-centric model, we leverage cutting-edge technology to deliver innovative results and best-in-class service to our clients.",
        "logo": "/images/sponsors/sogeti_350x200.png"

      },
      {
        "name": "Pillar",
        "link": "http://www.pillartechnology.com/",
        "description": "Pillar Technology has been uncovering and executing industry-disrupting opportunities for over 20 years, and now we’ve joined forces with Accenture Industry X.0 to revolutionize the world of connected physical products and services. We’ve cracked the code on smart connected by bringing all the necessary capabilities under one roof—strategy, product design, software and hardware engineering—creating a seamless, End2End process.",
        "logo": "/images/sponsors/pillar-350x200.png"

      },
      {
        "name": "Manifest",
        "level": "platinum",
        "link": "http://manifestcorp.com/",
        "description": "Individuals Making A Difference. It’s more than a slogan. It’s our mission statement, our code of conduct, our mantra, our obsession, - our ethos. Since 1994 Manifest consultants have been making a difference in some of the most esteemed businesses in Columbus. Our commitment to training enables our consultants and clients to continuously adapt and grow with the advancement of new technologies. Our areas of expertise include: Java & .NET Development, Acceptance Test Driven Development, Test Automation, Project Management, Business Analysis and Agile Mentoring. Come see why Manifest was honored for the 4th consecutive year by Columbus CEO magazine as a Top Workplace in Central Ohio. We invite you to visit the Manifest booth and start a conversation about how we may help you on your path to career happiness. Code Forever!",
        "logo": "/images/sponsors/manifest_350x200.png"

      },
      {
        "name": "Root",
        "level": "platinum",
        "link": "https://root.engineering/",
        "description": "Root Insurance is the nation’s first licensed insurance carrier powered entirely by mobile and founded on the principle that car insurance rates should be based on how you drive, not who you are. We use data science and technology to identify and insure good drivers, reducing insurance premiums for good drivers as a result. Car insurance is a compulsory product — it’s literally illegal to drive without it. Unfortunately, people are paying significantly more than they should be because their car insurance carrier only looks at their demographics and not how they drive. We’re fixing that. Root was started in 2015 with backing from Drive Capital. Although creating an insurance carrier from scratch was an audacious undertaking, we realized we needed to own everything end-to-end to build an exceptional insurance experience. With schlep blindness in full effect, we made it happen. Most insurance carriers were started a century ago and are running on an amalgamation of technology that is decades old. Root is the manifestation of “software is eating the world” in insurance. Our core expertise is responding to trends in technology by incorporating new sources of data into insurance pricing and building great products and user experiences on top of it. Root is where it is today due to the hard work, ingenuity, and exceptional performance of the people here. We’ve been fortunate to build an incredibly talented team that has brought this idea to life, and we're striving to grow that team by hiring more exceptional people.",
        "logo": "/images/sponsors/root_350x200.png"
      }
    ],
    "gold": [
      {
        "name": "ComResource",
        "link": "http://comresource.com/",
        "description": "ComResource is one of Central Ohio’s top IT consulting companies solving IT problems for growing businesses for over 25 years. ComResource is a unique player in the IT Consulting industry because of its expertise and experience in delivering a diversity of solutions, not only Professional Services Staffing (Project Management, Business & Data Analysis, AppDev, DevOps and QA), but also Information Security, Cloud & Virtual, Data Quality, B2B Integration, Systems & Network, Disaster Recovery & Business Continuity, VoIP, Wireless, and Storage. ComResource has built Centers of Excellence to fully engage and motivate over 220 employees and to ensure the highest level of innovation for more than 200 clients. On multiple occasions, ComResource has been recognized as a “Best Places To Work”, “Corporate Caring Award Finalist” and a “Fast Fifty 50” award winner. In 2017, ComResource was named the US SMB Rising Star Heartland Partner of the Year by Microsoft’s US Small and Mid-sized Business (SMB) Group.",
        "logo": "/images/sponsors/COMRESOURCE.png"

      },
      {
        "name": "Cover My Meds",
        "link": "https://www.covermymeds.com/main/careers/",
        "description": "CoverMyMeds is one of the fastest growing healthcare technology companies in the US. We help prescribers and pharmacies submit Prior Authorization requests for any drug and nearly all health plans - 100% free - to get millions of patients on their medications every single year. Our team of highly-productive healthcare enthusiasts with a passion for helping others is the best thing about working here. On-site chef, flexible hours and paid benefits? Yeah, we have those too. But don’t take our word for it. We’ve been named to Glassdoor's top 50 places to work in the nation, Inc. 500’s list three times, were awarded one of the top places to work by Modern Healthcare and three times won best places to work in Columbus, Ohio.",
        "logo": "/images/sponsors/cmm_350x200.png"

      },
      {
        "name": "Improving",
        "link": "http://www.improving.com/",
        "description": "Improving is a technology management and consulting services firm deeply rooted in our commitment to establishing trust — not only with each other but with our clients, partners, communities, and others. We aspire to do this through creating transparency, delivering results, continuously improving, clarifying expectations, and keeping our commitments.",
        "logo": "/images/sponsors/improvingenterprises.png"

      },
      {
        "name": "Nationwide",
        "link": "https://www.nationwide.com",
        "description": "Nationwide, a Fortune 100 company based in Columbus, Ohio, is one of the largest and strongest diversified insurance and financial services organizations in the U.S. and is rated A+ by both A.M. Best and Standard & Poor’s. The company provides a full range of insurance and financial services, including auto, commercial, homeowners, farm and life insurance; public and private sector retirement plans, annuities and mutual funds; banking and mortgages; excess & surplus, specialty and surety; pet, motorcycle and boat insurance. For more information, visit www.nationwide.com.",
        "logo": "/images/sponsors/nationwide_350x200.jpg"

      },
      {
        "name": "Progress",
        "link": "http://www.telerik.com/",
        "description": "Progress (NASDAQ: PRGS) offers the leading platform for developing and deploying mission-critical business applications. The creator of the award-winning Telerik .NET and Kendo UI JavaScript user interface components/controls, reporting solutions and productivity tools, Progress offers all the tools developers need to build high-performance modern apps with outstanding UI. Learn more about the Progress developer tools at: www.telerik.com or 1-781-280-4000.",
        "logo": "/images/sponsors/Progress_350x200.png"
      },
      {
        "name": "Smart Data",
        "link": "https://smartdata.net/",
        "description": "Smart Data is a team of problem solvers focused on improving your business. We partner with health care, retail, and manufacturers helping them increase productivity, modernize business processes, and deliver smarter experiences to their clients. We do this by helping them design and develop custom digital solutions, integrate systems, and provide data transformation services.",
        "logo": "/images/sponsors/smartdata_350x200.png"
      },
      {
        "name": "Halo Communications",
        "link": "https://www.halocommunications.com/",
        "description": "Halo’s mission is to streamline communication, so clinicians can focus on care. The Halo Clinical Communication Platform™ enables mobile collaboration for healthcare by consolidating secure messaging, on-call scheduling, VoIP and mobilization of critical alerts, all powered by the Halo Clinical Workflow Engine™. This enterprise-wide platform helps protect clinicians from alert fatigue and burnout, and patients from delays in care. Our team is transforming healthcare! From our collaborative office space to open-minded environment, you'll quickly find that we encourage fresh ideas, lifelong learning, and teamwork. Ready to join?",
        "logo": "/images/sponsors/halo_350x200.png"
      },
      {
        "name": "Callibrity",
        "link": "https://www.callibrity.com/",
        "description": "Callibrity is a developer owned and managed custom software development firm that is dedicated to providing clients with quality software, improved coding practices, and modernized tech stacks. Having such a niche focus is not for everyone, but Callibrity believes that focus on software development fosters interesting work that keeps consultants engaged long-term and grows their technical knowledge exponentially.",
        "logo": "/images/sponsors/callibrity_350x200.png"
      },
      {
        "name": "Fast Switch",
        "link": "https://fastswitch.com",
        "description": "",
        "logo": "/images/sponsors/fastswitch_350x200.jpg"
      },
      {
        "name": "ICC",
        "level": "gold",
        "link": "http://icctechnology.com/",
        "description": "User First. Data Driven. Technology Development. ICC is changing the way companies solve their business challenges, and the above principles dictate our solutions. This approach inspires intelligent, precise technology that addresses the human need. Three practice areas give ICC the necessary latitude to overcome the complex challenges that businesses face.",
        "logo": "/images/sponsors/ICC_350x200.png"
      },
      {
        "name": "DynamIT",
        "link": "https://www.dynamit.com",
        "description": "At Dynamit, we create web and mobile applications. Together with our clients, we identify big opportunities and solve big problems. We serve our clients as strategists, creatives, and engineers. We shine in situations where simple, graceful web and mobile experiences can make a big difference in the way our clients do business. We believe that — done right — technology should simplify. It should make life easier for our clients and their customers. Clients include: Hilton Worldwide, NiSource, La Quinta Inns & Suites, M/I Homes, Panda Express, Donatos Pizza, BJ's Restaurants & Brewhouse, Mercy Health, Kindred Healthcare, Tire Discounters, White Castle and Thorntons.",
        "logo": "/images/sponsors/dynamit_350x200.png"

      }
    ],
    "silver": [
      {
        "name": "Living Portrait Photography",
        "level": "silver",
        "link": "https://livingportraitphotography.com/",
        "description": "The most beautiful things in life are often not something you can pose for. While i’m well versed in portraiture, my favorite shoots leave room for candid shots which really represent the love and magic in an authentic moment.",
        "logo": "/images/sponsors/livingportrait_350x200.png"

      }

    ]
  },
  "year2020": {
    "principal": [
      {
        "name": "Workstate",
        "level": "principal",
        "link": "https://www.workstate.com/",
        "description": "Workstate is a digital transformation powerhouse with over 20 years of experience and a reputation for internalizing our clients' mission-critical initiatives, and creating solutions to meet their goals. We go the extra mile by partnering with our clients to surpass their own expectations, year after year. In other words, our clients' success is our success. We do this by taking our cues from our employees. From our newest junior consultant, to our most senior architect, our employees impact our business with their best ideas, and their collaboration across teams and across clients. We wouldn’t have it any other way.  Workstate specializes in Digital Transformation, CMS and Digital Experience Platforms, CX strategy, Enterprise and Legacy applications, and custom software development teams.",
        "logo": "/images/sponsors/workstate_350x200.png"
      },
      {
        "name": "Vaco",
        "level": "principal",
        "link": "https://www.vaco.com/",
        "description": "Vaco provides expert business consulting, permanent placement, executive search and strategic staffing for companies around the world, in the areas of accounting, finance, technology, healthcare, operations, administration and more.",
        "logo": "/images/sponsors/vaco_350x200.png"
      },
      {
        "name": "CapTech",
        "level": "principal",
        "link": "https://www.captechconsulting.com/",
        "description": "CapTech is a national IT management consulting firm that bridges the gap between business and technology. We partner with some of the world's most successful companies to design, develop, and manage technical and digital solutions that delight customers, drive insights, and meet strategic objectives.",
        "logo": "/images/sponsors/captech_350x200.jpg"
      },
      {
        "name": "Accenture",
        "level": "principal",
        "link": "https://www.accenture.com/us-en",
        "description": "We're a technology consulting company with over 20 years of uncovering and executing industry-disrupting opportunities at lightning speed.",
        "logo": "/images/sponsors/accenture_350x200.jpg"
      },
      {
        "name": "IGS",
        "level": "principal",
        "link": "https://igs.com",
        "description": "With nearly 30 years of experience in the energy industry, the IGS family of companies provides the following to over one million customers across the country: natural gas, electricity, and home warranty products; power generation solutions off the grid; clean, domestic alternative fueling options; and solar solutions. We focus on empowering consumers to make choices that best fit their energy needs. Our community investment program, IGS Impact, provides employees with opportunities to get involved with causes that are meaningful to both the company and to them personally.",
        "logo": "/images/sponsors/IGS_350x200.png"
      },
      {
        "name": "Insight",
        "level": "principal",
        "link": "https://www.insight.com/en_US/solve/digital-innovation.html",
        "description": "Insight Digital Innovation, formerly Cardinal Solutions, is global technology company committed to helping clients innovate smarter so they can create digital experiences that drive differentiation, competitive advantage, and loyalty.",
        "logo": "/images/sponsors/insight_350x200.png"
      },
      {
        "name": "Root",
        "level": "principal",
        "link": "https://root.engineering/",
        "description": "We’ve taken the archaic, $250-billion insurance industry and challenged everything about it. Using telematics, we’ve built one of the fastest growing tech companies. And we’re just getting started.",
        "logo": "/images/sponsors/root_350x200b.png"
      },
      {
        "name": "TEKsystems",
        "level": "principal",
        "link": "https://www.teksystems.com/",
        "description": "At TEKsystems, we’re obsessed with technology. Its power to change everything. Technology fuels our passion and commitment to helping organizations do what they set out to. When we engage, we bring fresh ideas that help you galvanize your performance. Refine your strategy. Spark new energy. The future—and how we get there—depends on those who build, connect, create and transform our world. The most successful and innovative businesses are already doing it, and we’re skilled experts at bringing in the teams and support needed to thrive.",
        "logo": "/images/sponsors/teksystems_350x200.png"
      }
    ],
    "platinum": [
      {
        "name": "Upstart",
        "level": "platinum",
        "link": "https://www.upstart.com/",
        "description": "Upstart is the leading AI lending platform designed to expand access to affordable credit. With $5.7B in loans originated, Upstart’s loss rates are less than half those of industry peers for borrowers with similar FICO scores. Our product consistently ranks at the top of leading review sites like CreditKarma and Trustpilot.",
        "logo": "/images/sponsors/upstart_350x200.png"
      },
      {
        "name": "HMB",
        "level": "platinum",
        "link": "https://hmbnet.com",
        "description": "HMB is a professional services firm that specializes in software & product development, and infrastructure solutions. We hire full-time, salaried consultants in Columbus, OH & Louisville, KY. If you want to develop your career and have fun, join us! :)",
        "logo": "/images/sponsors/hmb-350x200.jpg"
      },
      {
        "name": "OCLC",
        "level": "platinum",
        "link": "https://www.oclc.org/en/home.html",
        "description": "OCLC, a worldwide library services organization headquartered in Dublin, Ohio, is a leader in information technologies and innovative online services. With office locations around the globe, OCLC employees are dedicated to offering premier services and software to help libraries cut costs while keeping pace with the demands of our information-driven society.",
        "logo": "/images/sponsors/oclc_350x200.png"
      },
      {
        "name": "Manifest",
        "level": "platinum",
        "link": "http://manifestcorp.com/",
        "description": "Enjoy Code. It’s more than a slogan. It’s our mission statement, our code of conduct, our mantra, our obsession, - our ethos. For over 20 years Manifest consultants have been making a difference in some of the most esteemed businesses in Columbus. Our commitment to training enables our consultants and clients to continuously adapt and grow with the advancement of new technologies. Our areas of expertise include: Java & .NET Development, Acceptance Test Driven Development, Test Automation, Project Management, Business Analysis and Agile Mentoring.",
        "logo": "/images/sponsors/manifest_350x200.png"
      },
      {
        "name": "ComResource",
        "level": "platinum",
        "link": "http://comresource.com/",
        "description": "We are problem-solvers by nature. More than 200 of us…and growing. Customizing processes and technology are our specialties. The more complicated the IT challenge, the better. Having delivered strategic IT solutions for over 25 years, we’ve gotten pretty good at it too. At least that’s what our 200+ clients are telling us. And because we get to work on so many cool and different projects for cream-of-the-crop companies, we have attracted the best and brightest talent. We have an unmatched team spirit which really makes work fun. Probably the reason we are a “Best Places to Work” for multiple years in a row.",
        "logo": "/images/sponsors/COMRESOURCE.png"
      },
      {
        "name": "Revel IT",
        "level": "platinum",
        "link": "https://www.revelit.com/",
        "description": "Revel IT is a young and high energy company, we aim to help consultants and candidates land fulfilling jobs that offer real career growth. Our goal is to treat our consultants and clients the way we would like others to treat us — we are honest, stay true to our word, and work in the best interest of our clients, consultants, and candidates. Many say they work this way, but few actually do. We are a company that does. Our mission is to find and provide the best talent for clients and excellent career opportunities for consultants and candidates — whom we treat as part of our team.",
        "logo": "/images/sponsors/revelit_350x200.png"
      },
      {
        "name": "CAS",
        "level": "platinum",
        "link": "https://www.cas.org/",
        "description": "CAS, a division of the American Chemical Society specializing in scientific information solutions, partners with R&D organizations globally to provide actionable insights that help them plan, innovate, protect their innovations, and predict how new markets and opportunities will evolve. Scientific researchers, patent professionals and business leaders around the world across commercial, academic and government sectors rely on our solutions and services to advise discovery and strategy. Leverage our unparalleled content, specialized technology, and unmatched human expertise to customize solutions that will give your organization an information advantage. With more than 110 years' experience, no one knows more about scientific information than CAS. Learn more at www.cas.org.",
        "logo": "/images/sponsors/cas_350x200.jpg"
      },
      {
        "name": "DMG",
        "level": "platinum",
        "link": "https://divisionsmg.com/",
        "description": "We are a tech-based company, one the fastest growing private enterprises in the Tri-State. Divisions Maintenance Group is a Top Workplace, Inc. 5000 member, rising quickly on the Fast 55 and Top Privately Held Companies lists. We are a national leader in Facilities Maintenance, handling thousands of properties across the country from one, centralized location in Newport, KY. Our tech team participates in the design, development, and implementation of large complex technology solutions. We have great respect and interest in new technologies and applications.",
        "logo": "/images/sponsors/dmg_350x200.jpg"
      }
    ],
    "gold": [
      {
        "name": "G20",
        "level": "gold",
        "link": "https://www.g2o.com/",
        "description": "When it comes to engaging customers, good enough just isn’t good enough. So how do you reach the standard you need? We think the best place to start is to work with someone who gets it. When our clients come to us with tough customer engagement challenges, we bring integrated design, technology, and data solutions that break down silos, dig into what customers really care about, and deliver meaning with every new interaction.",
        "logo": "/images/sponsors/g2o_350x200.png"
      },    
      {
        "name": "Leading EDJE",
        "level": "gold",
        "link": "http://leadingedje.com",
        "description": "Leading EDJE helps our partners solve their most complex business challenges by building the highest quality custom solutions….and we do it better than anyone else! Since 2007, we have created a unique culture which promotes high positive energy with an entrepreneurial spirit. Our firm is made of exceptionally talented professionals who deliver exceptional results, and our clients are made from a wide array of industries but have a common goal of choosing a partner who provides distinct, creative solutions. We choose to work and live deliberately via our uncompromising core values, of Put Team First, Is Dedicated to Growth, Does the Right Thing…Not the Right Now Thing, Is Authentic and Clear and Approaches Problem Solving Passionately.",
        "logo": "/images/sponsors/leadingedje_350x200.png"
      }
     ],
    "silver": [
    ]
  },
  "year2021": {
    "platinum": [
      {
        "name": "Revel IT",
        "level": "platinum",
        "link": "https://www.revelit.com/",
        "description": "Revel IT is a young and high energy company, we aim to help consultants and candidates land fulfilling jobs that offer real career growth. Our goal is to treat our consultants and clients the way we would like others to treat us — we are honest, stay true to our word, and work in the best interest of our clients, consultants, and candidates. Many say they work this way, but few actually do. We are a company that does. Our mission is to find and provide the best talent for clients and excellent career opportunities for consultants and candidates — whom we treat as part of our team.",
        "logo": "/images/sponsors/revelit_350x200.png"
      },
      {
        "name": "Workstate",
        "level": "platinum",
        "link": "https://www.workstate.com/",
        "description": "Workstate is a digital transformation powerhouse with over 20 years of experience and a reputation for internalizing our clients' mission-critical initiatives, and creating solutions to meet their goals. We go the extra mile by partnering with our clients to surpass their own expectations, year after year. In other words, our clients' success is our success. We do this by taking our cues from our employees. From our newest junior consultant, to our most senior architect, our employees impact our business with their best ideas, and their collaboration across teams and across clients. We wouldn’t have it any other way.  Workstate specializes in Digital Transformation, CMS and Digital Experience Platforms, CX strategy, Enterprise and Legacy applications, and custom software development teams.",
        "logo": "/images/sponsors/workstate_350x200.png"
      },
      {
        "name": "OCLC",
        "level": "platinum",
        "link": "https://www.oclc.org/en/home.html",
        "description": "OCLC, a worldwide library services organization headquartered in Dublin, Ohio, is a leader in information technologies and innovative online services. With office locations around the globe, OCLC employees are dedicated to offering premier services and software to help libraries cut costs while keeping pace with the demands of our information-driven society.",
        "logo": "/images/sponsors/oclc_350x200.png"
      },
      {
        "name": "CAS",
        "level": "platinum",
        "link": "https://www.cas.org/",
        "description": "CAS, a division of the American Chemical Society specializing in scientific information solutions, partners with R&D organizations globally to provide actionable insights that help them plan, innovate, protect their innovations, and predict how new markets and opportunities will evolve. Scientific researchers, patent professionals and business leaders around the world across commercial, academic and government sectors rely on our solutions and services to advise discovery and strategy. Leverage our unparalleled content, specialized technology, and unmatched human expertise to customize solutions that will give your organization an information advantage. With more than 110 years' experience, no one knows more about scientific information than CAS. Learn more at www.cas.org.",
        "logo": "/images/sponsors/cas_350x200.png"
      },
      {
        "name": "Daugherty Business Solutions",
        "level": "platinum",
        "link": "https://www.daugherty.com/",
        "description": "At Daugherty Business Solutions, we believe in providing exceptional value to our clients, an incredible work environment for our employees, and unwavering support to the communities in which we live. Those guiding principles and the great people making up Team Daugherty are the reason we’re still going strong after 35 years.",
        "logo": "/images/sponsors/daugherty_350x200.jpg"
      },
      {
        "name": "Manifest",
        "level": "platinum",
        "link": "http://manifestcorp.com/",
        "description": "Enjoy Code. It’s more than a slogan. It’s our mission statement, our code of conduct, our mantra, our obsession, - our ethos. For over 20 years Manifest consultants have been making a difference in some of the most esteemed businesses in Columbus. Our commitment to training enables our consultants and clients to continuously adapt and grow with the advancement of new technologies. Our areas of expertise include: Java & .NET Development, Acceptance Test Driven Development, Test Automation, Project Management, Business Analysis and Agile Mentoring.",
        "logo": "/images/sponsors/manifest_350x200.png"
      },
      {
        "name": "Progress",
        "level": "platinum",
        "link": "http://www.telerik.com/",
        "description": "Progress (NASDAQ: PRGS) offers the leading platform for developing and deploying mission-critical business applications. The creator of the award-winning Telerik .NET and Kendo UI JavaScript user interface components/controls, reporting solutions and productivity tools, Progress offers all the tools developers need to build high-performance modern apps with outstanding UI. Learn more about the Progress developer tools at: www.telerik.com or 1-781-280-4000.",
        "logo": "/images/sponsors/Progress_350x200.png"
      },
      {
        "name": "Insight",
        "level": "principal",
        "link": "https://www.insight.com/en_US/solve/digital-innovation.html",
        "description": "Insight Digital Innovation, formerly Cardinal Solutions, is global technology company committed to helping clients innovate smarter so they can create digital experiences that drive differentiation, competitive advantage, and loyalty.",
        "logo": "/images/sponsors/insight_350x200.png"
      },
      {
        "name": "Veeva",
        "level": "principal",
        "link": "https://www.veeva.com/",
        "description": "Find your perfect job at Veeva. We build enterprise cloud software and provide services that enable the global life sciences industry to bring new therapies to.",
        "logo": "/images/sponsors/veeva_350x200.jpg"
      },
      {
        "name": "CGI",
        "level": "principal",
        "link": "https://www.cgi.com/",
        "description": "Founded in 1976, CGI is among the largest IT and business consulting services firms in the world. We are insights-driven and outcomes-based to help accelerate returns on your investments. Across hundreds of locations worldwide, we provide comprehensive, scalable and sustainable IT and business consulting services that are informed globally and delivered locally. In all we do, our goal is to build trusted relationships through client proximity, providing industry and technology expertise to help you meet the needs of your customers and citizens.",
        "logo": "/images/sponsors/cgi_350x200.jpg"
      },
      {
        "name": "Progress",
        "level": "principal",
        "link": "http://www.telerik.com/",
        "description": "Progress (NASDAQ: PRGS) offers the leading platform for developing and deploying mission-critical business applications. The creator of the award-winning Telerik .NET and Kendo UI JavaScript user interface components/controls, reporting solutions and productivity tools, Progress offers all the tools developers need to build high-performance modern apps with outstanding UI. Learn more about the Progress developer tools at: www.telerik.com or 1-781-280-4000.",
        "logo": "/images/sponsors/Progress_350x200.png"
      }  
    ]    
  },
  "year2022": {
    "principal": [
      {
        "name": "Insight",
        "level": "principal",
        "link": "https://www.insight.com/en_US/solve/digital-innovation.html",
        "description": "Insight Digital Innovation, formerly Cardinal Solutions, is global technology company committed to helping clients innovate smarter so they can create digital experiences that drive differentiation, competitive advantage, and loyalty.",
        "logo": "/images/sponsors/insight_350x200.png"
      },
      {
        "name": "IGS",
        "level": "principal",
        "link": "https://igs.com",
        "description": "With nearly 30 years of experience in the energy industry, the IGS family of companies provides the following to over one million customers across the country: natural gas, electricity, and home warranty products; power generation solutions off the grid; clean, domestic alternative fueling options; and solar solutions. We focus on empowering consumers to make choices that best fit their energy needs. Our community investment program, IGS Impact, provides employees with opportunities to get involved with causes that are meaningful to both the company and to them personally.",
        "logo": "/images/sponsors/IGS_350x200v2.png"
      },
      {
        "name": "OCLC",
        "level": "principal",
        "link": "https://www.oclc.org/en/home.html",
        "description": "OCLC, a worldwide library services organization headquartered in Dublin, Ohio, is a leader in information technologies and innovative online services. With office locations around the globe, OCLC employees are dedicated to offering premier services and software to help libraries cut costs while keeping pace with the demands of our information-driven society.",
        "logo": "/images/sponsors/oclc_350x200.jpg"
      },      
      {
        "name": "CapTech",
        "level": "principal",
        "link": "https://www.captechconsulting.com/",
        "description": "CapTech is a national IT management consulting firm that bridges the gap between business and technology. We partner with some of the world's most successful companies to design, develop, and manage technical and digital solutions that delight customers, drive insights, and meet strategic objectives.",
        "logo": "/images/sponsors/captech_350x200.png"
      },
      {
        "name": "TEKsystems",
        "level": "principal",
        "link": "https://www.teksystems.com/",
        "description": "At TEKsystems, we’re obsessed with technology. Its power to change everything. Technology fuels our passion and commitment to helping organizations do what they set out to. When we engage, we bring fresh ideas that help you galvanize your performance. Refine your strategy. Spark new energy. The future—and how we get there—depends on those who build, connect, create and transform our world. The most successful and innovative businesses are already doing it, and we’re skilled experts at bringing in the teams and support needed to thrive.",
        "logo": "/images/sponsors/teksystems_350x200.png"
      },
      {
        "name": "Progress",
        "level": "principal",
        "link": "http://www.telerik.com/",
        "description": "Progress (NASDAQ: PRGS) offers the leading platform for developing and deploying mission-critical business applications. The creator of the award-winning Telerik .NET and Kendo UI JavaScript user interface components/controls, reporting solutions and productivity tools, Progress offers all the tools developers need to build high-performance modern apps with outstanding UI. Learn more about the Progress developer tools at: www.telerik.com or 1-781-280-4000.",
        "logo": "/images/sponsors/Progress_350x200.png"
      }     
    ],
    "platinum": [
      {
        "name": "CGI",
        "level": "platinum",
        "link": "https://www.cgi.com/",
        "description": "Founded in 1976, CGI is among the largest IT and business consulting services firms in the world. We are insights-driven and outcomes-based to help accelerate returns on your investments. Across hundreds of locations worldwide, we provide comprehensive, scalable and sustainable IT and business consulting services that are informed globally and delivered locally. In all we do, our goal is to build trusted relationships through client proximity, providing industry and technology expertise to help you meet the needs of your customers and citizens.",
        "logo": "/images/sponsors/cgi_350x200v2.jpg"
      },
      {
        "name": "Revel IT",
        "level": "platinum",
        "link": "https://www.revelit.com/",
        "description": "Revel IT is a young and high energy company, we aim to help consultants and candidates land fulfilling jobs that offer real career growth. Our goal is to treat our consultants and clients the way we would like others to treat us — we are honest, stay true to our word, and work in the best interest of our clients, consultants, and candidates. Many say they work this way, but few actually do. We are a company that does. Our mission is to find and provide the best talent for clients and excellent career opportunities for consultants and candidates — whom we treat as part of our team.",
        "logo": "/images/sponsors/revelit_350x200.png"
      },
      {
        "name": "Upstart",
        "level": "platinum",
        "link": "https://www.upstart.com/",
        "description": "Upstart is the leading AI lending platform designed to expand access to affordable credit. With $5.7B in loans originated, Upstart’s loss rates are less than half those of industry peers for borrowers with similar FICO scores. Our product consistently ranks at the top of leading review sites like CreditKarma and Trustpilot.",
        "logo": "/images/sponsors/upstart_350x200.png"
      },
      {
        "name": "CAS",
        "level": "platinum",
        "link": "https://www.cas.org/",
        "description": "CAS, a division of the American Chemical Society specializing in scientific information solutions, partners with R&D organizations globally to provide actionable insights that help them plan, innovate, protect their innovations, and predict how new markets and opportunities will evolve. Scientific researchers, patent professionals and business leaders around the world across commercial, academic and government sectors rely on our solutions and services to advise discovery and strategy. Leverage our unparalleled content, specialized technology, and unmatched human expertise to customize solutions that will give your organization an information advantage. With more than 110 years' experience, no one knows more about scientific information than CAS. Learn more at www.cas.org.",
        "logo": "/images/sponsors/cas_350x200.png"
      },
      {
        "name": "DMG",
        "level": "platinum",
        "link": "https://divisionsmg.com/",
        "description": "We are a tech-based company, one the fastest growing private enterprises in the Tri-State. Divisions Maintenance Group is a Top Workplace, Inc. 5000 member, rising quickly on the Fast 55 and Top Privately Held Companies lists. We are a national leader in Facilities Maintenance, handling thousands of properties across the country from one, centralized location in Newport, KY. Our tech team participates in the design, development, and implementation of large complex technology solutions. We have great respect and interest in new technologies and applications.",
        "logo": "/images/sponsors/dmg_350x200.jpg"
      }
    ],
    "gold": [
      {
        "name": "Improving",
        "level": "gold",
        "link": "http://www.improving.com/",
        "description": "Improving is a technology management and consulting services firm deeply rooted in our commitment to establishing trust — not only with each other but with our clients, partners, communities, and others. We aspire to do this through creating transparency, delivering results, continuously improving, clarifying expectations, and keeping our commitments.",
        "logo": "/images/sponsors/improvingenterprises.png"
      },
      {
        "name": "Nationwide",
        "level": "gold",
        "link": "https://www.nationwide.com",
        "description": "Nationwide, a Fortune 100 company based in Columbus, Ohio, is one of the largest and strongest diversified insurance and financial services organizations in the U.S. and is rated A+ by both A.M. Best and Standard & Poor’s. The company provides a full range of insurance and financial services, including auto, commercial, homeowners, farm and life insurance; public and private sector retirement plans, annuities and mutual funds; banking and mortgages; excess & surplus, specialty and surety; pet, motorcycle and boat insurance. For more information, visit www.nationwide.com.",
        "logo": "/images/sponsors/nationwide_350x200.jpg"
      }
    ],
    "silver": [
    ]     
  }
}
